[{"Id":"a02a0671-98a9-4365-a7b5-b963c6b4b046","FirstName":"Joseph","LastName":"Andaverde","Biography":"Joe is a full stack software developer from Kansas City. He has professional experience training hundreds of software developers about how to take advantage of Node.js through his organization called NodeLabs. He is continuously seeking to learn and find ways to share his experiences.","GravatarUrl":"//www.gravatar.com/avatar/20bcd9c84412ff9a04188982293ca539","TwitterLink":"https://twitter.com/joeandaverde","GitHubLink":"https://github.com/joeandaverde","LinkedInProfile":"https://www.linkedin.com/in/joeandaverde","BlogUrl":null},{"Id":"0d77e7b9-8315-4197-a135-6091933cbda0","FirstName":"Emma","LastName":"Armstrong","Biography":"Emma Armstrong is a test engineer and all-round do-gooder at Red Gate, and has been baking quality into software for over 14 years. In that time she’s gotten her hands dirty with both manual and automated testing and had the opportunity to dig into everything from compilers to web applications.\r\nShe’s worked with most methodologies, gotten to grips with technologies ranging from chipset hardware to UI (and everything in between), managed test teams and is currently working on one of Red Gate’s latest developer tools.","GravatarUrl":"//www.gravatar.com/avatar/113cf25968d18a6ce4f66be22e6a73f8","TwitterLink":"https://twitter.com/emmaatester","GitHubLink":"","LinkedInProfile":"https://www.linkedin.com/pub/emma-armstrong/83/616/bab","BlogUrl":"http://taooftesting.co.uk/"},{"Id":"fc75be0a-81e9-427d-8e46-f1c8a22d7d89","FirstName":"Jason","LastName":"Awbrey","Biography":"Jason Awbrey is a developer based in Spring, Texas.  He runs PostDotNet Consulting, a one-man shop that focuses on Xamarin development.  He is a Xamarin MVP, a Xamarin Certified Mobile Developer, and a Xamarin Consulting Partner.  He is a frequent speaker, author, and member of the Houston community, serving as President of North Houston .NET Users Group and Co-Lead of the Houston Xamarin Meetup.","GravatarUrl":"//www.gravatar.com/avatar/8170deb73d6e2169e227aa588a0b32b8","TwitterLink":"https://twitter.com/jkawbrey","GitHubLink":"","LinkedInProfile":"http://www.linkedin.com/in/jawbrey/","BlogUrl":"http://blog.postdotnet.com"},{"Id":"8b72c588-1d4c-4ae3-ae74-52cfdc21f873","FirstName":"Jonathan","LastName":"Baker","Biography":"Jonathan Baker is currently a Consulting Software Engineer at OCLC, inc.  Jonathan has been a Java developer for over 13 years, including stints at Nationwide Financial Services and the Amazon Merchant Services team.    He has previously presented at the Central Ohio Java User's Group (COJUG) as well as at Codemash.  Jonathan is passionate about developer productivity, and getting things done well.","GravatarUrl":"//www.gravatar.com/avatar/fc19a1ff4cf29d634bef2e36d3ef986b","TwitterLink":"","GitHubLink":"https://github.com/solidjb","LinkedInProfile":"http://www.linkedin.com/pub/jonathan-baker/5/414/7b2/","BlogUrl":null},{"Id":"0384c3c8-0c6e-4abd-90d5-7638c9df4fd5","FirstName":"Lance","LastName":"Ball","Biography":"Lance Ball is a Senior Software Engineer at Red Hat and the creator of Nodyn (http://nodyn.io). He works in the JBoss division as a member of Project Odd, a team of developers working on polyglot OSS research and prototyping. He is a core contributor to DynJS and TorqueBox, a JRuby application server. Previously, Lance maintained the Javascript language modules for Vert.x: mod-lang-rhino, mod-lang-dynjs, and mod-lang-js.","GravatarUrl":"//www.gravatar.com/avatar/b0690265bd924922c38abcc377748957","TwitterLink":"https://twitter.com/lanceball","GitHubLink":"https://github.com/lance","LinkedInProfile":"https://www.linkedin.com/in/lanceball","BlogUrl":null},{"Id":"7d6f5121-3399-4482-9840-e2011bd1e46f","FirstName":"Adam","LastName":"Barney","Biography":"Adam Barney is a nerd.  After buying a Commodore 64 with money from his paper route in the 4th grade, he’s never stopped learning about computers and how to make these stupid machines do cool things.  Adam is now a Microsoft MVP (C#) and ASPInsider, and runs his own independent consulting company, Barney Consulting in Lincoln, NE. ","GravatarUrl":"//www.gravatar.com/avatar/4eeb4579d42156861b31c22643613dd9","TwitterLink":"https://twitter.com/cabarney","GitHubLink":"https://github.com/cabarney","LinkedInProfile":"https://www.linkedin.com/in/cadambarney","BlogUrl":"http://adambarney.com/"},{"Id":"d833d110-3d44-4b9e-8569-27a3ac2bc72a","FirstName":"Dylan","LastName":"Barrell","Biography":"Vice President of Product Development at Deque Systems and inventor of the Amaze and FireEyes products. 20+ years of enterprise software development as a developer, product manager and founder. 6 years of intensive focus on accessibility with a passion for making the accessible development process more efficient while at the same time increasing the quality of the output.\r\n\r\nPassionate about JavaScript, Web development and software development process improvement.\r\n\r\nAccessibility contributor to the jQuery-UI library, maintainer of multiple other open source libraries including gulp-coverage and the a11yfy accessibility library for jQuery","GravatarUrl":"//www.gravatar.com/avatar/9a2aeb0fe64defd59981e795de51a465","TwitterLink":"https://twitter.com/dylanbarrell","GitHubLink":"https://github.com/dylanb","LinkedInProfile":null,"BlogUrl":"http://unobfuscated.blogspot.com/"},{"Id":"13ad1778-7239-4aac-b1fa-3dfdf174068d","FirstName":"Nerdy","LastName":"Beardo","Biography":"Software architect on the .NET stack, Nerdy Beardo has been programming since the age of 13, professionally since 15. A lover of the C# programming language since .NET 1.0, Classic ASP and PHP before that. Always loved creating applications and am a security and cryptography aficionado specifically on web application security.","GravatarUrl":"//www.gravatar.com/avatar/98bf55144f7e2f3ab18cf6a3e5fdb019","TwitterLink":"https://twitter.com/nerdybeardo","GitHubLink":"https://github.com/nerdybeardo","LinkedInProfile":null,"BlogUrl":"http://www.nerdybeardo.com"},{"Id":"4b841b94-b4a6-435b-8957-33bf4c4eabeb","FirstName":"Branden","LastName":"Bellanca","Biography":"Branden Bellanca is a new face in the IT crowd. After graduating from West Virginia University in December, he jumped into the industry in the heart of Ohio. While in school, he worked as a Project Manager, helping guide the design and construction of a fully functioning, solar powered Smart House for the U.S. Department of Energy Solar Decathlon.  He has some experience in development and currently works as an automator and QA in the testing space, but is ultimately eager to continue learning and growing as a software craftsman. He has a passion to help people and eventually would like to coach and teach in the field. In his free time, Branden enjoys the outdoors (I’m a West Virginian), reading, and playing guitar. ","GravatarUrl":"//www.gravatar.com/avatar/06f6516772eca8763479753e2746e328","TwitterLink":"","GitHubLink":"","LinkedInProfile":"http://www.linkedin.com/pub/branden-bellanca/69/a71/42a","BlogUrl":null},{"Id":"3ced0b93-06e0-42e0-be28-f1267bcaf0a4","FirstName":"James","LastName":"Bender","Biography":"James has been involved in software development and architecture for almost 20 years. He has worked as a developer and architect on everything from small, single-user applications to Enterprise-scale, multi-user systems.  His specialties are .NET development and architecture, TDD, SOA, WCF, Web Development, cloud computing, and agile development methodologies. He is an experienced mentor and author. James is a Microsoft MVP, Chairman of the Midwest Tech Fest and former President of the Central Ohio .NET Developers Group.  James's book \"Professional Test Driven Development with C#: Developing Real World Applications with TDD\" was released in May of 2011. James's Twitter ID is JamesBender","GravatarUrl":"//www.gravatar.com/avatar/25ddbfa83fef9e5f8f1e15c73d1de9e1","TwitterLink":"https://twitter.com/jamesbender","GitHubLink":"https://github.com/jamesbender","LinkedInProfile":null,"BlogUrl":"http://www.JamesCBender.com"},{"Id":"a9577010-0c95-44c6-9cce-654bdad3c0da","FirstName":"Anthony","LastName":"Bennett","Biography":"Anthony Bennett is a Software Engineer at Dynamit. He has been writing JavaScript since before jQuery was a thing. He has lived in Panama (the country); Florida; Vancouver, BC; California; and Ohio, where he has gone native. When not developing, Anthony enjoys spending time with his beautiful wife and their adorable children.","GravatarUrl":"//www.gravatar.com/avatar/9c267751e01a65adfcf6942c565656fe","TwitterLink":"","GitHubLink":"https://github.com/anthonybennett","LinkedInProfile":"http://www.linkedin.com/in/anthonylbennett/","BlogUrl":null},{"Id":"5cf75ddc-4d47-40cd-8199-7f1ad0acf781","FirstName":"Nino","LastName":"Benvenuti","Biography":"Nino Benvenuti has been getting paid for making 0s and 1s do his bidding since 1996.  He succumbed to the spell of mobile and embedded devices right before the turn of the century and has been challenging himself with them ever since.  He has spent his entire professional career in consulting, where he has designed and built solutions across many problem domains for a diverse set of customers. ","GravatarUrl":"//www.gravatar.com/avatar/023eec99ae3f7c7079374be929d0f455","TwitterLink":"https://twitter.com/ninob","GitHubLink":"","LinkedInProfile":"https://www.linkedin.com/in/ninobenvenuti","BlogUrl":null},{"Id":"e846dcc8-bdc7-4acc-a694-02530b5d12e5","FirstName":"Kevin","LastName":"Berridge","Biography":"Kevin Berridge is passionate about techniques and principles for building great software regardless of language or platform.  For the past 10 years, he has been working on products that make a difference at Pointe Blank Solutions where he is in charge of Software Engineering.  He ran the Burning River Developers meetup in Cleveland, and has presented at CodeMash, StirTrek, and a handful of meetups.  When not hacking, he's probably playing jazz trombone or running.","GravatarUrl":"//www.gravatar.com/avatar/35e74c48a612d8a6786f8ab6424b49a1","TwitterLink":"https://twitter.com/kberridge","GitHubLink":"","LinkedInProfile":null,"BlogUrl":"http://kevinberridge.com"},{"Id":"bea1a4d6-f7b9-41b1-b290-f83b6f614fc8","FirstName":"Paul","LastName":"Blasucci","Biography":"As a passionate – yet pragmatic – enthusiast of multi-paradigm and ployglot engineering, Paul has spent the past 16 years blending a disparate horde of languages, technologies, and methodologies in the develop of compelling solutions to a wide range of business problems. He especially enjoys solving challenges in distributed computing and visual communications. When not hacking, he may be found in Nashville, TN, indulging his love of food, music, and geekery with friends, family, and other innocent by-standers.","GravatarUrl":"//www.gravatar.com/avatar/b860f2c5e825f9e777947b50cff3d2a5","TwitterLink":"https://twitter.com/pblasucci","GitHubLink":"https://github.com/pblasucci","LinkedInProfile":"http://linkedin.com/in/pblasucci","BlogUrl":"http://pblasucci.wordpress.com"},{"Id":"fcc8aca2-899e-445d-8124-2611c364be30","FirstName":"Stephen","LastName":"Blower","Biography":"With more than eighteen years of testing experience within a multitude of testing fields from gaming, internet service provisioning, gambling, financial services and version control organisations, Stephen Blower has seen the testing industry evolve from strict dogmatic practices to more flexible context driven ways of working towards delivering quality. Stephen is a strong advocate for tester recognition and he does not accept testing being left to the end. He often provokes debate on what is often seen by non-testers and testers alike as an industry stuck in the middle ages, non-dynamic and stagnant. To promote this he organises a regular peer group for those involved within development where the tester’s role is hotly debated and controversial topics are encouraged.","GravatarUrl":"//www.gravatar.com/avatar/8bfbb865562726ae4a05caf1d0b4727b","TwitterLink":"https://twitter.com/badbud65","GitHubLink":"https://github.com/https://github.com/badbud65","LinkedInProfile":"https://www.linkedin.com/in/stephenblower","BlogUrl":"http://www.stephenblower.co.uk/"},{"Id":"fb46aa8e-e81e-498d-a7d5-638a1c643679","FirstName":"Jimmy","LastName":"Bogard","Biography":"Jimmy has delivered solutions ranging from shrinkwrapped products to enterprise ecommerce applications for Fortune 100 customers. Jimmy is a member of the ASPInsiders group, the C# Insiders group, and received the \"Microsoft Most Valuable Professional\" (MVP) award for ASP.NET in 2009-2014. Jimmy is also the creator and lead developer of the popular OSS library AutoMapper.","GravatarUrl":"//www.gravatar.com/avatar/cc359c5ccf90d7a24b5976316797b5ec","TwitterLink":"https://twitter.com/jbogard","GitHubLink":"https://github.com/jbogard","LinkedInProfile":null,"BlogUrl":"http://jimmybogard.lostechies.com"},{"Id":"21fbddff-2331-4717-90d1-6d662f4b64bb","FirstName":"Danielle","LastName":"Boldt","Biography":"Danielle is a Senior Software Engineer at Renaissance Learning Inc.  She has nearly 20 years of software development expertise that ranges from design and programming through to quality assurance and deployment.  Over the course of the last year, Danielle has focused on all things automation and is eager to share the wealth of knowledge she has acquired.  When not at work, you might find Danielle out on her motorcycle, at the indoor rock climbing gym with her husband and children, or tucked at home learning to play the guitar.","GravatarUrl":"//www.gravatar.com/avatar/2b11b70b0ba0f3b33ddd9041454c3cc7","TwitterLink":"https://twitter.com/codatrix","GitHubLink":"","LinkedInProfile":"http://www.linkedin.com/in/danielleboldt","BlogUrl":"http://codatrix.ca/blog"},{"Id":"9725474f-2638-4ee9-8ea8-b3847933769c","FirstName":"Mathias","LastName":"Brandewinder","Biography":"Mathias Brandewinder has been developing software on .NET for about 10 years, and loving every minute of it, except maybe for a few release days. His language of choice was C#, until he discovered F# and fell in love with it. He enjoys arguing about code and how to make it better, and gets very excited when discussing TDD or F#. His other professional interests include math, forecasting, machine learning and probability. Mathias is a Microsoft F# MVP and the founder of Clear Lines Consulting. He is based in San Francisco, blogs at www.clear-lines.com/blog, and can be found on Twitter as @brandewinder.","GravatarUrl":"//www.gravatar.com/avatar/656d522b5a93ff6b337d66c0a247e7cb","TwitterLink":"https://twitter.com/brandewinder","GitHubLink":"https://github.com/mathias-brandewinder","LinkedInProfile":"https://www.linkedin.com/in/brandewinder","BlogUrl":"http://www.clear-lines.com/blog/"},{"Id":"55051bcd-69d3-487e-822d-9025cf3b0c86","FirstName":"Zach","LastName":"Briggs","Biography":"Zach Briggs has farmed, sorted mail 2nd shift, maintained industrial equipment, and created predictive models. Now he’s a developer and instructor for Test Double where he uses JavaScript, Ruby, Node, and Clojure to solve hard problems. He speaks and writes about learning more quickly, scalable architectures, business intelligence, dev ops, and JavaScript app development. He's a foodie, coffee enthusiast, and cocktail nerd but tries not to be a jerk about those things. Zach probably wants to be your friend. He lives in Chicago, IL.\r\n","GravatarUrl":"//www.gravatar.com/avatar/dfe1da2a83fe42aa8a07df1f0071becb","TwitterLink":"https://twitter.com/theotherzach","GitHubLink":"https://github.com/theotherzach","LinkedInProfile":"https://www.linkedin.com/pub/zach-briggs/30/a81/a08","BlogUrl":"http://theotherzach.com/"},{"Id":"0cb77264-4c9d-473a-95d4-7735106631ad","FirstName":"Eric","LastName":"Browning","Biography":"A designer working in NE Ohio, I've worked on many game projects, client work at agencies, and several startups. \r\nSolving hard problems through efficient and usable design is my passion, and I've been fortunate enough to work closely with coders/developers my whole career, allowing us to learn from each other, and build better projects.","GravatarUrl":"//www.gravatar.com/avatar/e7553f804fdd69cf5a39bba0c8834686","TwitterLink":"https://twitter.com/browningeric","GitHubLink":"","LinkedInProfile":"https://www.linkedin.com/in/ericbrowning","BlogUrl":null},{"Id":"3425edb2-7355-407e-805c-833c3c310883","FirstName":"Alex","LastName":"Burkhart","Biography":"Software Artisan at Neo Innovation","GravatarUrl":"//www.gravatar.com/avatar/e418839a7b75d39194c812c58b4f6913","TwitterLink":"https://twitter.com/saterus","GitHubLink":"https://github.com/saterus","LinkedInProfile":null,"BlogUrl":null},{"Id":"665c02b7-e021-46ea-8635-e6fa6d9c3818","FirstName":"Dusty","LastName":"Burwell","Biography":"Dusty has been developing software professionally for 10 years. He wrangles HTTP in multiple languages trying to make the web fast for Groupon in Chicago. He spent his past lives building software in .Net on Windows to help doctor's save people. More than anything he likes to write, speak, and ship software.","GravatarUrl":"//www.gravatar.com/avatar/6343ef938226f72218388cb8f0eec754","TwitterLink":"https://twitter.com/dustyburwell","GitHubLink":"https://github.com/dustyburwell","LinkedInProfile":null,"BlogUrl":"http://dustyburwell.com"},{"Id":"4163247f-ab54-494e-a2d6-12040f79425b","FirstName":"Benjamin","LastName":"Bykowski","Biography":"Ben has more than 18 years’ experience in both technology and information architecture. Prior to creating Falls Digital, Ben led a team of designers, developers, and technology professionals at a Cleveland-based interactive marketing agency. With roots in Ohio, Ben was classically trained in computer science & engineering at the University of Toledo. A life-long learner, Ben earned an MBA from Case Western. Ben is a Microsoft Certified Professional and a member of the Information Architecture Institute and Interaction Design Association. Off the grid, Ben is the married father of three boys and is civically engaged in his local and regional community. He enjoys sailing, snowboarding, traveling, reading, and is a practiced chef and DJ.","GravatarUrl":"//www.gravatar.com/avatar/be48605fbebdfc63d4b7bda8ec43d62b","TwitterLink":"https://twitter.com/sirius_b","GitHubLink":"https://github.com/siriusbits","LinkedInProfile":"http://www.linkedin.com/in/benbykowski/","BlogUrl":"http://w3rdofmouth.com/"},{"Id":"1702ac5d-8845-435f-b2dc-6bbb70c7778a","FirstName":"Julie","LastName":"Cameron","Biography":"Julie Cameron is a frontend developer for Articulate working remotely in the metro-Detroit area.  She is co-founder of the Ann Arbor chapter of Girl Develop It and instructor at Girl Develop It Detroit.  Julie is a fan of Sassy CSS and modular architecture, responsive web design, and is a student of JavaScript and self-improvement.","GravatarUrl":"//www.gravatar.com/avatar/f49c5780805d9e50bdc348069a7db59d","TwitterLink":"https://twitter.com/jewlofthelotus","GitHubLink":"https://github.com/jewlofthelotus","LinkedInProfile":"https://www.linkedin.com/in/jewlofthelotus","BlogUrl":"http://juliecameron.com/blog"},{"Id":"511df42a-1095-49c5-8752-0c21f19fe486","FirstName":"Dustin","LastName":"Campbell","Biography":"Dustin Campbell is a principal program manager on the Visual Studio team, where he works on the Visual Basic and C# language service experiences. Currently, he is focused on the future of Visual Basic and C# in the .NET Compiler Platform (\"Roslyn\"). Before joining Microsoft, he developed much of the low-level plumbing of the award-winning CodeRush and Refactor! products at DevExpress. A regular speaker, Dustin is a noted authority in many advanced areas of the Microsoft .NET Framework and dives deep \"under the hood\" of any technology that he works with.\r\n\r\nDustin is a programming language nut. His favorite color is blue.","GravatarUrl":"//www.gravatar.com/avatar/b9f663242e51ae1e97aa5c2e396884fe","TwitterLink":"https://twitter.com/dcampbell","GitHubLink":"https://github.com/dustincampbell","LinkedInProfile":"https://www.linkedin.com/in/dustincampbell","BlogUrl":"http://diditwith.net"},{"Id":"bfc75e0f-1187-41f2-b463-715d85962ae1","FirstName":"Jon ","LastName":"Canady","Biography":"Jon Canady is a Senior Developer at CoverMyMeds, where he's helped grow and lead the software development department since the company's beginning, growing from a five-person PHP shop to a large polyglot team of talented developers.","GravatarUrl":"//www.gravatar.com/avatar/9a45082056ded462905aa0382900a9e4","TwitterLink":"https://twitter.com/joncanady","GitHubLink":"https://github.com/joncanady","LinkedInProfile":"https://www.linkedin.com/in/joncanady","BlogUrl":"http://joncanady.com"},{"Id":"754c2bc9-86fe-46d4-a378-d773e0b392db","FirstName":"Chad","LastName":"Carter","Biography":"Chad Carter has over 18 years of experience in professional software development. He started his own company, GlobalCove Technologies, which specializes in helping companies reach their goals and become more profitable by analyzing business processes to determine if a process change, a technology change or both are needed to be embraced.\r\n\r\nHe was also the CTO of Robertson Marketing Group where he architected and developed two different ecommerce platforms (each running ASP.NET) over the last decade and a half. The ecommerce systems serve more than 150 companies including more than 25 of the Fortune 500 companies.\r\n\r\nChad has authored two books on XNA Game Studio. He also authored a third book on Windows 8 app development using HTML5, CSS3 and JavaScript.\r\n\r\ndevweb101.com is a new video training website for web development that Chad launched in April of 2014. He enjoys creating content that help others learn what they need in order for them to start building great technology.\r\n\r\nWhen Chad is not helping business save money or helping developers with their craft you will find him spending time with his lovely wife and two precious daughters.\r\n","GravatarUrl":"//www.gravatar.com/avatar/e52c7408c38a7e523da688dc2d251686","TwitterLink":"https://twitter.com/kewlniss","GitHubLink":"https://github.com/kewlniss","LinkedInProfile":"http://www.linkedin.com/in/kewlniss","BlogUrl":"http://chadcarter.net/"},{"Id":"919bfa57-d844-4cff-bf89-e88957489b60","FirstName":"David","LastName":"Carver","Biography":"David Carver has over 20 years in software development, ranging from the big old Mainframe to mobile applications. His primary expertise are in E-Commerce and business to business development and deployment. He is a co-creator of the XSL Tools project at eclipse, and has been a committer on several eclipse projects including Vex, XQuery Tools.  He is creator of Serenity for Android a Plex Media Server client focused on the 10 foot viewing experience for Android TV, Google TV, and Amazon Fire TV devices.  At the Eclipse Foundation he is a member of the Eclipse Architecture Council.\r\n\r\nHe is currently working for Manifest Solutions doing Android and Eclipse development.","GravatarUrl":"//www.gravatar.com/avatar/fdec28d17fb2417999492a96fb338eae","TwitterLink":"https://twitter.com/kingargyle","GitHubLink":"https://github.com/kingargyle","LinkedInProfile":"https://www.linkedin.com/profile/view?id=3524861","BlogUrl":"http://intellectualcramps.wordpress.com/"},{"Id":"7bf0d181-ceba-4a4e-a829-b03fa77de40d","FirstName":"Adam","LastName":"Caudill","Biography":"Adam Caudill is a software developer with over 15 years of experience,  and independent security researcher with a focus on application security, secure communications, and cryptography.  Currently working on initiatives to improve the security and privacy of email and similar messaging systems. Active blogger, open source contributor, and advocate for user privacy and protection.","GravatarUrl":"//www.gravatar.com/avatar/49e14cf9f67c48aad082dec4f106f19a","TwitterLink":"https://twitter.com/adamcaudill","GitHubLink":"https://github.com/adamcaudill","LinkedInProfile":null,"BlogUrl":"https://adamcaudill.com"},{"Id":"96197ab2-0cec-464a-a625-9b443c44c465","FirstName":"Jim","LastName":"Christopher","Biography":"Jim loves to build things and take things apart.  He has an MA in Cognitive Psychology and gained 20 years of professional experience developing complex software projects in highly regulated industries, including education, gaming, finance, and defense. His professional drive is designing software, systems, and user experiences for automation, a theme that has earned him a four-time Microsoft MVP for PowerShell (2011-2015).  He currently works for himself at Code Owls LLC developing software that helps people do awesome things.","GravatarUrl":"//www.gravatar.com/avatar/176c5e601d4976378e18b9215927211a","TwitterLink":"https://twitter.com/beefarino","GitHubLink":"https://github.com/beefarino","LinkedInProfile":"https://www.linkedin.com/pub/jim-christopher/2/446/334","BlogUrl":"http://www.beefycode.com"},{"Id":"ee523a50-fab3-4117-9a75-0f87f71db04e","FirstName":"Kaitlan","LastName":"Chu","Biography":"Kaitlan (@KaitlanChu) is a Senior Usability Analyst at Rockwell Automation (NYSE: ROK), the world’s largest Fortune 500 company dedicated to industrial automation and information solutions.\r\n\r\nPrior to Rockwell, she was UX thought leader for a team in charge of the most-visited website among US hospitals. She started & instilled UX practices in Cleveland Clinic, a 40,000-employee organization; the results were presented as a case study at UX conferences.\r\n\r\nIn her previous/adventurous life in the start-up world, she led interaction design for database-driven, content-managed dynamic websites providing big data visualization. She later orchestrated UX strategies designed to market the resulting web products to Fortune 500 executives, e.g. Coca-Cola, Disney, bringing in multi-millions in revenue.\r\n\r\nKaitlan has spoken internationally at industry & academic conferences. She was selected to speak at UXPA International Conference 2012 & 2013, demonstrating new UX analysis methods stemming from collaboration between data scientists and UXers. As an academic, she authored usability studies funded by the National Science Foundation.\r\n","GravatarUrl":"//www.gravatar.com/avatar/100a90bb5fb93e23c7f5b376676d7f27","TwitterLink":"https://twitter.com/kaitlanchu","GitHubLink":"","LinkedInProfile":"http://www.linkedin.com/in/kaitlanchu","BlogUrl":null},{"Id":"725a9289-2455-42f3-92b1-4b227319595b","FirstName":"Stephen","LastName":"Cleary","Biography":"Stephen Cleary is a Christian, husband, and father who programs software in his spare time. :)\r\n\r\nHe is a Microsoft MVP and the author of \"Concurrency in C# Cookbook\" (O'Reilly) as well as several MSDN articles on async (including \"Best Practices in Asynchronous Programming\" and \"Patterns for Asynchronous MVVM Applications\"). He's also the top answerer for async/await questions on Stack Overflow.\r\n\r\nHis work usually deals with asynchronous and multithreaded programming, but he finds any challenging subject interesting. These days he uses C#/C++/JavaScript, but remains interested in many different languages.","GravatarUrl":"//www.gravatar.com/avatar/3db7b6e14d9da42751e4bab03bc4d034","TwitterLink":"https://twitter.com/astevecleary","GitHubLink":"https://github.com/stephencleary","LinkedInProfile":null,"BlogUrl":"http://blog.stephencleary.com/"},{"Id":"b6e9e556-70bc-41ff-bf71-6594418fecbe","FirstName":"Brad","LastName":"Colbow","Biography":"Brad Colbow is an independent UX/UI designer from Cleveland Ohio. Brad has built a reputation designing user interfaces and experiences for brands like Smucker's, Rubbermaid, Starbucks, The Cleveland Clinic and The Rock and Roll Hall of Fame. Design is fun, but Brad is probably best known for his comic strip “The Brads” which was published in .Net magazine and can bee seen on his personal website (bradcolbow.com) along with his newer comic work. He's also the co-organizer of the Cleveland Web Standards Association and the midwest's premiere web design conference, Rustbelt Refresh.","GravatarUrl":"//www.gravatar.com/avatar/75121e03fdd2e3ca5c5c505077814bae","TwitterLink":"https://twitter.com/bradcolbow","GitHubLink":"https://github.com/bradcolbow","LinkedInProfile":null,"BlogUrl":"http://bradcolbow.com/"},{"Id":"96610734-4656-4554-8825-711dff500e4a","FirstName":"Michael","LastName":"Collier","Biography":"Michael Collier serves as a Principal Cloud Architect for Aditi, a Microsoft NSI partner that focuses on cloud computing. He is a four-time Azure MVP and was the 2012 Azure MVP of the Year for his extraordinary community contributions.  Michael has had a successful 13-year career at various consulting and technology firms where he was instrumental in leading and developing solutions for a wide range of clients. He has a vast amount of experience in helping companies determine the best strategy for adopting cloud computing, and providing the insight, and hands-on experience to ensure they’re successful. Michael is also a respected technology community leader, and can often be found sharing his Azure insights and experiences at regional and national conferences.  ","GravatarUrl":"//www.gravatar.com/avatar/88bb040bfe336c9ccec0f24f706ca109","TwitterLink":"https://twitter.com/michaelcollier","GitHubLink":"https://github.com/mcollier","LinkedInProfile":"http://www.linkedin.com/in/mcollier/","BlogUrl":"http://www.michaelscollier.com"},{"Id":"5736f80b-9729-40f5-91e3-c45356c7e420","FirstName":"Amber","LastName":"Conville","Biography":"Coming Soon","GravatarUrl":"//www.gravatar.com/avatar/7c2a83b93fe0e5f2ed4c95c59367259c","TwitterLink":"","GitHubLink":"","LinkedInProfile":null,"BlogUrl":null},{"Id":"e6e46060-6998-40df-bfff-e4be13b90b5f","FirstName":"Ryan","LastName":"Cromwell","Biography":"Ryan Cromwell is a coder by trade with nearly 15 years of experience delivering solutions ranging from real-time customer loyalty systems and elegant user experiences to streamlined statistical process control software.  Having worked with passionate, high-performing Agile teams, Ryan ventured into the world of Scrum.org training and Agile coaching to replicate those amazing experiences.  Ryan’s passion remains delivering software as a member the Sparkbox Team in Dayton, OH.  He is co-founder of Dayton Clean Coders, the Dayton Elixir virtual Meetup, co-organizer of Southwest Ohio GiveCamp, and all around software community ally.  You can find Ryan at http://cromwellhaus.com and on Twitter as @cromwellryan.","GravatarUrl":"//www.gravatar.com/avatar/32de0bd2ba869609d26fd052a4622778","TwitterLink":"https://twitter.com/cromwellryan","GitHubLink":"https://github.com/cromwellryan","LinkedInProfile":"https://www.linkedin.com/in/cromwellryan","BlogUrl":"http://cromwellhaus.com"},{"Id":"72a342b3-9c58-460a-98f5-780e79e71560","FirstName":"Michael","LastName":"Crump","Biography":"Michael Crump is a Microsoft MVP, Pluralsight and MSDN author as well as an international speaker. He works at Telerik with a focus on everything mobile. You can reach him on Twitter @mbcrump or keep up with his blog by visiting michaelcrump.net.","GravatarUrl":"//www.gravatar.com/avatar/bc4ba4e314fc7f2585957898fcc78a76","TwitterLink":"https://twitter.com/mbcrump","GitHubLink":"https://github.com/mbcrump","LinkedInProfile":"http://www.linkedin.com/in/mbcrump/","BlogUrl":"http://michaelcrump.net"},{"Id":"1ed75aea-1301-40c3-8d0d-af03a2763414","FirstName":"Yan","LastName":"Cui","Biography":"Yan works as a server side developer at Gamesys where he develops scalable backend services for Gamesys's social games on mobile and Facebook. He's a co-author of the upcoming book F# Deep Dives for Manning Publishing. He's also a regular speaker on topics such as Aspect-Oriented Programming, F# and NoSQL, and he keeps an active blog at http://theburningmonk.com/","GravatarUrl":"//www.gravatar.com/avatar/0bbaed5a18c131ba152cf566e1becaf8","TwitterLink":"https://twitter.com/theburningmonk","GitHubLink":"https://github.com/theburningmonk","LinkedInProfile":"http://uk.linkedin.com/in/theburningmonk","BlogUrl":"http://theburningmonk.com"},{"Id":"e8288715-7e72-4d34-a957-74aa0d90ee5f","FirstName":"Michael","LastName":"Danko","Biography":"Mike Danko has held both Senior Rails Engineer and Senior Automation Engineer titles all in the same year, often at the same time. Born in the highlands of Scotland four hundred years ago, he is not alone. He never sleeps in a bed, only a chair, and only for seven minutes at a time, one glass eye always open. He can sing Dr. Suess' \"Oh The Places You'll Go\" in the voice of Michael McDonald. He's filled big shoes in developer and DevOps roles at startups, consultancies, and the enterprise, but only because he has size 16 feet. \r\n\r\nMike sings \"If it's difficult, you are doing it wrong\" all day long while using Tibetan throat singing techniques to chant \"if process is visible, it needs further automation\". He believes in he very core of his being that to live up to our potentials as developers, we need our tools to get out of our way. ","GravatarUrl":"//www.gravatar.com/avatar/6489f517b0bd2c63487d0b1a65665d5f","TwitterLink":"https://twitter.com/mikedanko","GitHubLink":"https://github.com/skord","LinkedInProfile":null,"BlogUrl":"http://mikedanko.me"},{"Id":"fe140c90-c0ae-4990-aa8b-5144f80ae97f","FirstName":"DJ","LastName":"Daugherty","Biography":"DJ has been using state models and asynchronous processing for many years to solve business problems for companies of all sizes. As small as a logistics software company responsible for the routing of trucks, a web hosting company responsible for the handling of website malware detection, to large-scale financial electronic processing and natural gas logistics management. I currently freelance within the technology and agile world along side Pillar Technology Consultants. I like to create business solutions for business problems... this might include the use of technology. I am all about people. I love to take seemingly complex problems and find simple solutions, providing business value and hopefully a great return on investment. I am a big fan of the under-rated vi editor and I love to eat, sleep, and breathe fly fishing... and now drones!","GravatarUrl":"//www.gravatar.com/avatar/5b94381f39bad8b12cf18e07ef43bea2","TwitterLink":"https://twitter.com/ddaugher","GitHubLink":"https://github.com/ddaugher","LinkedInProfile":"https://www.linkedin.com/in/daughertydj","BlogUrl":"https://medium.com/@ddaugher"},{"Id":"963e6e5b-f294-4335-ab14-896150e5fd0a","FirstName":"Bryan","LastName":"Davis","Biography":"Bryan Davis is currently a Consulting Software Engineer at OCLC, inc.  Bryan has been a Java developer for over 10 years, including stints at OpenText and Information Dimensions.  Bryan has previously been a speaker at Codemash, COJUG and IndyJUG.","GravatarUrl":"//www.gravatar.com/avatar/dbb3e1267cd9b68fbb62a516ebf461f8","TwitterLink":"https://twitter.com/iambryandavis","GitHubLink":"","LinkedInProfile":"https://www.linkedin.com/pub/bryan-davis/5/418/7ba/","BlogUrl":null},{"Id":"a34df934-9f99-4445-aecb-5ec0e18d7495","FirstName":"Kevin","LastName":"Davis","Biography":"Dr. Kevin P. Davis, or \"kpd\" as he's known in wider circles, came to technology from the field of high-energy physics, having completed his dissertation in bottom quark production at Fermilab in the late 90's.  But he found deep passion in technology and now works as an Architect and Team Lead primarily writing .NET web applications.  A strong community champion, he handles Communications for That Conference and has been known to run their Open Spaces program, too.  kpd is especially interested in technology management philosophy and employee motivation and engagement.  He often waxes technosophical at http://softwarearchaeology.blogspot.com.\r\n","GravatarUrl":"//www.gravatar.com/avatar/d70dbe437302f0300c2dbeebe7a1b497","TwitterLink":"https://twitter.com/kevinpdavis","GitHubLink":"https://github.com/daviskevinp","LinkedInProfile":null,"BlogUrl":"http://softwarearchaeology.blogspot.com"},{"Id":"aa0fd178-9662-4b74-8d40-fa236ba9d88c","FirstName":"Daniel","LastName":"Davis","Biography":"Daniel Davis is a Business Improvement Consultant, Agile Practitioner/Developer, Innovator, Hacker, and Maker. He's been working in Agile and Software Development for the last decade and is currently a Senior Executive Consultant with Pillar. He has spent the last few years focused on driving solutions at an enterprise level working with companies such as Delphi, AAA Life, General Motors, Blue Cross Blue Shield, Cengage Learning, and Delta Dental. Daniel's prior work background includes a wide range of disciplines such as mobile development, web development, design, marketing, and photography. His prevailing passion lies in helping businesses and people discover the true value within their efforts.","GravatarUrl":"//www.gravatar.com/avatar/1a0f2984a7532f18e9278f0c3e3e9d85","TwitterLink":"https://twitter.com/daniel_davis","GitHubLink":"https://github.com/danieldavis","LinkedInProfile":"http://www.linkedin.com/in/davisdaniel","BlogUrl":null},{"Id":"d02d6328-9107-44a6-92fe-0c7f9c45bcc0","FirstName":"Ravi","LastName":"Desai","Biography":"I have been an active developer in the Ann Arbor area since 1987.  I have developed on a wide variety of platforms ranging from VMS, early Mac OS, nearly every flavor of Unix (including OS/X), Windows, and most recently iOS.  I have also been active in the development community, being a past VP of the Ann Arbor Computer Society, and speaker at AACS, AADND, SEM.js, and CocoaHeads.","GravatarUrl":"//www.gravatar.com/avatar/d4fede378d3c469dfb90bca4009e14a3","TwitterLink":"https://twitter.com/ravi_s_desai","GitHubLink":"https://github.com/ravidesai","LinkedInProfile":"http://www.linkedin.com/pub/ravi-desai/b/91b/70/","BlogUrl":null},{"Id":"6e19a7c8-db38-480b-8258-9f9e72ae19b1","FirstName":"Mike","LastName":"Doel","Biography":"Mike Doel is VP of Engineering for Neo, providing leadership and guidance for the engineering work done by the company. At Neo, Mike has worked on projects including ones that bridged hardware and software, improved how patient care is provided by making it possible for teams of physicians to work together, and brought innovation to the fashion industry through the use of mobile technology and modern platforms. He has also been a leader in introducing innovative new frameworks and technologies into our client work.\r\n\r\nPrior to joining Neo, Mike co-founded a startup in the travel industry and led development, QA, and operations teams for America Online. ","GravatarUrl":"//www.gravatar.com/avatar/38716536d6ac1c63fc17ae4fa1cfca0c","TwitterLink":"https://twitter.com/mikedoel","GitHubLink":"https://github.com/mdoel","LinkedInProfile":"https://www.linkedin.com/in/mikedoel","BlogUrl":"http://www.mikedoel.com"},{"Id":"0858d0e5-564d-494d-aed6-8d5f744ebe37","FirstName":"Kathleen","LastName":"Dollard","Biography":"Kathleen Dollard wants to teach you to code better. There’s more to learn about the tools you use every day and the tools you aren’t yet using.  Coding is our passion and debugging is our challenge - you’ll be happier if you do both better. Kathleen’s written dozens of articles, spoken at conferences and user groups around the world, and pushes Microsoft to respond to your real world needs as a long time MVP. Her Open Source project RoslynDom offers alterative access to information in the .NET Compiler Platform, Roslyn with a load/interrogate/mutate/build SyntaxTree model. She has courses in the Pluralsight library and a series of C# 6 webcasts now available for free on WintellectNOW.","GravatarUrl":"//www.gravatar.com/avatar/85ffa8bf46389d3c399196f3497bd626","TwitterLink":"https://twitter.com/kathleendollard","GitHubLink":"https://github.com/kathleendollard","LinkedInProfile":"https://www.linkedin.com/in/kathleendollard","BlogUrl":"http://blogs.msmvps.com/kathleen/"},{"Id":"35d6c7e4-0d78-4184-867c-ff0fdcd9dc55","FirstName":"Attila","LastName":"Domokos","Biography":"Software crafter, guitar player and proud dad. CTO at @Hireology.","GravatarUrl":"//www.gravatar.com/avatar/522138482af09965f92a0ef9175d1aee","TwitterLink":"https://twitter.com/adomokos","GitHubLink":"https://github.com/adomokos","LinkedInProfile":"https://www.linkedin.com/in/adomokos","BlogUrl":"http://www.adomokos.com"},{"Id":"546c5ea5-376a-4b2b-9541-49f72c90ecf6","FirstName":"Matt","LastName":"Dopkiss","Biography":"Matt Dopkiss is a trained physicist, engineer and co-founder of Dynamit, one of the fastest-growing digital agencies in the United States. As CEO of Dynamit, Matt is responsible for the growth of the organization and its service offerings.\r\n","GravatarUrl":"//www.gravatar.com/avatar/e47cf536ce790e5d88aad4ba62d23ddc","TwitterLink":"https://twitter.com/dopkiss","GitHubLink":"","LinkedInProfile":"http://www.linkedin.com/in/dopkiss/","BlogUrl":null},{"Id":"fbd9b2d4-79d8-4ab8-8bcd-ad84c285d644","FirstName":"Cori","LastName":"Drew","Biography":"Cori Drew is a consultant with Improving Enterprises in Addison, TX. She started her programming career as a web developer before cutting her OOP teeth (& falling in love with C#) in 2003 in .NET Framework 1.1. Cori was a programmer for 8.5 years before discovering there was a developer community in 2009. Appreciation for growth & learning, enabled by our tech community, has inspired her to try to pay it forward.\r\n","GravatarUrl":"//www.gravatar.com/avatar/aa44c5ab28f9a658629b19ee7eeec627","TwitterLink":"https://twitter.com/coridrew","GitHubLink":"https://github.com/coridrew","LinkedInProfile":"https://www.linkedin.com/profile/view?id=2087050","BlogUrl":"https://truncatedcodr.wordpress.com/"},{"Id":"f4ee9fc6-7ed1-4adc-8eab-d8cc8b455709","FirstName":"Jim","LastName":"Duey","Biography":"Jim has been a professional programmer for 20+ years. This has included\r\nworking on embedded systems, industrial process controls, user facing\r\napplications, OS kernels, 2-way radio communications, data warehousing\r\nand distributed systems. He's used a wide range of languages from\r\nassembly and Forth through C++ and Clojure.","GravatarUrl":"//www.gravatar.com/avatar/e0731cde23f6de1006979c12551d1860","TwitterLink":"https://twitter.com/jimduey","GitHubLink":"https://github.com/jduey","LinkedInProfile":null,"BlogUrl":"http://clojure.net"},{"Id":"624c91f0-d63c-43fd-92bb-de84a2169c62","FirstName":"Andrew","LastName":"Dunkman","Biography":"Andrew, a front-end developer at Harvest, is in his ninth year of being amazed that his JavaScript functions. This is his third year at Codemash and his third hometown: he’s a former resident of Chicagoland and Kansas City, but now works from his home in Washington, DC. In his free time, he likes to help out with his local tech communities as an organizer of his local node.js meetup (formerly in Kansas City, currently in Washington, DC).","GravatarUrl":"//www.gravatar.com/avatar/2e055eb589fb86174fd268748b0fcd30","TwitterLink":"https://twitter.com/adunkman","GitHubLink":"https://github.com/adunkman","LinkedInProfile":null,"BlogUrl":"http://www.dunkman.me"},{"Id":"43146ae1-27f2-4f09-9d80-33c4fcb2ea56","FirstName":"Sarah","LastName":"Dutkiewicz","Biography":"Sarah Dutkiewicz is a seasoned technology professional and has been working in a variety of technologies for over a decade. Her well-rounded background includes roles as technical support, desktop support, database administrator, system administrator, professional developer, and business owner. She has a reputation for being a programming language junkie – having worked with or spoken on IronPython, Squeak, PowerShell, C#, VB, Perl, PHP, Python, Ruby, and many others. Sarah’s many community activities include blogging, running a technical community website, planning events, book writing, and speaking at local and regional conferences. Sarah is the owner of Cleveland Tech Consulting, LLC and the owner and administrator of Cleveland Tech Events.","GravatarUrl":"//www.gravatar.com/avatar/1f7524171730efe80e47b37f4afc53f2","TwitterLink":"https://twitter.com/sadukie","GitHubLink":"","LinkedInProfile":"https://www.linkedin.com/profile/view?id=27521335","BlogUrl":"http://codinggeekette.com"},{"Id":"3c57b6bb-9753-438f-9610-6fe49d0d645b","FirstName":"Michael","LastName":"Eaton","Biography":"Michael Eaton has been a software developer since the early 90's, but left the so-called security of a \"real job\" for the freedom and flexibility of independence in 2001. Since then, he has focused on client-based technologies and has worked with clients throughout the mid-west. Michael is co-owner of LiteAccounting, an online invoicing application. Michael runs the Kalamazoo X Conference and is a C# MVP. When not working on projects or spending time with his family, he will most likely be found reading, honing his marksmanship skills on the pistol range or doing silly things like jumping out of airplanes.","GravatarUrl":"//www.gravatar.com/avatar/d5281e80a4ad86734e1d1c1bd45ab0b8","TwitterLink":"https://twitter.com/mjeaton","GitHubLink":"https://github.com/mjeaton","LinkedInProfile":"https://www.linkedin.com/in/mjeaton","BlogUrl":"http://mjeaton.net/blog"},{"Id":"3d777f4a-fcea-4211-b2fc-c18637882016","FirstName":"Coraline Ada","LastName":"Ehmke","Biography":"Coraline Ada Ehmke is a speaker, author, teacher, open source advocate and technologist with 20 years of experience in developing apps for the web. As a co-founder of LGBTech.org and founder of OpenSourceForWomen.org, she works diligently to promote diversity and inclusivity in the tech industry. Her current interests include small-application ecosystems, APIs, business intelligence, machine learning, and predictive analytics.\r\n","GravatarUrl":"//www.gravatar.com/avatar/4900754dfff6786e747438a703e0d791","TwitterLink":"https://twitter.com/coralineada","GitHubLink":"https://github.com/bantik","LinkedInProfile":"https://www.linkedin.com/in/coralineehmke","BlogUrl":"http://where.coraline.codes/"},{"Id":"057d36fa-1206-4ba8-8b32-cf24ed598f18","FirstName":"Hany","LastName":"Elemary","Biography":"Hany Elemary is a senior software engineer at OCLC in Columbus Ohio, currently working on the next generation of mobile/web apps for WorldCat.org and WorldCat for local institutions. Hany has been blessed by a diverse experience from working in multiple companies (small software shops to large corporations) and seeing different releasable software strategies. He has clear focus and passion for mobile/web UI design, interactions, usability and accessibility. When there is time, he enjoys playing his acoustic guitar, Anna Maria. ","GravatarUrl":"//www.gravatar.com/avatar/7e510e5afa11ae82b12d71448aeff2ab","TwitterLink":"https://twitter.com/hanyelemary","GitHubLink":"https://github.com/hanyelemary","LinkedInProfile":"https://www.linkedin.com/in/hanyelemary","BlogUrl":"http://hanyelemary.com/"},{"Id":"bbd188a8-3b4f-4398-8251-e13cff654fbf","FirstName":"Brendan","LastName":"Enrick","Biography":"Brendan Enrick is a Principal Software Engineer with Clear Measure, focusing a great deal of his time on agile and software craftsmanship methodologies. Brendan is a proponent of strong development communities. Along with two other community members, Brendan helped found the Hudson Software Craftsmanship user group in 2009. He is also involved in organizing other, free educational events in the Cleveland and Akron area. Brendan is a conference and user group speaker who enjoys running workshops and hands on labs with anyone willing to learn.","GravatarUrl":"//www.gravatar.com/avatar/228e0f758b8cf2fdc389bad36e466025","TwitterLink":"https://twitter.com/brendoneus","GitHubLink":"https://github.com/benrick","LinkedInProfile":null,"BlogUrl":"http://brendan.enrick.com/"},{"Id":"3454f46e-f69b-415e-9630-f63869274d16","FirstName":"Cassandra","LastName":"Faris","Biography":"Cassandra Faris is the Talent Manager at Improving Enterprises, a software development consulting and training company in Columbus, Ohio. She is highly involved in the regional technical community, is the president of Dog Food Conference (http://dogfoodcon.com), and the marketing lead for CloudDevelop Conference (http://clouddevelop.org). \r\n\r\nCassandra has an MBA in Organizational Leadership and Marketing, and is an avid tabletop gamer, runner, and rabid soccer fan who travels as much as possible.","GravatarUrl":"//www.gravatar.com/avatar/b1701edf89eb84687a4c41f0d3161f07","TwitterLink":"https://twitter.com/cassandrafaris","GitHubLink":"","LinkedInProfile":"https://www.linkedin.com/in/cassandrafaris","BlogUrl":null},{"Id":"77303af7-6d12-4bea-ac48-51f769853b6c","FirstName":"Chris","LastName":"Farrell","Biography":"Chris Farrell is a Senior Consultant with Quick Solutions in Columbus, OH and he has been a .Net developer since 2002.  Over the years he has been a lead contributor on an open source project with 150,000+ users, a mentor and teacher to countless developers and an active member of the developer community both attending and presenting at a number of .Net user groups. ","GravatarUrl":"//www.gravatar.com/avatar/af5f13b80c75430f7e2f4ef1efc2f4e8","TwitterLink":"https://twitter.com/chrispfarrell","GitHubLink":"https://github.com/chrispfarrell","LinkedInProfile":"https://www.linkedin.com/in/chrispfarrell","BlogUrl":"http://www.chrispfarrell.com"},{"Id":"55b87da0-a7e7-401b-826c-26c1b45f83f2","FirstName":"William","LastName":"Fink","Biography":"William is a Technical Evangelist with Microsoft and is passionate about software development and helping others build amazing things.   William is from the St. Louis area and enjoys traveling across the USA talking with people about programming apps and for the web.  William's enjoys writing c#, JavaScript, Java, and other languages with mustaches. ","GravatarUrl":"//www.gravatar.com/avatar/649871d23b5b14b92682180172e3fd8f","TwitterLink":"https://twitter.com/whatsthebigit","GitHubLink":"","LinkedInProfile":"https://www.linkedin.com/in/williamrfink","BlogUrl":"http://aka.ms/WilliamFink"},{"Id":"200a18ec-c7e3-47d2-bd51-24448323eac2","FirstName":"Brian","LastName":"Friesen","Biography":"Brian Friesen has been pretending to be a developer for the last 8 years and lives in constant fear of being found out. He still can't believe he received a C# MVP in 2014. As an occasional public speaker, he prefers to talk about things that are slightly out in left field. He lives near Detroit and works for a seriously great company, Quicken Loans.","GravatarUrl":"//www.gravatar.com/avatar/a89dc515ab07c2b1d169e15b94562432","TwitterLink":"https://twitter.com/brianfriesen","GitHubLink":"https://github.com/bfriesen","LinkedInProfile":null,"BlogUrl":"http://www.randomskunk.com/"},{"Id":"d0eb7797-6edf-46ce-8836-5d2dc35c9a2b","FirstName":"Jeff","LastName":"Fritz","Biography":"Jeffrey T. Fritz is a Microsoft MVP in ASP.NET, an ASPInsider and Developer Advocate for Telerik with more than a 15 years of experience writing and delivering large scale multi-tenant web applications. He has contributed written articles to MSDN Magazine, Code Project, and MSDN Online as well as authored training videos on Pluralsight.com. After building applications with ASP, ASP.NET and now ASP.NET MVC, he is crazy about building web sites of all sizes on any device. You can read more from Jeffrey on his personal blog (www.csharpfritz.com) or on Twitter at @csharpfritz.","GravatarUrl":"//www.gravatar.com/avatar/2e28be7d89784a88cfc2a0d8c8425c43","TwitterLink":"https://twitter.com/csharpfritz","GitHubLink":"https://github.com/csharpfritz","LinkedInProfile":"https://www.linkedin.com/in/jeffreytfritz","BlogUrl":"http://www.csharpfritz.com"},{"Id":"6194005a-43b6-4511-9dde-97d6fa8c069a","FirstName":"Todd","LastName":"Gardner","Biography":"Todd H Gardner is the President and Co-Founder of TrackJS (trackjs.com), a freelance web developer, and an agile team coach. With over a decade of experience building information systems Todd has built large enterprise systems, complex software products, and launched startups.\r\n\r\nTodd is a veteran of software conferences and an international speaker. He holds a Master of Science in Management of Technology from the University of Minnesota. He lives in Stillwater Minnesota with his wife and children.\r\n","GravatarUrl":"//www.gravatar.com/avatar/2c872fec31c4eb3fcf8229bef0cce42d","TwitterLink":"https://twitter.com/toddhgardner","GitHubLink":"https://github.com/toddhgardner","LinkedInProfile":"https://www.linkedin.com/in/toddhgardner","BlogUrl":"http://todd.mn"},{"Id":"b35801ad-2c55-4ee3-8f86-be410893d51f","FirstName":"Mike","LastName":"Geig","Biography":"Coming Soon","GravatarUrl":"//www.gravatar.com/avatar/4fa5d13a28770d89dd12bc9497b49609","TwitterLink":"","GitHubLink":"","LinkedInProfile":null,"BlogUrl":null},{"Id":"f93842b8-3b84-4ccc-ab41-04c794f57743","FirstName":"Chris","LastName":"Geihsler","Biography":"Chris has been writing code professionally for 12 years in the healthcare and education industries using C#, Ruby, and JavaScript. He currently works at Think Through Math where he builds a product that helps more than 3,000,000 kids get better at math. At home, he tries to fend off his four cats to find time to be dangerous with Elixir, Rust, and Go. His cats usually win.","GravatarUrl":"//www.gravatar.com/avatar/13b4e3d56b4baefd517719fcb0d7fb9b","TwitterLink":"https://twitter.com/seejee","GitHubLink":"https://github.com/seejee","LinkedInProfile":"http://lnkd.in/dNRTTKQ","BlogUrl":null},{"Id":"ab8fb375-33a8-43b0-b401-5cbbda699c12","FirstName":"Brian","LastName":"Genisio","Biography":"Brian Genisio is a passionate software developer in Ann Arbor, MI and an active member of the Michigan software community. For almost 15 years, Brian has worked with many languages and technologies. Currently, he is focusing on front-end development stacks, mostly JavaScript-based while he helps to organize the Southeast Michigan JavaScript users' group. He loves to talk about development philosophies and methodologies. He can talk your ear off. Just humor him. In his spare time, he enjoys building robots with his kids, cycling, and cooking everything he can from scratch.","GravatarUrl":"//www.gravatar.com/avatar/170325813beddd7418a3b55ffbf378f9","TwitterLink":"https://twitter.com/briangenisio","GitHubLink":"https://github.com/briangenisio","LinkedInProfile":"https://www.linkedin.com/in/briangenisio","BlogUrl":"http://BrianGenisio.com"},{"Id":"f9233332-788b-4bf6-8191-4d8b973a9830","FirstName":"David","LastName":"Giard","Biography":"David Giard is a former accountant and a former biochemist, who has been developing solutions using Microsoft technologies for over 2 decades.  Currently, David helps people build solutions in his role as a Microsoft Technical Evangelist. David has been very active in the developer community, speaking at numerous major conferences, code camps, and user groups; helping to lead user groups; and helping to organize conferences and other geek events. He is the host and producer of the mildly popular online TV show Technology and Friends. He is the co-author of the Wrox book Real World .NET, C#, and Silverlight. You can read his latest thoughts at www.DavidGiard.com.  His hobbies include video, photography, sports, and embarrassing his sons.","GravatarUrl":"//www.gravatar.com/avatar/93560aa726daf996fea2aa4a83ccd8d8","TwitterLink":"https://twitter.com/davidgiard","GitHubLink":"https://github.com/davidgiard","LinkedInProfile":"https://www.linkedin.com/in/davidgiard","BlogUrl":"http://www.davidgiard.com/"},{"Id":"658c587b-e064-4087-a54c-d59f72bd76e4","FirstName":"Jason","LastName":"Gilmore","Biography":"Coming Soon","GravatarUrl":"//www.gravatar.com/avatar/0453f338d4cb39a6943df84a4a228a52","TwitterLink":"","GitHubLink":"","LinkedInProfile":null,"BlogUrl":null},{"Id":"e39ffe86-abbb-4d41-af04-807fdebf3dba","FirstName":"Ben","LastName":"Gladwell","Biography":"Lead Developer at BringShare. But I used to be a sysadmin elsewhere.\r\n34 year white male. No points for diversity. But I do have a beard (not pictured).\r\nLife-long Columbus, OH resident. But I have traveled.\r\nComputer Science degree from OSU. But I also got a Russian minor and took scuba diving.\r\nNerd. But people don't frighten me.\r\nI manage and develop our entire stack at BringShare (https://www.bringshare.com). But I am passionate about the crazy world of Javascript and frontend development.","GravatarUrl":"//www.gravatar.com/avatar/69cf43fe99b65a6c6328e1b3aec60e57","TwitterLink":"https://twitter.com/bengladwell","GitHubLink":"https://github.com/bengladwell","LinkedInProfile":"https://www.linkedin.com/in/bengladwell","BlogUrl":"http://www.bengladwell.com/"},{"Id":"8faf464a-758f-4db0-9443-4ba39b4e2fee","FirstName":"Jackie","LastName":"Gleason","Biography":"Jackie started off his career as a .NET consultant working with IBM document management products. Next he moved on to Java where he was lucky enough to work for a variety of companies on projects including Security, Business Orchestration, eCommerce, and Hardware integration. Recently,   More recently, Mr. Gleason has been working with technologies such as Grails, Spring, and Angular to create dynamic single page applications. In his free time he enjoys pool, Civilization 5, hacking around on Arduinos and Volunteering for ComFest in Columbus. ","GravatarUrl":"//www.gravatar.com/avatar/cc4c37d7b7bdfa395b2fcdad7aa86125","TwitterLink":"https://twitter.com/lifeistooshort","GitHubLink":"https://github.com/jrgleason","LinkedInProfile":"http://www.linkedin.com/pub/jackie-gleason/4/211/5a5/","BlogUrl":"http://www.jackiergleason.com"},{"Id":"90e6a7cd-be43-4c33-96d4-bc1d8ce5e1d6","FirstName":"Wolfgang","LastName":"Goerlich","Biography":"J Wolfgang Goerlich supports information security initiatives for clients in the healthcare, education, financial services, and energy verticals. As Vice President of Consulting Services for VioPoint, Wolfgang leads an information security team specializing in managed security services, regulatory compliance, and penetration testing. Wolfgang regularly advises and presents on the topics of managing security risks and securing systems through-out the development lifecycle.","GravatarUrl":"//www.gravatar.com/avatar/1dd62ea40cf632222494db28895504ec","TwitterLink":"https://twitter.com/jwgoerlich","GitHubLink":"https://github.com/jwgoerlich","LinkedInProfile":"http://www.linkedin.com/in/jwgoerlich","BlogUrl":"http://www.jwgoerlich.com/blogengine/default.aspx"},{"Id":"3cb8e713-ebfa-4b96-b4cd-2d22d96346e4","FirstName":"Geoffrey","LastName":"Goetz","Biography":"Always keeping an eye on what’s next, Geoffrey is familiar with how companies adopt new technologies. The latest trends in technology have been heading towards an era where people are becoming personally dependent on multiple computer chips simultaneously. This is know as the ubiquitous era of computing. From cell phones, to tablets, automobiles, thermostats, and even autonomous chips that assume the identity of the real world objects they are closest to. Soon everything will have a chip in it. Utilizing all of these chips in a way that makes sense is what ubiquitous computing is all about. And that is what Geoffrey specializes in. Making sense of all of the different parts of technology in a way that is fun, useful and ultimately productive. Geoffrey Goetz is currently the Director of Ubiquitous Continuity working for Pillar Technology out of The Forge in Columbus, Ohio. Geoffrey is also the Managing Member of ggeoffre LLC, as well as a published author for GigaOm's Mobile channel. Geoffrey is a published book author (\"Mastering JBuilder\") and veteran international speaker on a variety of topics ranging from Win32, to Java, to Mobile. Geoffrey has recently been involved in cross platform and native development on both the iOS and Android platforms. He has been on the development scene in central Ohio since graduating from Ohio State. You may recall one of his presentations at the local COJUG, CIIJUG and other conference venues including Borland Developers Conference, Mobile Mondays, M3 Columbus and CodeMash. Specialties: Xcode, Objective-C, Graphic Artist, Professional Author, International Speaker, Agile Developer, Certified Trainer, Mobile Specialist and overall Apple Product Enthusiast.","GravatarUrl":"//www.gravatar.com/avatar/940906757c2b8631cab8b60f4adb61a3","TwitterLink":"https://twitter.com/ggeoffre","GitHubLink":"https://github.com/ggeoffre","LinkedInProfile":"http://www.linkedin.com/in/ggeoffre/","BlogUrl":"http://gigaom.com/author/ggeoffre/"},{"Id":"30175927-4dbd-452b-b2f5-ad2c090b3069","FirstName":"Nathalie","LastName":"Goh-Livorness","Biography":"Coming Soon","GravatarUrl":"//www.gravatar.com/avatar/0f68238dc4fbb497f73db5285a4f34d0","TwitterLink":"","GitHubLink":"","LinkedInProfile":null,"BlogUrl":null},{"Id":"68b23ea8-77d1-4744-a4ba-79bf8ee930b0","FirstName":"Alexei","LastName":"Govorine","Biography":"Coming Soon","GravatarUrl":"//www.gravatar.com/avatar/e8ad1e741d76cce0f67f141f1d2ec671","TwitterLink":"","GitHubLink":"","LinkedInProfile":null,"BlogUrl":null},{"Id":"5789ca11-7bb2-48ed-b6b0-3ba792542bf2","FirstName":"David","LastName":"Green","Biography":"David is a software architect/developer with 15 years of experience developing web and desktop applications with Microsoft tools and technologies. By day he develops within the Microsoft .NET stack and by night he loves to play around with non-traditional data stores (MongoDB, RavenDB, Elasticsearch, etc.). David is the organizer for the local .NET Data Special Interest Group (SIG) for developers as passionate about data as he is. For the past three years he has been regularly giving talks to the developer community on various NoSQL topics.\r\n\r\nDavid holds a Bachelor’s degree in psychology and economics from Northwestern University and a Masters degree in computer science from DePaul University with a concentration in artificial intelligence. He spent the first half of his life living in Hong Kong, China but now is spending the second half with his lovely wife and three kids living in Durham, North Carolina. In his spare time he loves to watch college football, read with his Kindle, and work on improving his bench press.\r\n","GravatarUrl":"//www.gravatar.com/avatar/dc918ff640951ca60dc08ddae171fabb","TwitterLink":"https://twitter.com/davidjeet","GitHubLink":"https://github.com/davidjeet","LinkedInProfile":"https://www.linkedin.com/in/davidgreen24","BlogUrl":null},{"Id":"79d6628d-1728-41ef-9cf9-1b90aa3d6689","FirstName":"Mark","LastName":"Greenway","Biography":"As a lone developer, Mark Greenway is often free to try out new tools and techniques on the cutting edge of development. He once deployed code to production, while on a plane, using dropbox and his cellphone. This has given him a great perspective on how various tools interact and enables him to solve interesting problems throughout the development stack.  From  Backbone to Mongo and everything in between, Mark's done a bit of everything. He's also a passionate speaker and active in the Columbus, OH development community.  This understanding of the pain of doing things the wrong way, leads to a fresh perspective. A smart sense of humour and some training from professional speakers make sure that any talk will be both interesting and informative.","GravatarUrl":"//www.gravatar.com/avatar/b831cca22966e6877c54033cdcc23901","TwitterLink":"https://twitter.com/markkgreenway","GitHubLink":"https://github.com/markkgreenway","LinkedInProfile":null,"BlogUrl":"http://www.markgreenway.net"},{"Id":"3031a702-0f2d-4847-bae0-5761df2f571c","FirstName":"Kevin","LastName":"Griffin","Biography":"Kevin Griffin has been working as a professional developer since 2006, where his first job was working on components for the Symantec security suites. Kevin is an independent consultant that specializes in helping businesses push their technology stack into the 21st century. He is the CTO of Winsitter, a service that takes the guesswork out of monitoring Windows Servers. As an Microsoft ASP.NET MVP and ASPInsider, Kevin spends a lot of time teaching and mentoring developers to learn new technologies and to be better developers. You can find Kevin speaking at conferences and user groups across the country.","GravatarUrl":"//www.gravatar.com/avatar/11ce7889cfbdc9af46389f2c7e3ff015","TwitterLink":"https://twitter.com/1kevgriff","GitHubLink":"https://github.com/1kevgriff","LinkedInProfile":"http://www.linkedin.com/in/1kevgriff/","BlogUrl":"http://kevgriffin.com"},{"Id":"55ebd8cc-c052-477d-9f27-9359f3ba4d28","FirstName":"Kevin","LastName":"Grossnicklaus","Biography":"Kevin is the President of a St. Louis-based consulting firm called ArchitectNow. He and his team spend their days developing great software and brainstorming the next great app ideas. Kevin has been recognized as a Microsoft MVP for the past five years and has just been recognized as an ASPInsider. This is also the shortest bio Kevin has ever included on a conference website.","GravatarUrl":"//www.gravatar.com/avatar/61cd10a805f54376bf51e3d38610c420","TwitterLink":"https://twitter.com/kvgros","GitHubLink":"","LinkedInProfile":"https://www.linkedin.com/in/kvgros","BlogUrl":"http://www.architectnow.net/blog"},{"Id":"8704e418-9971-4226-ab8b-529f4b60f40a","FirstName":"Matthew","LastName":"Groves","Biography":"Matthew D. Groves is the author of AOP in .NET (published by Manning), and is also a Microsoft MVP. He is a guy who loves to code.  It doesn't matter if it's C#, jQuery, PHP, or submitting pull requests.  He has been coding ever since he wrote a QuickBASIC point-of-sale app for his parent's pizza shop back in the 90s.  He currently works remotely for Heuristic Solutions. He spends his free time with family, watching the Reds, and getting involved in the developer community.","GravatarUrl":"//www.gravatar.com/avatar/4b0eb78ea5852ee0f54bfd6a2252c99e","TwitterLink":"https://twitter.com/mgroves","GitHubLink":"https://github.com/mgroves","LinkedInProfile":"https://www.linkedin.com/in/mgroves","BlogUrl":"http://crosscuttingconcerns.com"},{"Id":"38b9c6ae-5a37-4822-ae77-db0d6d968a91","FirstName":"Abdul","LastName":"Habra","Biography":"I am a software designer, programmer, tester, and hobbyist. Currently I use JavaScript, Java, Scala, and Elixir (current interest). I am active with the Detroit area user groups and meetups. I co-organize the \"Detroit Erlang and Elixir Meetup\". I am also on the organizing committees for both the \"International Conference on Collaboration Technologies and Systems\" http://cts2014.cisedu.info and the \"International Conference on High Performance Computing & Simulation\" http://hpcs2014.cisedu.info. I also participate in several open source projects. My current interest include highly distributed systems, and privacy.","GravatarUrl":"//www.gravatar.com/avatar/f4476549f95e5ef9e746ee66a55832b3","TwitterLink":"https://twitter.com/ahabra","GitHubLink":"https://github.com/ahabra","LinkedInProfile":"http://www.linkedin.com/in/abdulhabra","BlogUrl":"http://www.tek271.com"},{"Id":"e603adc3-e5a3-478f-895b-8229fafebfd3","FirstName":"Jay","LastName":"Harris","Biography":"Jay is a code wrangler, software consultant, and president of Arana Software. He has been developing on the web since 1995, when the Blink tag lured him away from Visual Basic 3. With a career focus on user experience, Jay has a passion for practices that improve quality and user experience, such as performance optimization, unit testing, and proper grammar.\r\n\r\nOriginally from Rochester, New York, he and his wife, Amy, have lived in Michigan since 2003. They like Michigan, but still consider themselves tourists, and probably always will.","GravatarUrl":"//www.gravatar.com/avatar/1318668b99b2d5a3900f3f7758763a69","TwitterLink":"https://twitter.com/jayharris","GitHubLink":"https://github.com/jayharris","LinkedInProfile":"http://www.linkedin.com/in/jasonharris/","BlogUrl":"http://www.cptloadtest.com"},{"Id":"f9d2a18c-9b3b-4a4c-a74c-325e7ad2e91b","FirstName":"Kevin","LastName":"Hazzard","Biography":"Kevin Hazzard owns and manages Developer Journey LLC, a training and consulting firm specializing in software architecture and development. He's also a Partner at Linchpin People LLC where he runs the software development practice. He's a long-time C# MVP and the author of a book entitled Metaprogramming in .NET. Kevin also serves as an elected member of his local School Board and dedicates most of his non-professional time promoting public education.","GravatarUrl":"//www.gravatar.com/avatar/1bfa9dd2f31b30c11c0dc0de8d623a74","TwitterLink":"https://twitter.com/kevinhazzard","GitHubLink":"","LinkedInProfile":"http://www.linkedin.com/in/kevinhazzard/","BlogUrl":"http://devjourney.com/blog/"},{"Id":"fd42b311-27a0-4e96-b2f2-9c3f589c70fc","FirstName":"Jeanette","LastName":"Head","Biography":"Jeanette Head is a software developer for Atomic Object in Ann Arbor, MI.  As a youngster, she was fascinated with the workings of computers, and she hasn’t stopped learning about them since. Since starting in software consulting in 2012, she has worked with many clients and projects on numerous technologies including C#, Django, DropWizard, Android, Backbone, Marionette, and Angular to provide creative and effective software solutions. In her spare time she is an organizer of Ann Arbor PyLadies and a mentor to FIRST robotics team 3322.","GravatarUrl":"//www.gravatar.com/avatar/1949e3c40f8eb31baacc9a2f6e9e5d2a","TwitterLink":"https://twitter.com/jeanettehead17","GitHubLink":"https://github.com/jeanettehead17","LinkedInProfile":"https://www.linkedin.com/pub/jeanette-head/50/748/5a1","BlogUrl":"https://spin.atomicobject.com/author/jeanette-head/"},{"Id":"ccd1bddf-2c93-4559-82f7-07092b297986","FirstName":"Matthew","LastName":"Heusser","Biography":"The Managing Consultant at Excelon Development, Matt Heusser is probably best known for the writing he does on nights and weekends. Currently  the editor for Stickyminds.com and a cio.com contributing author, Matt has been a track chair at the Agile Conference for the past two years, and served on the board of directors for the Association for Software Testing. He's presented at Google, given international keynotes on three continents, and, perhaps most importantly, spent his entire adult like developing software and helping others develop it.","GravatarUrl":"//www.gravatar.com/avatar/029780fa46bfc1d919adc994c3d0abb3","TwitterLink":"https://twitter.com/mheusser","GitHubLink":"https://github.com/heusserm","LinkedInProfile":"https://www.linkedin.com/in/mheusser","BlogUrl":"http://xndev.com/creative-chaos/"},{"Id":"7c549c7b-06a8-4d9a-9c06-5103451cbdae","FirstName":"David","LastName":"Hoerster","Biography":"David Hoerster, a 4-time C# MVP, is a recovering corporate financial analyst and has been working with the Microsoft.NET Framework since the early 1.0 betas. He is the Sr. Director of Web Solutions for Resources Global Professionals (RGP), an international financial services firm. David is a conference chair of Pittsburgh TechFest, the leader of the Pittsburgh SteelCloud distributed application development user group, the former president of the Pittsburgh .NET User’s Group (PGHDOTNET) and is also a regular speaker at Pittsburgh and regional user group and community conference events. David can be found rarely blogging at http://blogs.agileways.com and also is an occasional Tweeter (@DavidHoerster).","GravatarUrl":"//www.gravatar.com/avatar/a007ab3dc89f80c08655bc626fb37fc7","TwitterLink":"https://twitter.com/davidhoerster","GitHubLink":"https://github.com/davidhoerster","LinkedInProfile":"https://www.linkedin.com/in/davidhoerster","BlogUrl":"http://geekswithblogs.net/davidhoerster"},{"Id":"7d4be401-1141-4c31-b440-fed0a0c877ed","FirstName":"Jim","LastName":"Holmes","Biography":"VP of ALM and Testing at Falafel Software. Father.  Husband.  Geek. Veteran. Around 25 years IT experience. Co-author of “Windows Developer Power Tools.” Coffee Roaster.  MVP for C#.  Past President of  CodeMash Conference. Diabetic. Runner. Liked 5th grade so much he did it twice. One-time setter, middle blocker, and weakside hitter. Blogger (http://FrazzledDad.com). Big fan of naps.","GravatarUrl":"//www.gravatar.com/avatar/fd80f9c58b06270d42356dd77a32defa","TwitterLink":"https://twitter.com/ajimholmes","GitHubLink":"https://github.com/jimholmes","LinkedInProfile":null,"BlogUrl":"http://frazzleddad.com"},{"Id":"dfbd02fc-356e-4827-893c-68b80db32f0c","FirstName":"Josh","LastName":"Holmes","Biography":"Coming Soon","GravatarUrl":"//www.gravatar.com/avatar/753ffc832ca4bc9f15e9e5ca90c93404","TwitterLink":"","GitHubLink":"","LinkedInProfile":null,"BlogUrl":null},{"Id":"b7ad6108-017a-4b46-9ec4-0c25b244f622","FirstName":"Paul","LastName":"Holway","Biography":"\r\nPaul is a managing partner for Centric Consulting's St. Louis office (http://centricconsulting.com/team/paul-holway/).\r\n\r\nIn the past year, he has been delivering solutions using iBeacons, docker.io, angularJS, as well as traditional web application solutions in the healthcare space.  Prior to joining Centric, Paul had held roles such as Director of Cloud Development, leading the creation of FDA approved medical devices, and corporate IT application development leadership.    \r\n\r\nPaul has a passion for how to pragmatically implement and scale agile in the real world. Throughout his career, Paul has followed a rapid discovery approach while delivering innovative technology in consulting, corporate information technology, and product development scenarios by applying his core principles. He has expertise in e-commerce, mobile technologies, cloud enablement, portal solutions, APIs, middleware and integration, business intelligence and core application development. ","GravatarUrl":"//www.gravatar.com/avatar/4959d2239464d669c0125462a9622dc4","TwitterLink":"https://twitter.com/paulholway","GitHubLink":"https://github.com/paulholway","LinkedInProfile":"https://www.linkedin.com/pub/paul-holway/3/985/443/","BlogUrl":"http://centricconsulting.com/?s=paul+holway"},{"Id":"1530aa67-88e9-460e-8e9c-c79de577508c","FirstName":"Cory","LastName":"House","Biography":"Cory is founder of Bitnative LLC, an agile software development and training consultancy, and creator  of OutlierDeveloper.com, a community for software developers who aspire to be exceptional. He is a Pluralsight author, Microsoft MVP in C#, INETA speaker, independent consultant, and blogger with 15 years experience in full-stack software development. As a software architect at VinSolutions, Cory specializes in creating C# .NET and JavaScript based single page applications for the automotive industry. He regularly speaks and coaches teams on clean code, architecture, and software career development at conferences and user groups across the country and internationally. Cory is of multiple Pluralsight courses including “Clean Code: Writing Code for Humans”, “Architecting Applications for the Real World in .NET”, and “Becoming an Outlier” on Pluralsight. Cory blogs at bitnative.com and outlierdeveloper.com and is active on Twitter as @housecor.","GravatarUrl":"//www.gravatar.com/avatar/09e16ce7b4bc21025c9940f5a167cfa9","TwitterLink":"https://twitter.com/housecor","GitHubLink":"https://github.com/coryhouse","LinkedInProfile":"http://www.linkedin.com/profile/view?id=4609328&trk=tab_pro","BlogUrl":"http://www.bitnative.com"},{"Id":"19b2188e-0c00-4a5f-8870-59f5a80bd331","FirstName":"Derek","LastName":"Hubbard","Biography":"Derek Hubbard is a passionate developer, trainer, and mentor with more than 12 years of experience building custom software applications.  Committed to the principles of Agile development, Derek enjoys helping teams deliver high quality applications while focusing on simplicity and continuous improvement. Derek is an active member of the software developer community, frequently blogging and presenting on software development and application lifecycle management best practices. He is a Software Craftsman with POMIET, which specializes in promoting peace of mind while delivering optimized work-process software products. You can keep up with Derek on Twitter at @derekhubbard and at http://www.derekhubbard.com.","GravatarUrl":"//www.gravatar.com/avatar/7d53dab9481077cad8b32937ff12cd49","TwitterLink":"https://twitter.com/derekhubbard","GitHubLink":"https://github.com/derekhubbard","LinkedInProfile":"https://www.linkedin.com/in/derekhubbard","BlogUrl":"http://derekhubbard.com"},{"Id":"85c212b8-355b-43bc-b086-cd6879950cd1","FirstName":"Nic","LastName":"Jansma","Biography":"Nic is an independent software developer building high-performance websites, apps and open-source tools, and is a Microsoft MVP for IE.","GravatarUrl":"//www.gravatar.com/avatar/080d3622ca21aa320119f6015abaafe6","TwitterLink":"https://twitter.com/nicj","GitHubLink":"https://github.com/nicjansma","LinkedInProfile":"http://www.linkedin.com/in/nicjansma","BlogUrl":"http://nicj.net"},{"Id":"d5a30e68-62b6-4ac8-a056-65cdc90f7688","FirstName":"Philip","LastName":"Jordan","Biography":"Philip is a Senior Software Developer with Cardinal Solutions in Columbus, Ohio. He has given several talks on SOLID principles and Acceptance Test Driven Development (ATDD) and is passionate about applying these to any platform he works in. He has worked with a variety of technologies/languages that include C#, Java, Android, Objective-C,  JavaScript, and Ruby and strives to get outside of his comfort zone at least once a week. ","GravatarUrl":"//www.gravatar.com/avatar/0766e6c7ef5a9ab36172d5f6ddbfcbed","TwitterLink":"https://twitter.com/philipjordan","GitHubLink":"https://github.com/philipjordan","LinkedInProfile":null,"BlogUrl":null},{"Id":"5f356f6a-6477-4bf1-8a87-079c19427699","FirstName":"Seth","LastName":"Juarez","Biography":"Seth Juarez holds a Master’s Degree in Computer Science where his field of research was Artificial Intelligence, specifically in the realm of Machine Learning. Seth is the Analytics Program Manager for DevExpress where he specializes in products dealing with data analysis, shaping, and presentation. When he is not working in that area, Seth devotes his time to an open source Machine Learning Library, specifically for .NET, intended to simplify the use of popular machine learning models, as well as complex statistics and linear algebra.","GravatarUrl":"//www.gravatar.com/avatar/cc351a7c1ea116d1400349644ad8d66e","TwitterLink":"https://twitter.com/sethjuarez","GitHubLink":"https://github.com/sethjuarez","LinkedInProfile":"https://www.linkedin.com/in/sethjuarez","BlogUrl":"http://www.sethjuarez.com"},{"Id":"1c0cadcb-c364-49d4-be90-606a931bac15","FirstName":"Christopher","LastName":"Judd","Biography":"Christopher Judd is the CTO and a partner at Manifest Solutions (http://www.manifestcorp.com/), an international speaker, an open source evangelist, the Central Ohio Java Users Group (http://www.cojug.org) and Columbus iPhone Developer User Group leader, and the co-author of Beginning Groovy and Grails (Apress, 2008), Enterprise Java Development on a Budget (Apress, 2003) and Pro Eclipse JST (Apress, 2005) as well as the author of the children’s book “Bearable Moments”. He has spent 18 years architecting and developing software for Fortune 500 companies in various industries, including insurance, health care, retail, government, manufacturing, service, and transportation. His current focus is on consulting, mentoring, and training with Java, Java EE, Groovy, Grails, Cloud Computing and mobile platforms like iPhone, Android, Java ME and mobile web.","GravatarUrl":"//www.gravatar.com/avatar/46237da22a99f4aab52e802ea2c0728e","TwitterLink":"https://twitter.com/javajudd","GitHubLink":"https://github.com/cjudd","LinkedInProfile":"http://www.linkedin.com/in/christophermjudd/","BlogUrl":"http://juddsolutions.blogspot.com"},{"Id":"96009c83-75bc-4e7f-a4d2-b34cbf093d8c","FirstName":"Ivan","LastName":"Judson","Biography":"Coming Soon","GravatarUrl":"//www.gravatar.com/avatar/e18b7b1b1267bca5ff9395b0d21447e5","TwitterLink":"","GitHubLink":"","LinkedInProfile":null,"BlogUrl":null},{"Id":"37d41bd9-9ce3-4851-a0a4-929b52bc3450","FirstName":"Dan","LastName":"Kacenjar","Biography":"A software engineer for over 20 yrs. Experiences include teaching software development courses at the University level, developing software for automated systems, corporate banking systems, and medical content publishing. I have a bachelor's degree in Electrical Engineering and spend presonal time hacking the Arduino, Raspberry Pi and other embedded technologies and platforms.","GravatarUrl":"//www.gravatar.com/avatar/e19f1a72b8b5df1ae8a00272a6676f9c","TwitterLink":"https://twitter.com/kacenjar","GitHubLink":"https://github.com/kacenjar","LinkedInProfile":"http://www.linkedin.com/pub/dan-kacenjar/10/5b4/1b0","BlogUrl":null},{"Id":"f76c74ea-5a60-4c0a-b5d0-f008ce85edec","FirstName":"Jordan","LastName":"Kasper","Biography":"Shortly after it arrived at his home in 1993, Jordan began disassembling his first computer - his mother was not happy. She breathed more easily when he moved from hardware into programming, starting with BASIC. Jordan's experience includes startups, companies large and small, and universities. He contributes to a few open source projects and participates in local user groups, barcamps, and hackathons. Jordan's primary mission for over 10 years has been to use JavaScript, HTML, and CSS to elevate web applications above their desktop rivals. He currently works as a Sr. JavaScript Engineer and Team lead for appendTo, a leader in front-end software solutions, specializing in JavaScript, RWD, and mobile development. In his down time he enjoys puzzles of all sorts and board games.","GravatarUrl":"//www.gravatar.com/avatar/f441bc8d508101ba0a1eac95d6cd52c6","TwitterLink":"https://twitter.com/jakerella","GitHubLink":"https://github.com/jakerella","LinkedInProfile":"https://www.linkedin.com/in/jordankasper","BlogUrl":"http://jordankasper.com/blog"},{"Id":"6136f4c0-6991-4a55-a6e3-3e39d825da97","FirstName":"Todd","LastName":"Kaufman","Biography":"Coming Soon","GravatarUrl":"//www.gravatar.com/avatar/6d956728ae5a3c71832708c5741cd11d","TwitterLink":"","GitHubLink":"","LinkedInProfile":null,"BlogUrl":null},{"Id":"1953deb4-8cd6-4e20-be15-7dab4ad902b8","FirstName":"Rob","LastName":"Keefer","Biography":"Rob Keefer, PhD, is Co-founder and Innovation Director of POMIET. He has 20+ years of experience delivering innovative software solutions, leading teams, and implementing approaches for better human/computer interaction. Rob is passionate about creating optimized experiences for software developers and the people who use the software they build.","GravatarUrl":"//www.gravatar.com/avatar/c2b1d84a1385e58a6591b06c1aa5f63e","TwitterLink":"https://twitter.com/rbkeefer","GitHubLink":"","LinkedInProfile":"http://www.linkedin.com/in/robkeefer/","BlogUrl":null},{"Id":"7eb23011-c7aa-4ba4-92f3-4f4649711b87","FirstName":"Gaines","LastName":"Kergosien","Biography":"Gaines Kergosien is a senior solutions architect with Vanick Digital and serves as a board member for the Nashville .NET User Group, the INETA Mentor for TN and speaks at software development conferences throughout the United States. With over 12 years in solutions development using Microsoft technologies, his work includes consulting for such companies as Deloitte, Hospital Corporation of America (HCA), American General (AIG), Lexis Nexis, Gibson Guitars, and Cardinal Healthcare.","GravatarUrl":"//www.gravatar.com/avatar/f5dded2661a1ef93520c635ab884d006","TwitterLink":"https://twitter.com/gainesk","GitHubLink":"https://github.com/gaines","LinkedInProfile":"http://www.linkedin.com/in/gainesk/","BlogUrl":"http://blog.dotnetdude.net"},{"Id":"dd474455-d0c2-44f7-9846-ae117f4b80aa","FirstName":"Rob","LastName":"Kinyon","Biography":"Developer + DBA + sysadmin == DevOps evangelist. Long-time OSS developer in Perl and now Ruby. ","GravatarUrl":"//www.gravatar.com/avatar/8ef20944f3a512224fdb8c14972ca0c2","TwitterLink":"https://twitter.com/rkinyon","GitHubLink":"https://github.com/robkinyon","LinkedInProfile":null,"BlogUrl":null},{"Id":"40c37623-5dd4-4aaa-bb14-915a933a72de","FirstName":"Steve","LastName":"Klabnik","Biography":"Prolific Open Source contributor, hypermedia enthusiast, and Rust documentor. Author of \"Rails 4 in Action,\" \"Designing Hypermedia APIs,\" and \"Rust for Rubyists.\"","GravatarUrl":"//www.gravatar.com/avatar/233c279c012ebac792aaa805f966cbc7","TwitterLink":"https://twitter.com/steveklabnik","GitHubLink":"https://github.com/steveklabnik","LinkedInProfile":null,"BlogUrl":"http://words.steveklabnik.com"},{"Id":"cad83e09-d051-4a08-97ee-4532d7e03df4","FirstName":"William","LastName":"Klos","Biography":"William Klos is a Senior Architect and Centric’s National Cloud Services Lead. Bill's career has spanned many aspects of computing and at times has architected solutions from the perspective of data, networking, enterprise, and security – but is primarily an application architect. Most recent experience has him providing solutions around Mobility, Cloud, and Big Data architectures as well as API design and development. \r\n\r\nBill has been involved with technology since abandoning his desire to be a real architect and stumbling into his first computer science class in 1985. Since then he has typically pushed companies into “what’s next.”","GravatarUrl":"//www.gravatar.com/avatar/bfb804e585be282f398765068688a7ed","TwitterLink":"https://twitter.com/williamklos","GitHubLink":"https://github.com/wjklos","LinkedInProfile":"https://www.linkedin.com/in/wjklos","BlogUrl":"http://centricconsulting.com/it-shops-will-leverage-their-knowledge-of-legos-to-build-enterprise-systems/"},{"Id":"d075ecc2-806c-42d1-948a-1ad3bfa39ad4","FirstName":"Jonathan","LastName":"Knapp","Biography":"Jonathan Knapp is a digital consultant out of Akron, OH. He’s been working for himself for the past nine years at his company Coffee and Code (coffeeandcode.com) and has worked on PHP, Ruby/Rails, Django, and JavaScript projects for companies ranging from startups to enterprise digital media organizations.\r\n\r\nHe is also a community web advocate who runs Akron.io, supports local conferences and GiveCamps, and enjoys helping other developers to get their start.","GravatarUrl":"//www.gravatar.com/avatar/c6caef08c5eb2951bee325de5df53def","TwitterLink":"https://twitter.com/coffeeandcode","GitHubLink":"https://github.com/coffeeandcode","LinkedInProfile":"http://www.linkedin.com/in/coffeeandcode/","BlogUrl":"http://jonknapp.com"},{"Id":"3b388d25-2173-42ed-b8d1-ba12f326d54a","FirstName":"Dave","LastName":"Koziol","Biography":"Dave Koziol has been building Cocoa Apps since long before it was cool. He's worked on large and small projects for both iOS and Mac OS X. Dave is President of Arbormoon Software, Inc., a company which specializes in helping build mobile solutions for their clients.  He also runs CocoaHeads Ann Arbor, and encourages everyone interested in Cocoa development to attend CocoaHeads meetings.","GravatarUrl":"//www.gravatar.com/avatar/913be7efda8ead793ee7b270098a21ea","TwitterLink":"https://twitter.com/davekoziol","GitHubLink":"","LinkedInProfile":"http://www.linkedin.com/in/davekoziol/","BlogUrl":null},{"Id":"c36fdf68-3b38-41c7-9445-4b694e1537f3","FirstName":"Jon","LastName":"Kruger","Biography":"Hi, I'm Jon Kruger and I am an independent consultant in Columbus, OH.\r\nI specialize in software solutions, project leadership, and Agile\r\ncoaching and training and I have experience in a wide range of\r\nindustries and environments. I use my experience as a leader and\r\nsoftware developer to find ways to create better quality software,\r\nimprove the software development process, and maximize value for the\r\nbusiness. On the side, I run the Columbus ATDD Developers Group and\r\nprovide test-driven development training (tddbootcamp.com). You can\r\nfollow me on my blog (jonkruger.com) or on Twitter (@JonKruger).","GravatarUrl":"//www.gravatar.com/avatar/1b5fa278d15bed48314e5dc064fbba18","TwitterLink":"https://twitter.com/jonkruger","GitHubLink":"https://github.com/jonkruger","LinkedInProfile":"https://www.linkedin.com/in/jonkruger","BlogUrl":"http://jonkruger.com"},{"Id":"cadd8800-73bc-4f57-900c-3e25f0d58a83","FirstName":"Joe","LastName":"Kuemerle","Biography":"Joe Kuemerle is a developer and speaker in the greater New York City area specializing in .NET development, security, database and application lifecycle topics.  Joe is active in the technical community as well as a speaker at local, regional and national events.  Joe blogs at www.kuemerle.com and is on Twitter as @jkuemerle.\r\n","GravatarUrl":"//www.gravatar.com/avatar/fec6a312fc2dff26897c287bd941cdd8","TwitterLink":"https://twitter.com/jkuemerle","GitHubLink":"https://github.com/jkuemerle","LinkedInProfile":"http://www.linkedin.com/in/joekuemerle/","BlogUrl":"http://www.kuemerle.com"},{"Id":"8cbd8e4c-7fc7-4612-a360-12bd2709a5af","FirstName":"Joe","LastName":"Kutner","Biography":"Joe is the lead JVM Languages developer at Heroku, a cloud application platform supporting Java, Scala, Clojure, Groovy and JRuby. He’s worked with the JVM for over a decade as both an application architect and a consultant specializing in deployment. Joe maintains Warbler, a tool for packaging JRuby applications into WAR files. JRuby was the topic of his first book from the Pragmatic Bookshelf, but he’s also written books on remote pair programming and the health issues associated being a programmer.\r\n","GravatarUrl":"//www.gravatar.com/avatar/fc9dc18f851317e79ac06ada2d74a99b","TwitterLink":"https://twitter.com/codefinger","GitHubLink":"https://github.com/jkutner","LinkedInProfile":null,"BlogUrl":null},{"Id":"eb15a235-5ab2-4267-a6b6-356f96a9d6ce","FirstName":"Zeeshan","LastName":"Lakhani","Biography":"Zeeshan became a programmer by way of film and music recording/technology. Moving from science center to startup to labs to EDM platform research, he accrued tons of necessary and needless information, and is a polyglot who will dive into anything related to programming languages, particularly functional ones, machine learning, and math. Additionally, he is one of the lead organizers and founders of Papers We Love!","GravatarUrl":"//www.gravatar.com/avatar/5cf448e5edc7dc73659e3f42baff490a","TwitterLink":"https://twitter.com/zeeshanlakhani","GitHubLink":"https://github.com/zeeshanlakhani","LinkedInProfile":"https://www.linkedin.com/in/zeeshanlakhani","BlogUrl":null},{"Id":"052a2864-680a-4c1a-8f61-3a90146c6fe0","FirstName":"Seth","LastName":"Law","Biography":"Seth is an experienced Application Security Professional with over 12 years of experience in the computer security industry. During this time, Seth has been worked within multiplie disciplines in the security field, from software development to network protection, both as a manager and individual contributor. Seth has honed his application security skills using offensive and defensive techniques, including tool development. His understanding of the software development lifecycle allows him to speak as a developer and to equate security issues to development tasks. In his spare time, Seth revels in deep-level analysis of languages and inherent flaws.","GravatarUrl":"//www.gravatar.com/avatar/61e71f1890242e475617ecaf292978e1","TwitterLink":"https://twitter.com/sethlaw","GitHubLink":"https://github.com/sethlaw","LinkedInProfile":"https://www.linkedin.com/profile/view?id=62676145","BlogUrl":"http://blog.nvisium.com"},{"Id":"4d14071e-02ae-4d75-a05b-ece7839a57c6","FirstName":"Eric","LastName":"Lawrence","Biography":"Eric Lawrence builds Fiddler for Telerik. Before that, he spent 11 years at Microsoft building Internet Explorer and Office Online. A Microsoft MVP and Internet Explorer UserAgent, he's passionate about helping developers build applications on web technologies. He most recently spoke at CodeMash and Velocity 2014.","GravatarUrl":"//www.gravatar.com/avatar/89c27d27b73dd3690b3dad59f3a539d1","TwitterLink":"https://twitter.com/ericlaw","GitHubLink":"https://github.com/ericlaw1979","LinkedInProfile":"https://www.linkedin.com/pub/eric-lawrence/38/22b/85","BlogUrl":"http://blogs.msdn.com/b/IEInternals"},{"Id":"640c4948-0a02-4dd2-b05a-2bd4c408872e","FirstName":"David","LastName":"Lucas","Biography":"David has been in the IT industry for over 25 years with experience in the military and Fortune 500 companies like Nationwide Insurance, Chase/BankOne, Huntington Bank, Checkfree, American Electric Power and Longaberger.  He has a diverse software engineering background covering satellite communications, financial processing, smart grid utilities, manufacturing, order entry systems, shipping automation, e-Commerce, insurance and security.  David enjoys designing, implementing, and testing large-scale software solutions in Java leveraging JEE standards like web services, messaging, data persistence and mentoring and training others in the science and art of software.  He is the owner of Lucas Software Engineering, Inc. and consults in the Columbus Ohio area.  He is often found working with Manifest Solutions and with their Next Gen BootCamp as a Master Craftsman.   He has presented at local and national user groups and is a member of the ACM.  He lives in Ohio with his wife and three children.\r\n","GravatarUrl":"//www.gravatar.com/avatar/0ce4bb9448103f7554520903f53c16bd","TwitterLink":"https://twitter.com/daviddlucas","GitHubLink":"","LinkedInProfile":"https://www.linkedin.com/in/ddlucas/","BlogUrl":null},{"Id":"31dcfbce-f346-47c8-8f3a-0e240deb9c0c","FirstName":"Jim","LastName":"Manico","Biography":"Jim Manico is an author and educator of developer security awareness trainings and has a 17 year history building software as a developer and architect. He is a frequent speaker on secure software practices and is a member of the JavaOne rockstar speaker community. Jim is also a Global Board Member for the OWASP foundation where he helps drive the strategic vision for the organization. He manages and participates in several OWASP projects, including the OWASP cheat sheet series and several secure coding projects. Jim is also the author of \"Iron-Clad Java: Building Secure Web Applications\" from Oracle Press. For more information, see http://www.linkedin.com/in/jmanico.","GravatarUrl":"//www.gravatar.com/avatar/04b8fca2c8dde2ed82373ade37e9789d","TwitterLink":"https://twitter.com/manicode","GitHubLink":"","LinkedInProfile":"http://www.linkedin.com/in/jmanico","BlogUrl":null},{"Id":"f4084f68-86e4-410c-90b3-3712e9b71d91","FirstName":"Jennifer","LastName":"Marsman","Biography":"Jennifer Marsman is a Principal Developer Evangelist in Microsoft’s Developer and Platform Evangelism group, where she educates developers on Microsoft’s new technologies.  In this role, Jennifer is a frequent speaker at software development conferences across the United States.  In 2009, Jennifer was chosen as \"Techie whose innovation will have the biggest impact\" by X-OLOGY for her work with GiveCamps, a weekend-long event where developers code for charity.  She has also received many honors from Microsoft, including the Central Region Top Contributor Award, Heartland District Top Contributor Award, DPE Community Evangelist Award, CPE Champion Award, MSUS Diversity & Inclusion Award, and Gold Club.  Prior to becoming a Developer Evangelist, Jennifer was a software developer in Microsoft’s Natural Interactive Services division.  In this role, she earned two patents for her work in search and data mining algorithms.  Jennifer has also held positions with Ford Motor Company, National Instruments, and Soar Technology.  Jennifer holds a Bachelor’s Degree in Computer Engineering and Master’s Degree in Computer Science and Engineering from the University of Michigan in Ann Arbor.  Her graduate work specialized in artificial intelligence and computational theory.  Jennifer blogs at http://blogs.msdn.com/jennifer and tweets at http://twitter.com/jennifermarsman.  ","GravatarUrl":"//www.gravatar.com/avatar/36fa3107bdff153bf46f9e80aefc9fbd","TwitterLink":"https://twitter.com/jennifermarsman","GitHubLink":"","LinkedInProfile":"https://www.linkedin.com/pub/jennifer-marsman/2/ab1/9b8","BlogUrl":"http://blogs.msdn.com/jennifer"},{"Id":"a4597a37-a931-4210-b019-b77dfe13c76d","FirstName":"Nicolas","LastName":"Martin","Biography":"Nick Martin is a senior consultant at Cardinal Solutions, with 10 years of experience developing and architecting enterprise applications.  Nick is passionate about helping clients get the most out of their development efforts through following best practices and Agile processes.  He also helps lead an internal development user group to help bring out the passions and share the expertise of his colleagues.  He recently started his toughest project to date: developing a decent human being (fatherhood).","GravatarUrl":"//www.gravatar.com/avatar/ad59d57cd22aa72322cd3131e36629bc","TwitterLink":"","GitHubLink":"https://github.com/bojingo","LinkedInProfile":"https://www.linkedin.com/in/bojingo","BlogUrl":null},{"Id":"f1a2042a-f8b7-4f86-af56-ecdd54409b94","FirstName":"Amber","LastName":"McKenzie","Biography":"A data scientist at PYA Analytics, Amber specializes in natural language and text analytics. She came to her Ph.D. computer science in a roundabout way, through a Bachelor's in Spanish and then a Master's in Linguistics (all from the University of South Carolina), during which she found her love of natural language processing and computational linguistics. She now has over 6 years experience in extracting information from text-based data, through a variety of fascinating projects dealing with Apache helicopters, federal law enforcement, and children's services. Amber loves being a mom, wife, runner and photographer, and is becoming more involved in fostering a love of programming and computing among young women.","GravatarUrl":"//www.gravatar.com/avatar/718a25b4ce19ee3bfcd3aca8d0354319","TwitterLink":"","GitHubLink":"https://github.com/ab6","LinkedInProfile":"http://www.linkedin.com/in/ambermckenzie/","BlogUrl":"https://nlprunner.wordpress.com/"},{"Id":"4ea36ee0-7e54-4a90-9487-cb34812b7f75","FirstName":"Russ","LastName":"McMahon","Biography":"Russ McMahon has been teaching IT related subject matter for more than 30 years. He has been teaching full-time at the University of Cincinnati for 15 years and helped create the Information Technology Bachelor of Science degree which started in 2004. He teaches computer programming, database administration, business intelligence, and IT security. He is an IT user group evangelist and helped create TechLife Cincinnati which is for those who have an interest in what is going on in the local IT scene. He enjoys studying the history of computing and technology and considers himself to be a lifelong learner. Prior to coming to UC he worked at several local high schools, as well as a couple of local companies. He is married and has 3 grown children. Besides his teaching, he serves as a track and field official at area high school and college track meets and enjoys competing in road races from 5k’s to marathons. He was a competitor in the 2013 Boston Marathon. He has recently completed a 6+ months in Africa studying the IT scene and potential.","GravatarUrl":"//www.gravatar.com/avatar/120ef58fff48751a0b80ff6192b5fc89","TwitterLink":"","GitHubLink":"","LinkedInProfile":null,"BlogUrl":"http://theitbearcat.blogspot.com/"},{"Id":"5184fe1d-3b2c-4ae4-9748-4a11d41a0547","FirstName":"Michael","LastName":"Meadows","Biography":"Michael is a professional programmer, architect, and hacker. He has served as architect on multiple large-scale, cloud-based Line-of-Business implementation projects. Additionally, Michael has extensive experience building high volume, processor intensive business logic applications.  He is a Director at Quick Solutions, Inc (QSI) in Columbus, Ohio where he chairs the Architecture Council, and leads the Enterprise Application Integration service offering.","GravatarUrl":"//www.gravatar.com/avatar/954765ec98d01561285873097362e3ee","TwitterLink":"https://twitter.com/antiarchitect","GitHubLink":"https://github.com/walkingdisaster","LinkedInProfile":"https://www.linkedin.com/in/michaelnmeadows","BlogUrl":"http://m.eado.ws"},{"Id":"d2d57573-e595-4a3f-8c3c-21b13402edc4","FirstName":"Ole","LastName":"Michaelis","Biography":"Ole Michaelis is the co-founder of SoCoded, a hackfest and web development conference in Hamburg. He’s a Software Engineer at Jimdo, a DIY website creator, where he focuses on backend development. In his free time, he’s building slidr.io, a hazzle-free slide sharing platform. Ole is passionate about open source software, enjoys traveling, and loves Mexican food. He classifies himself as a 'bad' German as he dislikes beer and soccer – the traditional German past-times.","GravatarUrl":"//www.gravatar.com/avatar/4c50caee0c6a446a0b60f827a2a1e5e5","TwitterLink":"https://twitter.com/codestars","GitHubLink":"https://github.com/nesquick","LinkedInProfile":"https://www.linkedin.com/in/olemichaelis","BlogUrl":"http://codestars.eu"},{"Id":"e839ede0-769a-49a7-9119-c724d202ca0f","FirstName":"Kerri","LastName":"Miller","Biography":"Kerri Miller is a Sr Software Developer and Team Lead based in the Pacific Northwest. She has worked at enterprise companies, international ad agencies, boutique consultancies, start-ups, mentors and teaches students, and finds time to work on Open Source projects. Having an insatiable curiosity, she has worked as a lighting designer, marionette puppeteer, sous chef, and professional poker player, and enjoys hiking, collecting Vespas, and working with glass.\r\n","GravatarUrl":"//www.gravatar.com/avatar/f4d5752d6f4f839083cf810ad2c3a911","TwitterLink":"https://twitter.com/kerrizor","GitHubLink":"https://github.com/kerrizor","LinkedInProfile":null,"BlogUrl":"http://kerrizor.com"},{"Id":"0e7a43ab-f259-4d03-b28a-923bd5f7debb","FirstName":"Darrel","LastName":"Miller","Biography":"Darrel has been building distributed business applications for more than 20 years. He is an active member of the .NET community and OSS contributor.  When he’s not reading IETF specifications in order to answer Stack Overflow questions, or writing tooling to help people build hypermedia driven client applications, you will find him enjoying time with his wife and daughter in Montreal, Quebec. Darrel works as a developer advocate at Runscope ensuring the best support possible to .NET developers who are building and consuming Web APIs. Darrel has been a long time member of the Microsoft Web API advisory board, a Microsoft Integration MVP and recently co-authored the O'Reilly book, Designing Evolvable Web APIs with ASP.NET.","GravatarUrl":"//www.gravatar.com/avatar/d88e410f1b6edb02394d0af408bbd68f","TwitterLink":"https://twitter.com/darrel_miller","GitHubLink":"https://github.com/darrelmiller","LinkedInProfile":null,"BlogUrl":"http://www.bizcoder.com"},{"Id":"033e8cf2-0679-4ce1-9a55-336ceb05f520","FirstName":"BJ","LastName":"Miller","Biography":"BJ Miller currently works for a large federal contractor with the Department of Defense as a SharePoint and Project Server administrator. BJ has been writing software on the iOS platform for just over 5 years, and been in enterprise domain administration, development, and solution hacking for over 15. He co-organizes the Cleveland CocoaHeads with the legendary Daniel Steinberg, has written and published an app in the iOS App Store, and is also writing a book titled “Sams Teach Yourself Swift in 24 Hours\".","GravatarUrl":"//www.gravatar.com/avatar/35064367606e3ddd851bf73f605f844c","TwitterLink":"https://twitter.com/bjmillerltd","GitHubLink":"https://github.com/https://github.com/sixfivesoftware","LinkedInProfile":"https://www.linkedin.com/pub/bj-miller/2/822/346","BlogUrl":"http://bjmiller.me"},{"Id":"64ae5793-e96a-4b39-b1ee-73e27b037d49","FirstName":"Don","LastName":"Miller","Biography":"Don Miller is the Principal Consultant of GroundSpeed™.  He has over 20 years of professional experience in addition to the sale of his first program (spaghetti code) at the age of 14.  His broad range of experience makes him very relatable to programmers and system engineers.  He is a crazed social networker within the nerd community, one of the founding partners of Seed Coworking in Toledo, and teaches iOS Application development at the University of Toledo.  You can find him online easily with Twitter or LinkedIn.  ","GravatarUrl":"//www.gravatar.com/avatar/149b85ac6ec0a542d368fb821bfaddf2","TwitterLink":"https://twitter.com/donmiller","GitHubLink":"https://github.com/donmiller","LinkedInProfile":"http://linkedin.com/in/dmiller","BlogUrl":"http://groundspeedhq.com"},{"Id":"5c43507c-a53e-452c-b0d0-0432fdfc35cd","FirstName":"Jeremy","LastName":"Miller","Biography":"Jeremy is the Director of Software Architecture at Extend Health. Jeremy began his software career writing \"Shadow IT\" applications to automate his engineering documentation, then wandered into software development because it looked like more fun. Jeremy is the author of StructureMap and the technical leader of the FubuMVC community.","GravatarUrl":"//www.gravatar.com/avatar/83a17261fd4c9f537e63165df6ba57bb","TwitterLink":"https://twitter.com/jeremydmiller","GitHubLink":"https://github.com/jeremydmiller","LinkedInProfile":"http://www.linkedin.com/pub/jeremy-miller/1/a3a/500/","BlogUrl":"http://jeremydmiller.com"},{"Id":"5a6a9e1f-5109-4811-90c5-4c103b72ebc8","FirstName":"Ernie","LastName":"Miller","Biography":"Ernie's been writing code since he was 6 years old, but only getting paid to do so for the past 16 years or so. Sometimes he still can't believe people actually *pay us* to have this much fun.","GravatarUrl":"//www.gravatar.com/avatar/2274a7476f6d2ac7aedcdec0651d0542","TwitterLink":"https://twitter.com/erniemiller","GitHubLink":"https://github.com/ernie","LinkedInProfile":"https://www.linkedin.com/in/erniemiller","BlogUrl":"http://erniemiller.org"},{"Id":"aa1db9b6-4149-4d00-9e41-668496b6e8f9","FirstName":"Nik","LastName":"Molnar","Biography":"Nik Molnar is a New Yorker, Microsoft MVP, ASP & Azure Insider and co-founder of Glimpse, an open source diagnostics and debugging tool. Originally from Homestead Florida, Nik specializes in web development, web performance, web API's and community management. He is a frequent speaker at international conferences and technical podcasts. In his spare time, Nik can be found cooking up a storm in the kitchen, hanging with his wife and working on other open source projects.","GravatarUrl":"//www.gravatar.com/avatar/e07a27ec61977c7c686feaa799b1cf6e","TwitterLink":"https://twitter.com/nikmd23","GitHubLink":"https://github.com/nikmd23","LinkedInProfile":null,"BlogUrl":"http://nikcodes.com"},{"Id":"4a918c84-78ef-4097-be44-b2862be609d5","FirstName":"James","LastName":"Montemagno","Biography":"James Montemagno is a Developer Evangelist at Xamarin. He has been a .NET developer for over a decade working in a wide range of industries including game development, printer software, and web services. Prior to becoming a Developer Evangelist, James was a professional mobile developer on the Xamarin platform for over 2 years, with several published apps on iOS, Android, and Windows. In his spare time he is most likely cycling around Seattle or guzzling gallons of coffee at a local coffee shop. He can be found on Twitter @JamesMontemagno and blogs code regularly on his personal blog www.MotzCod.es","GravatarUrl":"//www.gravatar.com/avatar/5df4d86308e585c879c19e5f909d8bfe","TwitterLink":"https://twitter.com/jamesmontemagno","GitHubLink":"https://github.com/jamesmontemagno","LinkedInProfile":"https://www.linkedin.com/in/jamesmontemagno","BlogUrl":"http://www.motzcod.es"},{"Id":"6961fce4-af8e-4552-b7da-3571ee1a256a","FirstName":"David","LastName":"Mosher","Biography":"JavaScripter. Guitarist. Empathizer.","GravatarUrl":"//www.gravatar.com/avatar/ead076bf445f9b50e3c094300e4690e9","TwitterLink":"https://twitter.com/dmosher","GitHubLink":"https://github.com/davemo","LinkedInProfile":"http://linkedin.com/in/dmosher","BlogUrl":"http://blog.davemo.com"},{"Id":"f729e969-6931-4d46-acfc-c7d0f5a0e0ab","FirstName":"Chris","LastName":"Nelson","Biography":"Chris Nelson is a software developer who hails from the fair city of Cincinnati, Ohio.  Though originally a violin performance major, he has been developing web applications for about 15 years and is passionate about finding better ways to do so.  He's spoken at most of the major ruby and java conferences and helped found Gaslight as a place for people to enjoy building amazing things together.","GravatarUrl":"//www.gravatar.com/avatar/718dad0c347f01108bfd008bc0a5b4f5","TwitterLink":"https://twitter.com/superchris","GitHubLink":"https://github.com/superchris","LinkedInProfile":null,"BlogUrl":null},{"Id":"f2dd4f97-cb75-4945-86f0-acab09e79151","FirstName":"Godfrey","LastName":"Nolan","Biography":"Godfrey Nolan is Founder and President of RIIS, an IT services firm specializing in mobile development in the Detroit Metro area.  He is also author of Bulletproof Android (Pearson, 2014), Android Best Practices (Apress, 2013), Decompiling Android (Apress, 2012) and Decompiling Java (Apress, 2004) and has written numerous articles for magazines and newspapers in the United States, the United Kingdom, and Ireland.  ","GravatarUrl":"//www.gravatar.com/avatar/e5276749bea799a329ba8c97c87addb1","TwitterLink":"https://twitter.com/godfreynolan","GitHubLink":"https://github.com/godfreynolan","LinkedInProfile":"https://www.linkedin.com/pub/godfrey-nolan/2/237/aa9","BlogUrl":"http://www.riis.com"},{"Id":"532edf7b-767b-413a-85d1-fc7c76a09359","FirstName":"Sean","LastName":"O'Connor","Biography":"Sean O'Connor is the Lead Application Engineer at Bitly.  Day to day he builds systems, reviews code, and works with the awesome crew at Bitly to create powerful new tools to help people understand the social web.  Outside of Bitly Sean spends most of his time biking around NYC, brewing cider, and keeping his dog out of trouble.\r\n","GravatarUrl":"//www.gravatar.com/avatar/7c4892dabc0e774cd66405b7137f72dc","TwitterLink":"https://twitter.com/https://twitter.com/theseanoc","GitHubLink":"https://github.com/https://github.com/seanoc","LinkedInProfile":"https://www.linkedin.com/in/seanoc","BlogUrl":"http://seanoc.com"},{"Id":"4274d92f-9dee-400a-a793-ff1677295ff4","FirstName":"R.J.","LastName":"Osborne","Biography":"R.J. Osborne has been addicted to programming since sixth grade.  After 18 years of professional software development, he’s made a dizzying number of fantastic development mistakes.  He has worked in both public and private sectors with everything from embedded C++ to AngularJS and CoffeeScript.  The ADHD keeps him exploring new things, but he has been a member of the Columbus Ruby Brigade for many, many years.\r\n","GravatarUrl":"//www.gravatar.com/avatar/370b8664950138c96cbb53e3f612797c","TwitterLink":"https://twitter.com/rjo1970","GitHubLink":"https://github.com/rjo1970","LinkedInProfile":null,"BlogUrl":null},{"Id":"bf9b2e1f-b65b-4dc8-8ad2-edba88004656","FirstName":"Joseph","LastName":"Ours","Biography":"With nearly two decades of career experience in Information Technology and Certified Project Management consulting, Columbus, Ohio-based Joseph Ours offers expertise as a leader in Software Quality Assurance and Testing. He believes in finding ways to harmoniously work with all core IT competencies, and as such as works as a developer, tester, business analyst, and program manager. His strategic thought process and ability to translate vision into action has resulted in many large successful initiatives. Joseph’s expertise has also led to numerous national speaking engagements.\r\n\r\nHe earned an MBA from Keller Business, as well as two bachelor’s degrees: in Electronic Engineering Technology from World College, and in Technical Management from DeVry University. He is also PMP certified by the Project Management Institute.\r\n\r\nJoseph lives in Columbus, Ohio, and has six adult children. He is an early adopter and active technology enthusiast. When not busy with family events, he chairs the Columbus Advisory Council for Per Scholas, a national non-profit organization based in New York, which aims to break the cycle of poverty by providing technology education, access, training and job placement services for people in under-served communities.","GravatarUrl":"//www.gravatar.com/avatar/e8db3a295983267553712deca404aa72","TwitterLink":"https://twitter.com/justjoehere","GitHubLink":"","LinkedInProfile":"https://www.linkedin.com/in/josephours","BlogUrl":"http://josephours.blogspot.com"},{"Id":"ec702929-7713-447c-8ac3-459d1db5a8a2","FirstName":"Bermon","LastName":"Painter","Biography":"A rootbeer drinking, cupcake eating, Spanish speaking, piano playing, handlebar mustache wearing designer/developer hybrid living in the glorious city of Charlotte, NC \r\n\r\nBermon is the organizer of various community groups for user experience designers and front-end developers, and the organizer of Blend Conference, a 3-day multi-track event for user experience strategists, designers and developers. He also leads the user experience team for Cardinal Solutions' Charlotte office where he consults with large enterprise clients on interesting problems across user experience, design and front-end development. \r\n\r\nIn his free time he contributes to http://sass-lang.com/ and is the father of the Sass logo.","GravatarUrl":"//www.gravatar.com/avatar/7559f6cff1f5efc2d210965febd4d71c","TwitterLink":"https://twitter.com/bermonpainter","GitHubLink":"https://github.com/bpainter","LinkedInProfile":"http://www.linkedin.com/in/bermonpainter/","BlogUrl":null},{"Id":"3e52a423-7eb3-4530-95d8-6815864272ef","FirstName":"Carey","LastName":"Payette","Biography":"Carey Payette is a Senior Software Engineer with Falafel Software and has over 14 years professional IT experience in industries ranging from government, to private sector and utilities holding multiple titles throughout this time including support developer/technician, data architect, software developer, software architect and enterprise architect. Carey’s an ASPInsider and was a recipient of the Microsoft MVP award in Client App Dev from 2009-2011.\r\n\r\nShe also serves as the Treasurer for the US National GiveCamp organization and is a member of the StirTrek organizing committee. Carey is a mom to 3 fabulous boys, a black belt in TaeKwonDo and enjoys coding for fun!\r\n","GravatarUrl":"//www.gravatar.com/avatar/719139fbb276f84e26fa2dca1412c70b","TwitterLink":"https://twitter.com/careypayette","GitHubLink":"https://github.com/codingbandit","LinkedInProfile":"http://www.linkedin.com/in/careypayette/","BlogUrl":"http://www.codingbandit.com"},{"Id":"667546ff-bd95-4b19-95ea-0955c07cf878","FirstName":"Kevin","LastName":"Pilch-Bisson","Biography":"Kevin has worked on the C# team at Microsoft for more than 12 years, and is currently the development lead for the team responsible for IDE features like IntelliSense, Refactoring and Formatting.  Outside of work, he is a marathon runner, hockey player, and beer drinker.  You can find Kevin on Twitter: @Pilchie","GravatarUrl":"//www.gravatar.com/avatar/9dff567da4fa98b3c190fded0b869739","TwitterLink":"https://twitter.com/pilchie","GitHubLink":"https://github.com/pilchie","LinkedInProfile":null,"BlogUrl":null},{"Id":"cecf54db-632a-408f-b1dc-0c9050e4743b","FirstName":"Mike","LastName":"Pirnat","Biography":"Mike Pirnat has been wrangling Pythons at social expressions leader American Greetings since 2000, where the siren song of Python 1.5 wooed him away from his former life as a Perl zealot. Since then he's guided major technology improvements, battled the forces of darkness (okay, mostly IE and Javascript), and splits his time between leading ninja strike teams, educating the next generations of rising developers, and organizing AG's annual Hack Day. He also co-hosts and produces From Python Import Podcast when there aren't a million other things going on.","GravatarUrl":"//www.gravatar.com/avatar/e4c5e3c69566ff80db62a4ab521b6e5a","TwitterLink":"https://twitter.com/mpirnat","GitHubLink":"https://github.com/mpirnat","LinkedInProfile":"http://www.linkedin.com/profile/view?id=3639319","BlogUrl":"http://mike.pirnat.com"},{"Id":"41d5aac4-a53f-4304-9303-feee91c934bf","FirstName":"Matthew","LastName":"Podwysocki","Biography":"Matthew Podwysocki is a Software Developer and Open Sourcerer at Microsoft.  He currently works on the Reactive Extensions for all languages at Microsoft including .NET, JavaScript, Python and Ruby.  He is a popular speaker at conferences and helps organize conferences such as CSSConf, JSConf and RobotsConf.  He is passionate about technology outreach, having volunteered in teaching the next generation in the joys of computer science.","GravatarUrl":"//www.gravatar.com/avatar/174252c83d38873e74de232f58717fd7","TwitterLink":"https://twitter.com/mattpodwysocki","GitHubLink":"https://github.com/mattpodwysocki","LinkedInProfile":null,"BlogUrl":null},{"Id":"c36104f1-e8d2-43b7-a5e2-5d721727a516","FirstName":"Eric","LastName":"Potter","Biography":"I am a Software Architect for Aptera Software in Fort Wayne Indiana, working primarily in the .Net platform. I have been developing high quality custom software solutions since 2001. I am also an adjunct professor of computer science at Indiana Tech. I love to dabble in new and exciting technologies. In my spare time, I love to tinker with Arduino projects. I have an amazing wife and 5 wonderful children. I see myself as a humble toolsmith.","GravatarUrl":"//www.gravatar.com/avatar/eca8c218581c34e426f56afa570de637","TwitterLink":"https://twitter.com/pottereric","GitHubLink":"https://github.com/pottereric","LinkedInProfile":null,"BlogUrl":"http://humbletoolsmith.com/"},{"Id":"e59b3b46-0f47-43e9-9075-a97ec4e539a3","FirstName":"Scott","LastName":"Preston","Biography":"Scott Preston is a software craftsman and roboticist from Columbus, Ohio. Over the past decade he has worked for some of the largest companies in the world and built & programmed lots of web sites and robots. When he’s not working on a new robot or web project, he consults and solves hard problems for ICC, which he joined in 2014. He is also a renowned speaker and has spoken at many events large and small to promote web development and robotics. You can find out more about Scott by visiting his website: http://www.scottpreston.com or his robot project site http://www.scottsbots.com.","GravatarUrl":"//www.gravatar.com/avatar/e600cdacc5f6ba2f21ef96bedee7f5c1","TwitterLink":"https://twitter.com/scottpreston","GitHubLink":"https://github.com/scottpreston","LinkedInProfile":"https://www.linkedin.com/in/scottpreston","BlogUrl":"http://www.scottpreston.com"},{"Id":"2cfa958b-3295-4389-8ccd-3a7e245c19d6","FirstName":"Reza","LastName":"Rahman","Biography":"Reza Rahman is a long time former independent consultant and now officially a Java EE/GlassFish evangelist at Oracle. He is the author of the popular book EJB 3 in Action. Reza is a frequent speaker at Java User Groups and conferences worldwide including JavaOne and NFJS. He is an avid contributor to industry journals like JavaLobby/DZone and TheServerSide. Reza has been a member of the Java EE, EJB and JMS expert groups. He implemented the EJB container for the Resin open source Java EE application server.\r\n\r\nReza has over a decade of experience with technology leadership, enterprise architecture, application development and consulting. He has been working with Java EE technology since its inception, developing on almost every major application platform ranging from Tomcat to JBoss, GlassFish, WebSphere and WebLogic. Reza has developed enterprise systems for well-known companies like eBay, Motorola, Comcast, Nokia, Prudential, Guardian Life, USAA, Independence Blue Cross and AAA using EJB 2, EJB 3, CDI, Spring and Seam.","GravatarUrl":"//www.gravatar.com/avatar/dbb54fd15f057dd9967e80e0afb660cc","TwitterLink":"https://twitter.com/reza_rahman","GitHubLink":"https://github.com/m-reza-rahman","LinkedInProfile":"https://www.linkedin.com/pub/reza-rahman/6/271/b5","BlogUrl":"https://blogs.oracle.com/reza/"},{"Id":"5d0de5e1-109e-4a9f-83e6-8edf5fdf00f6","FirstName":"Priya","LastName":"Rajagopal","Biography":"Priya Rajagopal has been professionally developing software solutions for over 15 years. She is currently leading the mobile development efforts at a startup in Ann Arbor, Michigan and in her spare time, does freelance mobile app development, consulting and mentoring. She is an active member of the local mobile development community where she frequently talks on mobile development related topics and co-organizes the Mobile Monday, Ann Arbor meetup group. Prior to mobile development, she worked on a range of technologies including IPTV, Social TV, targeted advertising, network management and platform security and is a co-inventor of several US patents. \r\nYou can follow her on twitter @rajagp.","GravatarUrl":"//www.gravatar.com/avatar/01c9d267e78a30758e8ce4a8735833e5","TwitterLink":"https://twitter.com/rajagp","GitHubLink":"","LinkedInProfile":"http://www.linkedin.com/pub/priya-rajagopal/1/2bb/b2a","BlogUrl":"http://www.priyaontech.com"},{"Id":"777f620d-0b1a-4ace-90d6-b8d2996aaf32","FirstName":"Rachel","LastName":"Reese","Biography":"Rachel Reese is a long-time software engineer and math geek who can often be found talking to random strangers about the joys of functional programming and F#. She currently helps run the Nashville F# User group, @NashFSharp, and previously ran the Burlington, VT functional programming user group, @VTFun. She's also an ASPInsider, an F# MVP, a community enthusiast, one of the founding @lambdaladies, and a Rachii. You can find her on twitter, @rachelreese, or on her blog: rachelree.se. ","GravatarUrl":"//www.gravatar.com/avatar/d760ba4eb702da0bbe285df91b75bcad","TwitterLink":"https://twitter.com/rachelreese","GitHubLink":"https://github.com/rachelreese","LinkedInProfile":"http://www.linkedin.com/in/rachelreese/","BlogUrl":"http://rachelree.se"},{"Id":"adabd6d5-d513-449f-bb17-4bf59cabede8","FirstName":"Michael","LastName":"Richman","Biography":"Michael Richman is a system architect on the Bitly engineering team. There, he builds backend systems, API layers, Enterprise products, streaming services, Hadoop jobs, queue readers, and anything else the company needs. He got his start in technology in 1998 writing automated publishing tools in Tcl to make his editorial job easier.","GravatarUrl":"//www.gravatar.com/avatar/fde0d4fe589b9d65999067467f858278","TwitterLink":"https://twitter.com/mrwoofster","GitHubLink":"https://github.com/mrwoof","LinkedInProfile":"https://www.linkedin.com/profile/view?id=6137804","BlogUrl":"http://mrwoof.tumblr.com/"},{"Id":"5a82a165-0f5e-45e1-b355-cb172ca4c712","FirstName":"Ryan","LastName":"Riley","Biography":"Ryan Riley builds web applications for Tachyus, an oil and gas startup based in San Mateo, CA. He has been awarded the Microsoft MVP award for Visual F# for four years and serves as the organizer for the Community for F# and as a management committee member for Open Web Interface for .NET (OWIN). Ryan has built applications in a variety of programming languages on multiple platforms and currently enjoys using F# to build simple abstractions for HTTP programs.","GravatarUrl":"//www.gravatar.com/avatar/383ac8889ab4215414c57e2b767ec7fa","TwitterLink":"https://twitter.com/panesofglass","GitHubLink":"https://github.com/panesofglass","LinkedInProfile":"https://www.linkedin.com/in/ryanriley","BlogUrl":"https://wizardsofsmart.net/"},{"Id":"a406e01a-adf9-4c58-abdc-1284cd8e0923","FirstName":"Chris","LastName":"Risner","Biography":"Chris Risner is a Senior Technical Evangelist for Microsoft Azure. There he is focused on connecting Microsoft Azure with mobile apps and building scalable backends. He has been working with iOS and Android development for the past several years. Before working in mobile development, Chris worked on many large scale enterprise applications in Java and .NET. Chis is a constant learner and has a vast amount of experience in iOS, Android, Smart Clients, Asp.Net MVC, C#, Java, and Objective C. You can find out more about Chris at http://chrisrisner.com and http://twitter.com/chrisrisner.","GravatarUrl":"//www.gravatar.com/avatar/79729a80454df949aef07edf079a74ef","TwitterLink":"https://twitter.com/chrisrisner","GitHubLink":"https://github.com/chrisrisner","LinkedInProfile":null,"BlogUrl":"http://chrisrisner.com"},{"Id":"8239f2da-71b2-4fda-b077-3ceb9b4ba918","FirstName":"Peter","LastName":"Ritchie","Biography":"Peter Ritchie is a software development consultant. Peter is president of Peter Ritchie Inc. Software Consulting Co., a software consulting company in Canada's National Capital Region specializing in Windows-based software development management, process, and implementation consulting. Peter has worked with such clients as Mitel, Nortel, Passport Canada, and Innvapost from mentoring to architecture to implementation. Peter has considerable experience building software development teams and working with startups towards agile software development. Peter's range of experience ranges from designing and implementing simple standalone applications to architecting distributed n-tier applications spanning dozens of computers; from C++ to C#. Peter is active in the software development community attending and speaking at various events as well as authoring various works including Refactoring with Microsoft Visual Studio 2010.","GravatarUrl":"//www.gravatar.com/avatar/9f2f98606c6c7002862ef3be62cfc97c","TwitterLink":"https://twitter.com/peterritchie","GitHubLink":"https://github.com/peteraritchie","LinkedInProfile":"http://ca.linkedin.com/in/peteraritchie","BlogUrl":"http://blog.peterritchie.com"},{"Id":"f651be9d-2e2f-4eeb-8c19-b499517851c7","FirstName":"Andrew","LastName":"Sardone","Biography":"Andrew is an Ann Arbor-based software engineer, spending most of his time working on Nutshell, a modern cloud-based CRM. He enjoys design, math, ruminating about software with his podcasting friends at codeoptional.com, and spending time with his wife and their resident bunny.","GravatarUrl":"//www.gravatar.com/avatar/f3c52a0537360c85b46e043711cab0c6","TwitterLink":"https://twitter.com/andrewa2","GitHubLink":"https://github.com/andrewsardone","LinkedInProfile":null,"BlogUrl":"http://andrewsardone.com"},{"Id":"c78df852-d7f7-4278-8f99-3488aa08ef11","FirstName":"Scott","LastName":"Seighman","Biography":"Scott Seighman is a Systems Engineer with Oracle where his primary focus is architecting open solutions that span the computing landscape. Prior to joining Oracle, Scott spent 12 years with Sun Microsystems as a systems engineer, promoting Java technologies (ME, SE, EE) throughout the Midwest.  Scott facilitates the Cleveland Java Meetup and has been a speaker at CodeMash, CodePaLOUsa, GRDevDay, GLOC and other regional developer conferences.","GravatarUrl":"//www.gravatar.com/avatar/94fb6232f790a592bf3404e565c9c261","TwitterLink":"https://twitter.com/javacleveland","GitHubLink":"https://github.com/swseighman","LinkedInProfile":"http://www.linkedin.com/in/swseighman/","BlogUrl":null},{"Id":"6c93046b-12e1-46c2-988c-8cb1fe20654c","FirstName":"Bill","LastName":"Sempf","Biography":"Bill Sempf is a software security architect. His breadth of experience includes business and technical analysis, software design, development, testing, server management and maintenance, and security. In his 20 years of professional experience he has participated in the creation of well over 200 applications for large and small companies, managed the software infrastructure of two Internet service providers, coded complex software happily in every environment imaginable, tested the security of all natures of applications and APIs, and made mainframes talk to cell phones. He is the author of C# 5 All in One for Dummies and Windows 8 Programming with HTML5 For Dummies; a coauthor of Effective Visual Studio.NET and many other books, a frequent contributor to industry magazines; and has recently been an invited speaker for the ACM and IEEE, BlackHat, CodeMash, DerbyCon, BSides, DevEssentials, the International XML Web Services Expo and the Association of Information Technology Professionals. Bill is the project leader of the OWASP .NET Project, and is the Administrative Director of Locksport International.","GravatarUrl":"//www.gravatar.com/avatar/54322397338e0d9cde1d7b61391f72d1","TwitterLink":"https://twitter.com/sempf","GitHubLink":"https://github.com/sempf","LinkedInProfile":"https://www.linkedin.com/in/billsempf/","BlogUrl":"http://sempf.net"},{"Id":"2574ca8c-a7a8-436a-96b4-d799ac475671","FirstName":"Dave","LastName":"Shah","Biography":"Dave Shah is just a dude trying to make the world a better place with every push to production. \r\n\r\nHe’s been writing Android apps for a number of years now and has served  in several technical and leadership roles. He gravitates towards test driven development, continuous improvement, and has way too much fun learning & sharing new ways to make himself and his teammates better developers and better leaders.","GravatarUrl":"//www.gravatar.com/avatar/15e2b24e4476b47cb88952da7a11a36f","TwitterLink":"https://twitter.com/daveshah","GitHubLink":"https://github.com/daveshah","LinkedInProfile":"http://www.linkedin.com/in/dashah/","BlogUrl":null},{"Id":"bff5544d-f2ba-43c5-82db-3c2c8b48881c","FirstName":"Brian","LastName":"Sherwin","Biography":"Brian Sherwin is a Technical Evangelist with Microsoft from Columbus, Ohio. He has been a consultant and trainer for over 15 years. One of his core passions is helping companies make decisions based on value and not a particular technology. When he's not trying to figure out some new technology, he spends time reading, Scouting, and drinking enough coffee to keep up with his five kids.","GravatarUrl":"//www.gravatar.com/avatar/c24ba58effd5b7bb3dcdbd3f3897cfcf","TwitterLink":"https://twitter.com/bsherwin","GitHubLink":"","LinkedInProfile":null,"BlogUrl":null},{"Id":"278a8267-dbc1-4f1c-8cf3-f5039c709ef8","FirstName":"Gary","LastName":"Short","Biography":"Gary Short is a freelance data science practitioner and trainer, based in Dundee, Scotland. He has a deep understanding of the full Hadoop and HDInsight environment, as well as an interest in Social Network Analysis, (UCINet and Pajek) and computational linguistics (NLTK). ","GravatarUrl":"//www.gravatar.com/avatar/7df42736bb80d30839269d533000e075","TwitterLink":"https://twitter.com/garyshort","GitHubLink":"","LinkedInProfile":null,"BlogUrl":"http://www.duncodin.it"},{"Id":"abec4332-6adf-41fe-9e60-0585e2e13bdb","FirstName":"Jon","LastName":"Skeet","Biography":"Jon Skeet is best known for his permanent presence on Stack Overflow, but rumor has it that he also has a day job working for Google in London. Jon's hobbies include obsessing about date and time APIs, reading the C# language specification, and giving presentations with bad artwork and sock puppets. Does this guy know how to party or what?","GravatarUrl":"//www.gravatar.com/avatar/9e8277f815de909df256027d206ca72a","TwitterLink":"https://twitter.com/jonskeet","GitHubLink":"https://github.com/jskeet","LinkedInProfile":null,"BlogUrl":"http://codeblog.jonskeet.uk"},{"Id":"c2d0ae15-a48a-4e72-bc7b-ddc209d07915","FirstName":"Steve","LastName":"Sneed","Biography":"Steve Sneed is a maker, programmer, musician, brewer, and Halloween enthusiast.  During the day, he runs Sneed.Net Consulting, LLC, a technology consulting firm.  During the night, Sneed enjoys creating phat grooves and delicious brews.  It is during the Halloween season where he gets to let his inner maker howl at the moon.  With his son, Zack and wife, Kristi, he creates cool interactive Halloween games using new and cutting edge technologies, including hacking computer vision through OpenCV, Wii remotes, pneumatic actuators, fractional horsepower motors, and other cool technology.\r\n\r\nStarting in October of 2014, Sneed is co-creator of How-To Halloween, a Lansing, MI-based event dedicated towards the promotion of the DIY spirit of the haunting season.  Taking place at the Lansing Center, the event hopes to inspire current and future makers to create something cool out of the mundane: costumes, decorations, or large displays.\r\nhttp://how-tohalloween.com","GravatarUrl":"//www.gravatar.com/avatar/a765aa94c4f265c17101f85a3bb74d80","TwitterLink":"https://twitter.com/thawedhead","GitHubLink":"","LinkedInProfile":"https://www.linkedin.com/pub/steve-sneed/3/894/6a1","BlogUrl":null},{"Id":"3d87bbd3-b2b6-4ba7-9ce0-445cde6ebd9e","FirstName":"Magnus","LastName":"Stahre","Biography":"Magnus Stahre is a software craftsman doing application development for almost two decades.\r\n\r\nHe is currently an Agile craftsman at Pillar Technology where he solves difficult problems while coaching others on techniques and tools\r\nthat help developers work better.\r\n\r\nHe is also a dedicated Unix lover, having started his career as a sysadmin.\r\n","GravatarUrl":"//www.gravatar.com/avatar/c984a37ed01f1a6304380f37512b3890","TwitterLink":"https://twitter.com/magnusstahre","GitHubLink":"https://github.com/magnusstahre","LinkedInProfile":"http://www.linkedin.com/in/magnusstahre","BlogUrl":"http://ms.xy.org"},{"Id":"850e57a0-798c-4ceb-aaaf-76c0a1144669","FirstName":"David","LastName":"Stanek","Biography":"David Stanek has been developing software professionally for over 17 years. He is currently a Software Engineer at Rackspace. Python has been his language of choice for over 12 years both on and off of the job.\r\n\r\nDavid spends much of his free work time working on open source projects and sharpening his technical skills. He helps organize the Cleveland Area Python Interest Group. He's also a cofounder and cohost of From Python Import Podcast. He enjoys reading technical books and listening to a variety of podcasts and audio books. Google him for more information.\r\n\r\nWhen he's not working he enjoys spending time with his beautiful wife and 4 wonderful children.","GravatarUrl":"//www.gravatar.com/avatar/00574728e2f964ce98a8f3adc826f8c8","TwitterLink":"https://twitter.com/dstanek","GitHubLink":"https://github.com/dstanek","LinkedInProfile":"https://www.linkedin.com/in/dstanek","BlogUrl":"http://traceback.org"},{"Id":"24d529f4-0301-423e-85c0-bd8b2d6a25e7","FirstName":"Douglas","LastName":"Starnes","Biography":"Douglas Starnes is a polyglot ninja in the Memphis, TN area.  In the past 7 years as a software engineer he has written applications for business, academia and government in the United States and abroad.  His community involvement includes speaking at conferences such as DevLink, St. Louis Days of .NET, CodePaLOUsa, CodeStock and PyOhio in addition to the .NET and Java User Groups in Memphis. He is the co-organizer of the Memphis Python User Group (MEMPy) and one of the organizers of PyTennessee, the annual state of Tennessee Python conference. Douglas is also a founding board member of GeekMemphis, the local technology advisory organization in Memphis. He can be found on the web at http://douglasstarnes.com and on Twitter at @poweredbyaltnet.","GravatarUrl":"//www.gravatar.com/avatar/6a78aaa9333a1ea6a115da6ecdf37bd9","TwitterLink":"https://twitter.com/poweredbyaltnet","GitHubLink":"https://github.com/douglasstarnes","LinkedInProfile":"http://linkedin.com/in/douglasastarnes","BlogUrl":"http://blog.douglasstarnes.com/"},{"Id":"75538a62-da47-413c-8c73-1fb87c6c3fa4","FirstName":"Jeff","LastName":"Strauss","Biography":"Jeff Strauss is a developer, analyst, and an attorney -- but first and foremost, he is a consultant. After coming of age in the golden years of MS-DOS and BBSes, Jeff chose to pursue a legal education and private law practice for several years.  Yet his lifelong passion for technology just couldn't stay dormant, instead drawing him back into the software industry in 2008.  Using his combined business background and technology experience, Jeff's main focus is consumer product development, spending the last four years with St. Louis-based ArchitectNow.  Jeff also serves on the board of directors of the St. Louis Days of .NET Conference (STLDODN) and the St. Louis .NET User Group.","GravatarUrl":"//www.gravatar.com/avatar/c546a0d187d12bb1c81f0918c956c55a","TwitterLink":"https://twitter.com/jeffreystrauss","GitHubLink":"","LinkedInProfile":"https://www.linkedin.com/pub/jeffrey-strauss/4/82a/251","BlogUrl":null},{"Id":"1683cefd-7c34-428d-8a8d-fbf9505eec74","FirstName":"Craig","LastName":"Stuntz","Biography":"Craig Stuntz is am a software engineer and a lifelong student of computer science with specific interests in programming languages, type theory, compilers, and math. He lives in Columbus, Ohio, works for Improving Enterprises, and cofounded the Columbus branch of Papers We Love, a reading group for people interested in academic computer science research.\r\n\r\nWhen not at work or playing with his kids, he is usually studying math or playing Irish traditional music on the tin whistle and wooden flute.","GravatarUrl":"//www.gravatar.com/avatar/a45302e072f5c7cfd34d18328139ff66","TwitterLink":"https://twitter.com/craigstuntz","GitHubLink":"https://github.com/craigstuntz","LinkedInProfile":null,"BlogUrl":"http://blogs.teamb.com/craigstuntz"},{"Id":"e27bf0df-5f3f-4a81-a5d2-1c6b60de936b","FirstName":"Tony","LastName":"Surma","Biography":"Coming Soon","GravatarUrl":"//www.gravatar.com/avatar/181a7c08a94174282a8e4af50270df22","TwitterLink":"","GitHubLink":"","LinkedInProfile":null,"BlogUrl":null},{"Id":"2955186b-c44a-4954-b910-83ad38341b7f","FirstName":"Gail","LastName":"Swanson","Biography":"Gail Swanson uses her UX powers for good, extending empathy to users and clients alike. As a died-in-the-wool UXer, she is passionate about linking businesses to the value of exploration and connecting with customers. Based in Chicago, Gail believes in reading everything, spontaneous workplace sing-a-longs, and grownups doing cartwheels. ","GravatarUrl":"//www.gravatar.com/avatar/b8894bd7c9a53e2ed28a79e796fca819","TwitterLink":"https://twitter.com/practicallyux","GitHubLink":"","LinkedInProfile":"http://www.linkedin.com/in/gailswanson/","BlogUrl":"http://www.practicallyux.com"},{"Id":"28292ce0-cac4-471e-9464-fdb4db745421","FirstName":"Dave","LastName":"Swersky","Biography":"I've been in IT for over 18 years, filling a variety of roles (often many at the same time) including product support, software development, and Enterprise Architecture.  The arc started with building PCs for retail sale, when the 486 was state of the art.  It continued from there to 1-800-BE-A-GEEK (if you lived in Dallas in the late 90s you'll know what that was...) Next was Microsoft, where I learned how to learn about technology.  I then switched to software development full time for a variety of positions in Real estate, digital marketing, and banking. Today I work in Enterprise Architecture, researching software development standards and planning DevOps Transformation.  When I'm not writing code or researching, I'm spending time with my family, playing guitar, and blowing up pixels on screens.","GravatarUrl":"//www.gravatar.com/avatar/0e9420fd2a6d39a3779e1d9119834bff","TwitterLink":"https://twitter.com/dswersky","GitHubLink":"","LinkedInProfile":null,"BlogUrl":null},{"Id":"2daa0487-e7c9-4f7b-a869-6ad0618e6371","FirstName":"Kevin","LastName":"Swiber","Biography":"Kevin has spent over a decade participating in software projects for enterprises and the community, sporting classy titles such as Sr. Software Engineer and Enterprise Architect.  He has a strong focus on creating strategies that spark innovation and facilitate growth within organizations.  Kevin is passionate about open collaboration and the benefits of free software.  He is the author of Siren, a hypermedia specification, as well as many open source software projects.  Kevin is the co-organizer of API Craft Conference, DetNode (the Detroit Node.js Meetup), and the regional API Craft Detroit Meetup.","GravatarUrl":"//www.gravatar.com/avatar/49e2f463432929535e81781f3490336d","TwitterLink":"https://twitter.com/kevinswiber","GitHubLink":"https://github.com/kevinswiber","LinkedInProfile":"https://linkedin.com/in/kevinswiber","BlogUrl":null},{"Id":"e68e48f1-426a-4812-aa72-f76408b37559","FirstName":"Itamar","LastName":"Syn-Hershko","Biography":"Microsoft ASP.NET MVP, and a search technologies, distributed systems and architecture expert.\r\n\r\nApache Lucene.NET committer, Elasticsearch savant, and the author of RavenDB in Action.\r\n\r\nI'm a frequent speaker at international conferences and provide on-site training and consultancy services around the world.\r\n\r\nCurrently self-employed as a consultant and freelance developer doing lots of interesting projects world-wide.","GravatarUrl":"//www.gravatar.com/avatar/1bd776c3d70cec1b14dbfd6ac97c7810","TwitterLink":"https://twitter.com/synhershko","GitHubLink":"https://github.com/synhershko","LinkedInProfile":"http://il.linkedin.com/pub/itamar-syn-hershko/13/250/78b/","BlogUrl":"http://code972.com"},{"Id":"f3e62400-5fd8-4099-8470-f5c0d900d5e5","FirstName":"Lino","LastName":"Tadros","Biography":"Alain \"Lino\" Tadros is President & CEO of Falafel Software, a Silicon Valley based company, with presence in Colorado,Texas, Michigan, Florida and North Carolina, dedicated to providing world-class consulting, training, and software development for small, medium, and enterprise level businesses. Prior to founding Falafel, Lino was a member of the development team at Borland for Delphi and C++Builder. Lino has been awarded Microsoft MVP status twelve years in a row for his numerous contributions to the C# community and is an expert in .NET, LINQ, ASP.NET, MVC, XAML, Windows Phone and Web Services. Lino is an industry renowned speaker and has given numerous presentations on 5 different continents since 1994. He also currently sits on the Board of Directors of 4 Silicon Valley corporations.","GravatarUrl":"//www.gravatar.com/avatar/77503ad16c388ce70fcdd6ca19df5a49","TwitterLink":"https://twitter.com/linotadros","GitHubLink":"https://github.com/falafelsoftware","LinkedInProfile":"http://www.linkedin.com/in/linotadros","BlogUrl":"http://blog.falafel.com"},{"Id":"d57f6eb9-ed8d-461e-b0bb-2867c6319424","FirstName":"Rob","LastName":"Tarr","Biography":"I'm a developer at Sparkbox in Dayton, Ohio. I spend my days writing JavaScript, HTML, CSS, Ruby, PHP and building tools that help to make the Internet a better place for everyone. When I'm not at work I can usually be found building LEGOs with my kids, hanging out with my wife, hacking on my Arduino or experimenting with what I can do with JavaScript.","GravatarUrl":"//www.gravatar.com/avatar/1ac0c8579c9d099b98b8eee3e9b9449a","TwitterLink":"https://twitter.com/robtarr","GitHubLink":"https://github.com/robtarr","LinkedInProfile":"https://www.linkedin.com/in/robtarr","BlogUrl":"http://seesparkbox.com/foundry/author/rob_tarr"},{"Id":"31b954d8-b7f4-4d59-9b74-ce7377f77624","FirstName":"Don","LastName":"Taylor","Biography":"Don Taylor is an enterprise architect and developer having over 20 years experience building solutions ranging from intelligent systems monitoring and manufacturing control to distributing ladies underwear. He's currently working on making the electrical grid smarter.  He's a lifelong resident of Central Ohio graduating Summa Cum Laud from The Ohio State University with a B.S. in Computer Science. Since sending his twins off to college he enjoys spending time with his wife, daughter and airedale terrier having the official AKC registration name of “Sir Stallman of GNU.” ","GravatarUrl":"//www.gravatar.com/avatar/6becc18433480b5f7ddf8d08a0c9fa99","TwitterLink":"https://twitter.com/taylodl","GitHubLink":"https://github.com/taylodl","LinkedInProfile":"https://www.linkedin.com/in/taylodl","BlogUrl":"http://taylodl.wordpress.com"},{"Id":"dba624b5-f231-40e4-ad9f-9101f8ae15f6","FirstName":"Chandu","LastName":"Tennety","Biography":"Chandu stumbled out of the jungles of manufacturing and ERP consulting, and landed in the zen garden of software development at Neo. He has been contemplating the nature of the Object Model ever since. When not developing, Chandu enjoys family time, hiking, drinking tea, birdwatching and solving cryptic crosswords.","GravatarUrl":"//www.gravatar.com/avatar/27d007e2e1a2bafac9250fcf5dcc3d5b","TwitterLink":"https://twitter.com/tennety","GitHubLink":"https://github.com/tennety","LinkedInProfile":null,"BlogUrl":null},{"Id":"bec20715-0769-418a-a2c3-35835e21e2b9","FirstName":"Ben","LastName":"Thorp","Biography":"Coming Soon","GravatarUrl":"//www.gravatar.com/avatar/25490321cf15e9d7cf3e82682b2133e7","TwitterLink":"","GitHubLink":"","LinkedInProfile":null,"BlogUrl":null},{"Id":"5bd32894-f84d-45fc-9d79-a9cff2afa852","FirstName":"David","LastName":"Truxall","Biography":"A long time resident of metro Detroit, Dr. Truxall has been slinging code for a living since 1995, working with enterprise web technologies, modeling business processes, and building public web sites and mobile apps for some of the largest companies in North America. Always an enthusiast for troubleshooting systems, Trux has rescued numerous troubled applications and improved their performance. Co-author of the book \"Android Best Practices\", he speaks at local conferences and user groups. Currently Trux is working in mobility at Hewlett-Packard, bringing mobile apps and their supporting systems to the public sector. ","GravatarUrl":"//www.gravatar.com/avatar/555338823dc02d51083a3fdba2852960","TwitterLink":"https://twitter.com/davetrux","GitHubLink":"https://github.com/davetrux","LinkedInProfile":"http://www.linkedin.com/in/davetrux","BlogUrl":"http://blog.davidtruxall.com"},{"Id":"0a4d75f0-7b0c-4c9a-ac8c-f760aaf6e1ea","FirstName":"Dustin","LastName":"Updyke","Biography":"Dustin Updyke is an Innovation Engineer at a major pharmaceutical company and has been involved in many different roles within software development since 1997. Working in early stage startups for the majority of his career, he’s had experience in a wide variety of technologies and industries.\r\n\r\nCurrently he is championing user experience, writing code, and evaluating next generation capabilities and technologies at a global scale and pushing others to do the same, all while championing the lost art of the bow tie.","GravatarUrl":"//www.gravatar.com/avatar/ffcf1dd3d18f90d7a1c4ba2fe0ab497b","TwitterLink":"https://twitter.com/dustinupdyke","GitHubLink":"https://github.com/dustinupdyke","LinkedInProfile":"http://www.linkedin.com/in/dustinupdyke/","BlogUrl":"http://updyke.com"},{"Id":"44fb9750-c690-417d-839e-3587f3fd9f50","FirstName":"Brad","LastName":"Urani","Biography":"Brad Urani builds software for start-ups. He's an application architect specializing in Agile test-driven development. He's Director of Engineering at Upside, a financial software start-up in St. Louis that's changing the way the world invests. He's a frequent speaker at conferences and meetups and he teaches classes for LaunchCode, a non-profit that places aspiring programmers in their first jobs. When driving on the highway he usually misses his exit because he's thinking about programming.","GravatarUrl":"//www.gravatar.com/avatar/8282ac14fc49ed24575362a2271debbe","TwitterLink":"https://twitter.com/bradurani","GitHubLink":"https://github.com/bradurani","LinkedInProfile":"http://www.linkedin.com/in/bradurani/","BlogUrl":"http://fractalbanana.com"},{"Id":"d5b5c0b2-a9c8-480b-b7fd-13ccfe28d1a7","FirstName":"John","LastName":"Van Enk","Biography":"John is a low-level software developer. He's worked on a range of devices: anything from airplanes to oil pipeline inspection robots. He's also a huge functional programming nerd, but don't tell the other hardware hackers.","GravatarUrl":"//www.gravatar.com/avatar/ed14e8cc54f4e05460109c60ea5a8478","TwitterLink":"https://twitter.com/sw17ch","GitHubLink":"https://github.com/sw17ch","LinkedInProfile":null,"BlogUrl":null},{"Id":"103bf551-e89a-4b59-aa30-4164dbc79b16","FirstName":"Bill","LastName":"Wagner","Biography":"Bill’s technical time is spent between curly braces, primarily with C#. His technical areas of focus are C#, .NET, TypeScript. His  non-coding passion is to help organizations build effective, high-functioning developer teams. Bill is the author of the best selling \"Effective C#\", now in its second edition, and \"More Effective C#\". He has created LiveLessons on Async programming in C# and C# Puzzlers. His articles have appeared in MSDN Magazine, the C# Developer Center, Visual C++ Developer's Journal, Visual Studio Magazine, ASP.NET Pro, .NET Developer's Journal and more. He's written hundreds of technical articles for software developers. He actively blogs about technical and business topics at http://thebillwagner.com. Bill is also a regional director for Microsoft. He’s the president of Humanitarian Toolbox, a non-profit organization dedicated to improving the response capabilities of lead disaster response organizations through use of a “toolbox” of community built and maintained pre-packaged, rapidly deployable open source solutions. ","GravatarUrl":"//www.gravatar.com/avatar/810cc26c65707ffd2c6275b2a32345c2","TwitterLink":"https://twitter.com/billwagner","GitHubLink":"https://github.com/billwagner","LinkedInProfile":"http://www.linkedin.com/in/billwwagner/","BlogUrl":"http://thebillwagner.com/blog"},{"Id":"4124580e-cc53-4de0-b9ce-99fc7c3a2e5b","FirstName":"George","LastName":"Walters","Biography":"During the daylight hours, George works as an application developer for JP Morgan Chase. With more than 10 years experience in application development, he has become an advocate for building clean, concise code without sacrificing the user experience. He builds applications in an agile environment using a variety of technologies including Java, Groovy, Objective-C, JavaScript and Ruby. He is also a strong promoter for using Adaptive and Responsive Design in all aspects of web development and pushes the need for developers to become stronger and more affluent in the Web UI stack of technologies. \r\n\r\nAfter dark, well, that's a different story... Between raising two young kids with his wife, Jen, he enjoys role playing games, science-fiction, comics and technology. ","GravatarUrl":"//www.gravatar.com/avatar/a9045200c84fc370f06b04bc49047494","TwitterLink":"https://twitter.com/walterg2","GitHubLink":"https://github.com/walterg2","LinkedInProfile":"https://www.linkedin.com/profile/view?id=15750933","BlogUrl":null},{"Id":"a87018b9-f97c-4811-a4ee-7f6f14290366","FirstName":"Cameron","LastName":"Wardzala","Biography":"Long time front-end developer. Who has worked for marketing, audiobook, and lolcat companies. Passionate about all things web and tech. Father. Husband. Tea drinker. Metal Head.","GravatarUrl":"//www.gravatar.com/avatar/2030baec3517ca4b3d8fb21523509672","TwitterLink":"https://twitter.com/camwardzala","GitHubLink":"https://github.com/cwardzala","LinkedInProfile":"https://www.linkedin.com/in/cameronwardzala","BlogUrl":"http://dangerisgo.com"},{"Id":"fce6393b-0186-431f-be91-85ebd2ee453f","FirstName":"Keith","LastName":"Wedinger","Biography":"Keith Wedinger is a Solutions Architect with Leading EDJE. He has over 25 years experience designing, developing and delivering high quality software solutions for several companies including Lexmark, Diebold, Limited Brands, Sterling Commerce and IBM. Recently, he completed a Phonegap / web technology based Android mobile app solution to help automate the workflow for his client's 1,200 service technicians. He also completed push notification support for a client’s native Android app that allows the client’s employees to be notified of new equipment alarms. He has presented \"Real World Mobile App Development with Phonegap\" at Columbus Code Camp, StirTrek and M3. He is currently working on the design and architecture of a mobile and server vehicle health management solution for a large trucking company.","GravatarUrl":"//www.gravatar.com/avatar/0f9b63d2b346fe2f928861511057dd35","TwitterLink":"https://twitter.com/jkwuc89","GitHubLink":"https://github.com/jkwuc89","LinkedInProfile":"https://www.linkedin.com/in/kwedinger","BlogUrl":null},{"Id":"a6bec37c-9939-41a9-93e4-6b3f8a9e55ce","FirstName":"Bobby","LastName":"Whitman","Biography":"Bobby Whitman is a technologist and the co-founder of Dynamit, one of the fastest-growing digital agencies in the United States. As COO of Dynamit, Bobby is responsible for the delivery of quality business and consumer software solutions for the organization’s clients.","GravatarUrl":"//www.gravatar.com/avatar/1caa69e97547306f38c792b705afdb9a","TwitterLink":"","GitHubLink":"","LinkedInProfile":null,"BlogUrl":null},{"Id":"d7470df4-38ba-403d-adad-2e73fc01a74f","FirstName":"matt","LastName":"winkler","Biography":"Matt is a Principal Lead Program Manager for Big Data at Microsoft, where he spends most of his time making the cloud a beautiful place for elephants to roam by building HDInsight.  Originally from St. Louis, he's been at Microsoft for 9 years working on developer platforms, tools and Azure.  He likes Hadoop, Big Data, long walks on the beach, and watching hockey.  When not working, he spends his free time chasing his two amazing kids down the ski slopes. ","GravatarUrl":"//www.gravatar.com/avatar/708816a65ba4164fe2b227d60a08dfe1","TwitterLink":"https://twitter.com/mwinkle","GitHubLink":"https://github.com/mwinkle","LinkedInProfile":"http://www.linkedin.com/pub/matthew-winkler/3/224/746/","BlogUrl":"http://blogs.msdn.com/mwinkle"},{"Id":"7645c54a-325e-4fff-a18c-8cd87bd60020","FirstName":"Gina","LastName":"Winkler","Biography":"Gina Winkler is the Managing Director of our Columbus office. Gina is a long time product leader, who has launched and delivered several large scale web products for leading internet companies. Her experience defining products to both meet a market need and fulfill the business goal is what refined her ability to guide clients through the process. Joining the Neo family was a perfect opportunity to support her mission of making the world a better place by delivering products people love to use.\r\n\r\nEntering the industry at its roots with CompuServe, she learned the value of building relationships and pushing the envelope. Gina's path led to America Online and later Netscape, as a head of product management. Prior to taking time off for family, Gina served as VP of Product in starting up ShareThis (formerly Nextumi), one of the top share buttons on the web today. ","GravatarUrl":"//www.gravatar.com/avatar/31232f8fd8c8f05be6bd243a6355b098","TwitterLink":"https://twitter.com/ginawinkler","GitHubLink":"https://github.com/ginawinkler","LinkedInProfile":null,"BlogUrl":null},{"Id":"9e4f8bb7-d199-4dbb-888b-1a807b5097f3","FirstName":"Johnny","LastName":"Winn","Biography":"Visionary, Analyzer, Action Taker: A long-time developer with an eclectic skill set, Johnny Winn is a Software Craftsman with a passion for building quality solutions. However the journey leading toward software craftsmanship has diverged down many paths. From musician to electrical engineer, chef to software developer, rugby player to local politician, the twist and turns have provided a wide range of experiences that have helped to shape him. He is currently creating innovative solutions as a Developer Evangelist @ Traitify and author of Elixir for the Functional Rubyist.","GravatarUrl":"//www.gravatar.com/avatar/5f89c4b03d2d165c64fe16bda895c9a4","TwitterLink":"https://twitter.com/johnny_rugger","GitHubLink":"https://github.com/nurugger07","LinkedInProfile":null,"BlogUrl":null},{"Id":"9f3c9092-8924-4a5d-83da-c3ad58dc0eba","FirstName":"Joe","LastName":"Wirtley","Biography":"Joe Wirtley is an independent consultant who has been creating software for over twenty-five years.  He works with .NET development teams on both desktop (WPF) and web (ASP.NET, JavaScript, Web API) applications.  He is an active member of the developer community in southwest Ohio and helps lead the Dayton .NET Developer Group.  He has presented at many user groups and regional conferences including CodeMash, devLink, Code PaLOUsa and CodeStock. You can check out his site at http://WirtleyConsulting.com, or follow him on Twitter: @JoeWirtley. Surprisingly, he has not won a game console at CodeMash since 2008.","GravatarUrl":"//www.gravatar.com/avatar/cf6b28cfe39c5f39a6d3dc7b52f53a2d","TwitterLink":"https://twitter.com/joewirtley","GitHubLink":"https://github.com/joewirtley","LinkedInProfile":"https://www.linkedin.com/in/joewirtley","BlogUrl":"http://WirtleyConsulting.com"},{"Id":"37ec3662-9d37-469c-855d-6266c714dab5","FirstName":"Mike","LastName":"Wood","Biography":"Mike Wood is a Technical Evangelist for Red Gate Software on the Cerebrata Team. He describes himself as a problem solving, outdoorsy, user group founding, dog-loving, blog writing, solution creating, event planning, married, technology speaking, father of one kind of guy. When he's not living up to that title he's an avid reader, (horrible) violinist and gamer. Mike is one of the Founding Directors of the Cincinnati .NET User Group as well a Microsoft MVP in Microsoft Azure.  You can catch up with Mike on his blog at http://mvwood.com/blog and on twitter under the handle @mikewo.","GravatarUrl":"//www.gravatar.com/avatar/b9b39ca6817962b90403e34433be32b3","TwitterLink":"https://twitter.com/mikewo","GitHubLink":"https://github.com/mikewo","LinkedInProfile":"https://www.linkedin.com/in/mikewo","BlogUrl":"http://mvwood.com"},{"Id":"11e2d7c8-4ef4-43e8-85f0-b1f10a744ee5","FirstName":"Chris \"Woody\"","LastName":"Woodruff","Biography":"Chris Woodruff (or Woody as he is commonly known as) has a degree in Computer Science from Michigan State University’s College of Engineering. Woody has been developing and architecting software solutions for almost 15 years and has worked in many different platforms and tools. He is a community leader, helping such events as Day of .NET Ann Arbor, West Michigan Day of .NET and GRDevDay. He was also instrumental in bringing the popular Give Camp event to Western Michigan where technology professionals lend their time and development expertise to assist local non-profits. As a speaker and podcaster, Woody has spoken and discussed a variety of topics, including database design and open source. He is a Microsoft MVP in Visual C# and was recognized in 2010 as one of the top 20 MVPs world-wide.\r\n","GravatarUrl":"//www.gravatar.com/avatar/1955b544932b88976cc86f0220ef15e3","TwitterLink":"https://twitter.com/cwoodruff","GitHubLink":"https://github.com/cwoodruff","LinkedInProfile":"http://www.linkedin.com/in/chriswoodruff/","BlogUrl":"http://chriswoodruff.com/"},{"Id":"f3d07467-6721-4fb4-a27b-b4472519c80b","FirstName":"James","LastName":"York ","Biography":"James York is a musician-turned-software-developer who is like a knowledge TARDIS. A relative newcomer to the software industry, James packs a disproportionate amount of experience into his few years on the job. He currently builds AngularJS apps for cars (lolwut?) on OnStar's connected consumer platform. He has previously worked in enterprise java and on an enterprise service bus, which even he has trouble describing. Passionate about helping others find their way into software, James spends his spare time mentoring local software newbies, volunteering with Girl Develop It, and teaching beginner programming classes for Grand Circus Detroit. He also recently co-founded a user group dedicated to software craftsmanship in downtown Detroit called the Detroit Craftsman Guild.  He loves good chocolate chip cookies, bad kung fu movies, and is still waiting for Gandalf to invite him on an adventure.","GravatarUrl":"//www.gravatar.com/avatar/6d10ee9ff627187e9d5b59e410fec248","TwitterLink":"https://twitter.com/kroysemaj","GitHubLink":"https://github.com/kroysemaj","LinkedInProfile":"https://www.linkedin.com/in/jamesoleanyork","BlogUrl":"http://testdrivenme.wordpress.com/"},{"Id":"63bc94b2-39f9-4bd7-9545-e155cf49d6b9","FirstName":"Shane","LastName":"Zatezalo","Biography":"Full time iOS/Mac developer for Dynamit, LLC. Founder of @BuckeyeCocoa Central Ohio's iOS/Mac Developer Meetup group (Cocoaheads/NSCoder). Grew up in Cleveland. Go BUCKS!","GravatarUrl":"//www.gravatar.com/avatar/f337be065c948a1a8913e2058efcf9eb","TwitterLink":"https://twitter.com/lottadot","GitHubLink":"https://github.com/lottadot","LinkedInProfile":"http://www.linkedin.com/in/lottadot/","BlogUrl":null}]