[{"Id":2665,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"(Nearly) Everything You Ever Wanted to Know About Active Recognizers (but were Afraid to Ask )","Abstract":"This presentation will provide a concise, but thorough, review of one of the more unique features of the F# language: active recognizers. Also known as active patterns, this feature allows one to extend the pattern-matching capabilities of the language. Active recognizers may be put to great effect in taming unruly APIs, improving the declarative style of one's code, constructing embedded DSLs, and much more. This talk will be given in a lecture format, interspersing digestible code samples with detailed breakdown of syntax. Additional consideration will be given, time permitting, to appropriate use-cases for active recognizers and a discussion of the under-lying mechanics. The review is aimed at advanced beginners who are familiar with F#'s general syntax and usage. Also, while not strictly necessary, those wishing to follow along via computer are encouraged to have, at least, version 2.0 of the core F# tools. Information on obtaining the latest version of F# (for your platform of choice) may be found at: http://fsharp.org. ","SessionType":"Regular Session","Tags":[".NET","Functional Programming"],"Speakers":[{"Id":"bea1a4d6-f7b9-41b1-b290-f83b6f614fc8","FirstName":"Paul","LastName":"Blasucci","GravatarUrl":"//www.gravatar.com/avatar/b860f2c5e825f9e777947b50cff3d2a5"}]},{"Id":2724,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"“So UX Designers Just Make Things Pretty, Right?” & Other Myths Debunked","Abstract":"Using real-world examples from applications such as retailer data visualizations, healthcare websites, and control engineering mobile and desktop software, Kaitlan illustrates how UX      \r\n\r\n* challenges design thinking and builds consensus in companies both large and small,   \r\n* drives Interaction Design, Information Architecture, and Content Strategy, and   \r\n* dispels pervasive over-simplifications, such as “UX = Graphic Design” and “Fewer clicks = good UX”.      \r\n\r\nIf you’ve ever questioned the need for UX in your project, this talk is for you.     \r\n\r\nTopics:   \r\n* UX ≠ Visual Design   \r\n* UX application in Agile environment   \r\n* Fewer clicks ≠ Good UX   \r\n* UX-driven Information Architecture   \r\n* UX-driven Interaction Design   \r\n* UX-driven Content Strategy   \r\n","SessionType":"Regular Session","Tags":["Design (UI/UX/CSS)","Mobile"],"Speakers":[{"Id":"ee523a50-fab3-4117-9a75-0f87f71db04e","FirstName":"Kaitlan","LastName":"Chu","GravatarUrl":"//www.gravatar.com/avatar/100a90bb5fb93e23c7f5b376676d7f27"}]},{"Id":2385,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"5 Things I Wish Someone Had Told Me About Programming Before I Started","Abstract":"There's more to being a successful developer than simply being great at programming. The gotchas that slow us down or trip us up are often outside of the code we write, manifesting instead in our process or how we work with our peers. Whether you're new to programming or a veteran of many projects, these 5 things can improve your code, your career, and your team. If you're just starting out, you'll be glad to hear that you frustrations are not unique -- there are strategies for overcoming them. For experienced developers, this talk is a refresher course on what goes into the day-to-day, remind","SessionType":"Regular Session","Tags":["Soft Skills / Business"],"Speakers":[{"Id":"e839ede0-769a-49a7-9119-c724d202ca0f","FirstName":"Kerri","LastName":"Miller","GravatarUrl":"//www.gravatar.com/avatar/f4d5752d6f4f839083cf810ad2c3a911"}]},{"Id":2700,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"8 Simple TDD Rules","Abstract":"After using TDD for over 10 years to build software, I've seen and used every anti-pattern in the book. From brittle tests, over-mocked tests and everything in between.\r\n\r\nTests are supposed to improve maintainability, drive design decision and uncover code smells. Tests can do all these things, but only if we’re writing good tests. In this session, we’ll cover eight simple rules for writing good tests, from what to embrace and what to avoid. Nothing is sacred in this session, as I’ll cover all the ways I’ve failed with testing and where I find success in testing today.","SessionType":"Regular Session","Tags":[".NET","Testing"],"Speakers":[{"Id":"fb46aa8e-e81e-498d-a7d5-638a1c643679","FirstName":"Jimmy","LastName":"Bogard","GravatarUrl":"//www.gravatar.com/avatar/cc359c5ccf90d7a24b5976316797b5ec"}]},{"Id":89,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"A .NET Developers Introduction to MongoDB","Abstract":"This talk will introduce developers to the MongoDB NoSQL platform and explain how it can be utilized as a robust data store alternative for your applications.   We will discuss the concept of NoSQL in general and will walk through the basics of MongoDB and include many demonstrations of reading and writing data to a MongoDB instance via the provided C# drivers.\r\n\r\nThroughout this talk we will compare and contrast the MongoDB concepts with the patterns traditionally followed in relational database systems such as SQL Server or Oracle.   We will also share a significant amount of resources (books, blogs, links, courses, etc) that will make your adoption of MongoDB as easy as possible.\r\n","SessionType":"Regular Session","Tags":[".NET","Cloud/Big Data"],"Speakers":[{"Id":"55ebd8cc-c052-477d-9f27-9359f3ba4d28","FirstName":"Kevin","LastName":"Grossnicklaus","GravatarUrl":"//www.gravatar.com/avatar/61cd10a805f54376bf51e3d38610c420"}]},{"Id":1309,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"A Bird's Eye View of ClojureScript","Abstract":"Birds travel thousands of miles each year to migrate, flying for hours on very little food and rest. By comparison, migrating databases seems like a paltry feat.\r\n\r\nBirdwave is a way to visualize the amazing phenomenon of bird migration. Using ClojureScript and Om allowed the app to be written in a  declarative, concise manner, taking full advantage of JavaScript interoperability, as well as Clojure's awesome built-in features such as persistent data structures and the async module. Also, prepare to be dazzled by the data-viz powerhouse that is D3.\r\n\r\nNo birds were harmed in the creation of Birdwave. Or this talk.\r\n\r\nApp site: http://birdwave.neo.com\r\n\r\nRelated blog posts: http://www.neo.com/2014/04/21/choropleths-and-d3js, http://www.neo.com/2014/07/18/using-the-flickr-api-with-clojurescript","SessionType":"Regular Session","Tags":["JavaScript","Functional Programming"],"Speakers":[{"Id":"dba624b5-f231-40e4-ad9f-9101f8ae15f6","FirstName":"Chandu","LastName":"Tennety","GravatarUrl":"//www.gravatar.com/avatar/27d007e2e1a2bafac9250fcf5dcc3d5b"}]},{"Id":1209,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"A guided tour of the BigData technologies zoo","Abstract":"Elephants (named \"Hadoop\" after a toy), bees and hives, pigs, ELKs, rabbits and one ZooKeeper. You can find them in a zoo, or you are just a software developer trying to make sense out of data using technologies with weird names.\r\n\r\nThis session will be a guided tour of the BigData kingdom. We will explore various challenges one has to face when handling large volumes of data, and learn about various tools with funny names which were built to help in the process.\r\n\r\nEquipped with real-world examples and use-cases, by the end of this session BigData should stop being a buzzword to you.","SessionType":"Regular Session","Tags":["Cloud/Big Data"],"Speakers":[{"Id":"e68e48f1-426a-4812-aa72-f76408b37559","FirstName":"Itamar","LastName":"Syn-Hershko","GravatarUrl":"//www.gravatar.com/avatar/1bd776c3d70cec1b14dbfd6ac97c7810"}]},{"Id":2873,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"A Lap Around the Cloud with Amazon AWS","Abstract":"Coming Soon","SessionType":"Pre-Compiler","Tags":["Cloud/Big Data"],"Speakers":[{"Id":"1c0cadcb-c364-49d4-be90-606a931bac15","FirstName":"Christopher","LastName":"Judd","GravatarUrl":"//www.gravatar.com/avatar/46237da22a99f4aab52e802ea2c0728e"}]},{"Id":2877,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"A Lap Around the Cloud with Microsoft Azure","Abstract":"Coming Soon","SessionType":"Pre-Compiler","Tags":["Cloud/Big Data"],"Speakers":[{"Id":"37ec3662-9d37-469c-855d-6266c714dab5","FirstName":"Mike","LastName":"Wood","GravatarUrl":"//www.gravatar.com/avatar/b9b39ca6817962b90403e34433be32b3"}]},{"Id":63,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Accessible Web Application development using ARIA","Abstract":"WAI-ARIA's role and aria-attributes, combined with the rich capabilities of JavaScript allow rich Internet applications to be made accessible without any limitations for disabled users. \r\n\r\nThis session will explain the relationship between the DOM and the accessibility tree, give an overview of all the ARIA roles and attributes and how adding these to the DOM impacts the accessibility tree.\r\n\r\nIt will highlight the ARIA roles that work well across multiple platforms as well as the tricks necessary to get them to work consistently and cover 5 best practices for successfully implementing ARIA in a cross-platform fashion.\r\n\r\nIt will show an example of a gesture-and-keyboard compatible widget implemented using ARIA with annotated source code available for the attendees to get their hands dirty.","SessionType":"Regular Session","Tags":["JavaScript"],"Speakers":[{"Id":"d833d110-3d44-4b9e-8569-27a3ac2bc72a","FirstName":"Dylan","LastName":"Barrell","GravatarUrl":"//www.gravatar.com/avatar/9a2aeb0fe64defd59981e795de51a465"}]},{"Id":1370,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Adapt your testing approach for agile","Abstract":"Testing in an agile methodology is the responsibility of the whole team. So if you are in an agile team then this talk is for you. To produce good quality software repeatedly and at an ever increasing frequency, means we all (not just testers) need to adapt. Believe it or not you can’t just test faster, but you can make smarter choices. More often than not, you must automate but automation does not solve everything. More fundamental to improving the testing is the techniques you apply in determining what to test. How to test them comes second. This session will cover ways to adapt your approach and offer practical examples of techniques to use to identify the areas to test. It will also cover testing approaches that can then be applied to test the areas identified.","SessionType":"Regular Session","Tags":["Testing"],"Speakers":[{"Id":"0d77e7b9-8315-4197-a135-6091933cbda0","FirstName":"Emma","LastName":"Armstrong","GravatarUrl":"//www.gravatar.com/avatar/113cf25968d18a6ce4f66be22e6a73f8"}]},{"Id":1285,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Adventures Beyond the Page Fold - Exploring UX Mythology","Abstract":"Too often does good UX design fall prey to “conventional wisdom” and an app or website is hijacked by stakeholders way too eager to believe theoretical nonsense, without any credible proof or even their own relevant experience. In this session, we will explore some of the more common pitfalls of UX mythology, from the legendary Adventures Beyond the Page Fold, to The 3 Clicks of Destiny, to The Faceted Navigation of Doom and more! We’ll look at each in turn and determine if each holds true or can be labeled as busted. There will be audience participation and prizes including the latest season of Myth Busters and a copy of Steve Krug’s, Rocket Surgery Made Easy. Armed with the truth, you will be able to reliably defend against the onslaught of poor UX, perpetrated by design-by-committee, and reach true UX harmony.","SessionType":"Regular Session","Tags":["Design (UI/UX/CSS)"],"Speakers":[{"Id":"4163247f-ab54-494e-a2d6-12040f79425b","FirstName":"Benjamin","LastName":"Bykowski","GravatarUrl":"//www.gravatar.com/avatar/be48605fbebdfc63d4b7bda8ec43d62b"}]},{"Id":200,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Adventures in LINQ: party like it's 2007","Abstract":"Think you know LINQ? It's 2015, of course you do... at least, you probably know how to use it... so long as you stick to the standard operators, of course.\r\nBut how does it *really* work? What's lurking beneath the calm surface of lambda expressions?\r\n\r\nLINQ may feel a bit retro now, with C# 6 on the horizon, but it's a fascinating topic to dig into... then dig further... and further.\r\n\r\nThrill to see query expressions converted into normal C#!\r\nSwoon over the complex state machine generated by a simple iterator block!\r\nGasp at the nuances of optimizing lazily-evaluated sequences!\r\nRejoice as your own code extends LINQ to Objects seamlessly!","SessionType":"Pre-Compiler","Tags":[".NET"],"Speakers":[{"Id":"abec4332-6adf-41fe-9e60-0585e2e13bdb","FirstName":"Jon","LastName":"Skeet","GravatarUrl":"//www.gravatar.com/avatar/9e8277f815de909df256027d206ca72a"}]},{"Id":2817,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"An Introduction to Artificial Intelligence","Abstract":"Ever want to know how computers think? In this session attendees will learn the foundations of artificial intelligence through a collaborative discussion centered around the creation of an intelligent game. Attendees will also learn how to use advanced search techniques to solve complex problems using specialized heuristics. In short, attendees will understand how to make intelligent programs by learning how to pose an AI problem in order to maximize desired outcomes.","SessionType":"Regular Session","Tags":[".NET","Other"],"Speakers":[{"Id":"5f356f6a-6477-4bf1-8a87-079c19427699","FirstName":"Seth","LastName":"Juarez","GravatarUrl":"//www.gravatar.com/avatar/cc351a7c1ea116d1400349644ad8d66e"}]},{"Id":1346,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"An Introduction to Rust","Abstract":"Rust is a new systems programming language focused on safety and speed. This precompiler will give you a thorough understandings of the core ideas of Rust, and then move into the more complex parts. Afterward, you should have no problems writing your own Rust programs and libraries.","SessionType":"Pre-Compiler","Tags":["Other"],"Speakers":[{"Id":"40c37623-5dd4-4aaa-bb14-915a933a72de","FirstName":"Steve","LastName":"Klabnik","GravatarUrl":"//www.gravatar.com/avatar/233c279c012ebac792aaa805f966cbc7"}]},{"Id":1375,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Android TDD","Abstract":"There's no reason why Agile practices and Android can't go hand in hand. In this class, learn how to add TDD (test driven development or unit tests) to your next Android project. Thankfully, you no longer have to rely on Google's Unit3 testing framework. The class begins with a look at what tools are available for Unit Testing, Mocking and Code Coverage from ActivityInstrumentationTestCase2 (jUnit3), Roboelectric (jUnit4) to Mockito and Dagger. We'll also create a sample app using Roboelectric and Dagger to show best practices for creating a Test Driven Environment.","SessionType":"Regular Session","Tags":["Mobile","Testing","Java"],"Speakers":[{"Id":"f2dd4f97-cb75-4945-86f0-acab09e79151","FirstName":"Godfrey","LastName":"Nolan","GravatarUrl":"//www.gravatar.com/avatar/e5276749bea799a329ba8c97c87addb1"}]},{"Id":2565,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Angular for .NET Developers","Abstract":"As software developers we should always be striving to give our users the best experience possible. It should be intuitive, responsive and above all fast! With traditional web technologies, creating applications that appear “fast” to the users can be difficult. To solve this problem developers have been finding new and creative ways to leverage the browsers client-side functionality. One of the most popular frameworks for creating a web application with powerful client-side front end functionality is Angular. Angular is a powerful client side data framework that lets you bind and manipulate data easily in a way that seems lightning fast to your users. And the best part is you don’t need to be a JavaScript ninja to use it! This session will show you how to leverage Angular with your ASP.NET MVC application to create applications that your users will love and you’ll love to build.","SessionType":"Regular Session","Tags":["JavaScript",".NET"],"Speakers":[{"Id":"3ced0b93-06e0-42e0-be28-f1267bcaf0a4","FirstName":"James","LastName":"Bender","GravatarUrl":"//www.gravatar.com/avatar/25ddbfa83fef9e5f8f1e15c73d1de9e1"}]},{"Id":1391,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Angular's Missing Guide: Build Anything With These 5 Concepts","Abstract":"AngularJS empowers developers by providing the means to rapidly create rich user experiences, but its API is massive and you're busy. This session teaches the 5 concepts that you need to get productive in Angular, fast:  ng-controller, ng-repeat, ng-model, ng-click, and filter. You'll then see how they're used together by exploring realistic and approachable code examples. \r\n\r\n\r\nAttendees will walk out of this session with the tools needed to ship engaging, interactive, websites.","SessionType":"Regular Session","Tags":["JavaScript"],"Speakers":[{"Id":"55051bcd-69d3-487e-822d-9025cf3b0c86","FirstName":"Zach","LastName":"Briggs","GravatarUrl":"//www.gravatar.com/avatar/dfe1da2a83fe42aa8a07df1f0071becb"}]},{"Id":190,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Are You Over-Testing?","Abstract":"What is your code coverage? Why not 10% more or less? Is testing this feature more important than shipping the next? Many teams spend too much time and energy on testing the wrong things. In this session, an enterprise developer turned startup entrepreneur will dive into the costs and benefits of testing. You will learn about the organizational and social dynamics that drives teams to over-test. You will come away armed to convince your team, your manager, and your business to ship more and maximize test value. Check your dogma at the door and let's ship some valuable software. ","SessionType":"Regular Session","Tags":["Testing"],"Speakers":[{"Id":"6194005a-43b6-4511-9dde-97d6fa8c069a","FirstName":"Todd","LastName":"Gardner","GravatarUrl":"//www.gravatar.com/avatar/2c872fec31c4eb3fcf8229bef0cce42d"}]},{"Id":2778,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"ASP.NET is Coming to an OSX Near You","Abstract":"Do you wish you could use OSX for ASP.NET development? Interested in exploring the .NET web frameworks, but are adverse to installing Windows and Visual Studio? Do you judge Mono as a less-than-ideal port of the .NET framework? Everything has changed: ASP.NET isn’t just for Windows, anymore. Learn how ASP.NET has broken free from Windows and has turned into a cross-platform, OS-agnostic framework. Develop ASP.NET applications on your OS, with your editor, in your way. No more compromises, no VMs, no workarounds: ASP.NET is coming to an OSX near you.","SessionType":"Regular Session","Tags":[".NET"],"Speakers":[{"Id":"e603adc3-e5a3-478f-895b-8229fafebfd3","FirstName":"Jay","LastName":"Harris","GravatarUrl":"//www.gravatar.com/avatar/1318668b99b2d5a3900f3f7758763a69"}]},{"Id":185,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"ASP.NET Performance Tips and Tricks","Abstract":"Out of the box, ASP.NET can do a lot of amazing things.  The tools and framework have grown to make mundane tasks, such as minification, simple to implement.  Many times by using the framework as we were taught, opportunities to optimize pass us by.  The reality is that underneath the covers, there is a whole world of easy tweaks we can implement to help ASP.NET perform at its peak.  \r\n\r\nIn this presentation, we will walk through a slew of tweaks used to make ASP.NET perform in the best way possible. You will leave with a checklist of tasks that will instantly improve the performance of your web application!","SessionType":"Regular Session","Tags":[".NET"],"Speakers":[{"Id":"3031a702-0f2d-4847-bae0-5761df2f571c","FirstName":"Kevin","LastName":"Griffin","GravatarUrl":"//www.gravatar.com/avatar/11ce7889cfbdc9af46389f2c7e3ff015"}]},{"Id":2521,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Async JavaScript at Netflix","Abstract":"What's does a mouse drag event have in common with an Array of numbers?\r\n\r\nThe answer to this question may surprise you: they are both collections. This key insight holds the key to dramatically simplifying asynchronous programming in JavaScript. In this talk you will learn how you can use the familiar JavaScript Array methods to create surprisingly expressive asynchronous programs. Using just a few functions, you will learn how to do the following:\r\n• Declaratively build complex events out of simple events (ex. drag n' drop)\r\n• Coordinate and sequence multiple Ajax requests\r\n• Reactively update UI's in response to data changes\r\n• Eliminate memory leaks caused by neglecting to unsubscribe from events\r\n• Gracefully propagate and handle asynchronous exception\r\n \r\nIn this talk we'll be exploring the Reactive Extensions (RxJS) library (http://github.com/reactive-extensions/RxJS), which allows us to treat events as collections. You'll learn about how Netflix uses Rx on the client and the server, allowing us to build end-to-end reactive systems. We'll also contrast Rx with Promises, another popular approach to building asynchronous programs in JavaScript.","SessionType":"Regular Session","Tags":["Mobile","JavaScript","Functional Programming"],"Speakers":[{"Id":"41d5aac4-a53f-4304-9303-feee91c934bf","FirstName":"Matthew","LastName":"Podwysocki","GravatarUrl":"//www.gravatar.com/avatar/174252c83d38873e74de232f58717fd7"}]},{"Id":209,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Asynchronous? Parallel? Reactive? Help!","Abstract":"The modern world of concurrency can certainly be confusing! This talk is a gentle introduction to the many forms of concurrency. In this talk, you'll learn which types of concurrency are appropriate for which scenarios.\r\n\r\nMost developers have heard of parallelism, so this talk starts with parallel computing, showcasing the Parallel class and Parallel LINQ (PLINQ).\r\n\r\nThe next stop is asynchronous code. Asynchronous code is a totally different kind of concurrency than parallel processing, and the async and await keywords enable maintainable asynchronous code in modern applications.\r\n\r\nThis talk will also introduce you to TPL Dataflow. A beautiful mix of parallel and asynchronous techniques, TPL Dataflow is a little-known but extremely powerful library.\r\n\r\nThe last technology covered is Reactive Extensions. This talk will cover the concepts behind Rx and the most useful operators. This session is entirely practical; the phrase \"mathematical dual of IEnumerable\" does not appear on any slides.\r\n","SessionType":"Regular Session","Tags":[".NET"],"Speakers":[{"Id":"725a9289-2455-42f3-92b1-4b227319595b","FirstName":"Stephen","LastName":"Cleary","GravatarUrl":"//www.gravatar.com/avatar/3db7b6e14d9da42751e4bab03bc4d034"}]},{"Id":1384,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Attack of the clones: Eliminating duplicate code in .NET","Abstract":"Code duplication threatens the agility and maintainability of software.  Literally repeated code can be easily remedied, but there are other more subtle and insidious kinds of code duplication.  What about code that's the same except for type, or code that needs to be applied in many locations?  In this session, you will learn about tools to help find duplicate code.  After identifying problem code, you will learn how to eradicate it with software design techniques and .NET framework features.  Specifically, you will see how to apply generics, delegates, extension methods, and attributes to quash repeated code. You will leave with ideas and techniques to reduce duplicated code in your development.\r\n","SessionType":"Regular Session","Tags":[".NET"],"Speakers":[{"Id":"9f3c9092-8924-4a5d-83da-c3ad58dc0eba","FirstName":"Joe","LastName":"Wirtley","GravatarUrl":"//www.gravatar.com/avatar/cf6b28cfe39c5f39a6d3dc7b52f53a2d"}]},{"Id":2644,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Automated Testing and Processes for your iOS Agile Team","Abstract":"Let’s explore how Continuous Integration combined with Automated Acceptance Testing can be integrated into an iOS Mobile Developer Team’s Agile process. The integration is intended to improve code quality and increase project margin. We will investigate how Apple Development build tools, combined with Objective-C/Swift Open Source projects, combined with Jenkins CI, can make an iOS Native Mobile Developer’s dream setup come true. We’ll show how when you combine all this, you can release faster, strong and more often.  Bring your own Mac and Xcode. Slides, sample code, and fun will be provided. Be sure you're registered for Github too.","SessionType":"Regular Session","Tags":["Mobile","Testing"],"Speakers":[{"Id":"63bc94b2-39f9-4bd7-9545-e155cf49d6b9","FirstName":"Shane","LastName":"Zatezalo","GravatarUrl":"//www.gravatar.com/avatar/f337be065c948a1a8913e2058efcf9eb"}]},{"Id":1262,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Automating Visual Studio ","Abstract":"The automation story for Visual Studio reads something like a Greek tragedy: mechanisms for automation have born and died, and none of them have been terribly effective.  However, over the last few years the story has changed.  Come learn how to drive Visual Studio from technologies you already use, such as NuGet packages and the package manager console.  You’ll be delighted and inspired by the demos, which include scripting out project creation and configuration, adding custom menu items across the IDE, and a data-driven refactoring of code.  Warning: attending this session will absolutely change the way you use Visual Studio – for the better!","SessionType":"Regular Session","Tags":[".NET"],"Speakers":[{"Id":"96197ab2-0cec-464a-a625-9b443c44c465","FirstName":"Jim","LastName":"Christopher","GravatarUrl":"//www.gravatar.com/avatar/176c5e601d4976378e18b9215927211a"}]},{"Id":2405,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Automating Your Azure Environment","Abstract":"Like most things in life, there’s the easy way and the hard way.  The same holds when working in cloud environments such as Microsoft Azure.  The Azure management portal and Visual Studio can be great for those relatively simple projects, but quickly become very tedious when trying to create the multiple re-sources that often make up a real-world solution.  In this session, we’ll demonstrate how to leverage various tools such as PowerShell, Azure Resource Manager, Azure Automation, and the Azure Management Library to quickly and consistently create full environments in minutes.","SessionType":"Regular Session","Tags":[".NET","Cloud/Big Data"],"Speakers":[{"Id":"96610734-4656-4554-8825-711dff500e4a","FirstName":"Michael","LastName":"Collier","GravatarUrl":"//www.gravatar.com/avatar/88bb040bfe336c9ccec0f24f706ca109"}]},{"Id":1376,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Automotive Android","Abstract":"Over the last year, many Automotive companies have released SDKs and APIs and Google have announced Automotive Android that finally allow Android developers to create their own mobile automotive apps that expand the boundaries of the automotive dashboard far beyond the physical car. \r\n\r\nIn this class, you'll learn how to create apps for this new and relatively overlooked commercial opportunity for mobile developers. We'll also build a couple of sample apps that focus on how communicate with Ford's Sync and GM's Remote APIs .","SessionType":"Regular Session","Tags":["Mobile","Java"],"Speakers":[{"Id":"f2dd4f97-cb75-4945-86f0-acab09e79151","FirstName":"Godfrey","LastName":"Nolan","GravatarUrl":"//www.gravatar.com/avatar/e5276749bea799a329ba8c97c87addb1"}]},{"Id":2848,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Be proactive, use reactive!","Abstract":"Today‘s apps contain a lot of moving parts, and juggling this complexity is what makes or breaks the user experience. In order to keep our sanity and reduce the amount of bugs that get shipped, we need to raise our level of abstraction.\r\n\r\nReactiveCocoa (RAC) is a framework that brings the (functional) reactive programming world into the grossly imperative land of iOS. It builds off of Cocoa's own key-value observing mechanism to provide a high-level, declarative API for composing operations on streams of data, state, and asynchronous tasks. You’ll leave this session with a solid foundation of RAC and how one can apply it in conjunction with powerful tools like MVVM to build applications.","SessionType":"Regular Session","Tags":["Mobile","Functional Programming"],"Speakers":[{"Id":"f651be9d-2e2f-4eeb-8c19-b499517851c7","FirstName":"Andrew","LastName":"Sardone","GravatarUrl":"//www.gravatar.com/avatar/f3c52a0537360c85b46e043711cab0c6"}]},{"Id":2528,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Being RDBMS Free","Abstract":"The general thinking is that when you create a new application, your data will be persisted into an RDBMS like SQL Server. But with the advent of NoSQL solutions, document databases, key-value stores and other options, do you really need an RDBMS for your application? In this session we’ll look at some alternatives to your persistence solution by looking at utilizing NoSQL solutions like Mongo, search services like Solr, key-value stores and other approaches to data persistence. By the end of this session, you’ll rethink how your applications will store data in the future.","SessionType":"Regular Session","Tags":[".NET","Cloud/Big Data"],"Speakers":[{"Id":"7c549c7b-06a8-4d9a-9c06-5103451cbdae","FirstName":"David","LastName":"Hoerster","GravatarUrl":"//www.gravatar.com/avatar/a007ab3dc89f80c08655bc626fb37fc7"}]},{"Id":2594,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Better Code, Better Debugging","Abstract":"Our platforms and development environments keep offering better debugging support, but debugging is still a game of strategy. It’s a critical game because we fix bugs from the time we first check in code, and the cost of each bug tends to increase across the project lifecycle. Come to this talk to merge strategy with the debugging tools in your environment. In the examples, you’ll see debugging features in the current version of Visual Studio and upcoming in Visual Studio “14,” along with Windows features like ETW (Event Tracing for Windows). Good debugging strategies let you ask better questions and tools offer an array of tactics to efficiently answer most questions.  Strategies and tactics differ a bit depending on the difficulty of the bug and where you can reproduce it. If it occurs only in production and remote debugging is not possible in your scenario, you’ll debug through piles of information. Find out what Windows can provide for you, without changing your application, and small changes to your application that increase the value of this information. Leave this talk ready to formulate ideas into testable strategies you can execute to resolve bugs faster and with more confidence. ","SessionType":"Regular Session","Tags":[".NET"],"Speakers":[{"Id":"0858d0e5-564d-494d-aed6-8d5f744ebe37","FirstName":"Kathleen","LastName":"Dollard","GravatarUrl":"//www.gravatar.com/avatar/85ffa8bf46389d3c399196f3497bd626"}]},{"Id":2723,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Beyond UI Frameworks: The Good, the Bad, and the Ugly","Abstract":"UI frameworks like Bootstrap or Foundation have a lot of perks: cross-browser consistency, ease-of-use, and visual design standards to name a few. However, they can be difficult to integrate into existing web applications in organizations with specific UI/UX vision. In this session, we will discuss our use case of building a custom UI framework named CoreUI at OCLC while working on WorldCat.org and WorldCat for local institutions. We will show the good (why and how we built it), the bad (roadblocks and traps to avoid), and the ugly (convincing a large organization) of building a custom framework. Attendees will get insight into our process, cross-disciplined approach and tools we used to build a true UI style guide; not just a UI framework. We will share concrete examples of how we built strict guidelines yet a flexible framework, maintained an encapsulated, non-intrusive code base and ensured code quality with builds, and produced a tiny framework size in the end.","SessionType":"Regular Session","Tags":["Design (UI/UX/CSS)","Mobile","JavaScript","Java"],"Speakers":[{"Id":"057d36fa-1206-4ba8-8b32-cf24ed598f18","FirstName":"Hany","LastName":"Elemary","GravatarUrl":"//www.gravatar.com/avatar/7e510e5afa11ae82b12d71448aeff2ab"}]},{"Id":1277,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Break It Before You Buy It - Hacking and Fixing Web Applications","Abstract":" As developers, we focus on the utility and usability of the systems we build, as we should. There is another consideration, though, and that is the criminal element and its access to our systems. The most utile and usable system is dangerous to deploy without appropriate security controls in place. In this four hour bootcamp, you'll get a look at the security principles that will keep your systems more secure, learn to test for specific vulnerabilities, and put your new skills on the line using Burp Suite in a Capture The Flag competition that will run the entirety of CodeMash. The session will cover Authentication and Content Management, Injection Vulnerabilities, Cracking and Fixing REST APIs, and Data Security. This is a hands on session, so make sure to download the Virtual Machine at CodeMashCTF.com, or from the CodeMash FTP Server.","SessionType":"Pre-Compiler","Tags":["Security"],"Speakers":[{"Id":"6c93046b-12e1-46c2-988c-8cb1fe20654c","FirstName":"Bill","LastName":"Sempf","GravatarUrl":"//www.gravatar.com/avatar/54322397338e0d9cde1d7b61391f72d1"}]},{"Id":1310,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Build Right: Frontend Testing","Abstract":"Frontend projects are becoming more and more complex, pushing greater rules and requirements into the browser. We expect a lot from modern web applications (many run entirely in the browser), but we’re rarely writing tests to verify that our high expectations are met.\r\n\r\nCome explore the magical world of Frontend Testing with the Sparkbox team. Together we will examine the pain points of developing without tests and look at some of our real-world examples. We’ll also talk about what you should and shouldn't test, and get our hands dirty with...\r\n\r\n- Jasmine / CoffeeScript\r\n- Automating tests in the build process\r\n- Adding tests to existing code\r\n- Refactoring jQuery spaghetti\r\n- Handling AJAX requests and Promises\r\n- Coding for better tests\r\n- Running tests in a CI build\r\n\r\nPrepare to receive the tools and techniques to build solid, tested frontend code. And don't worry—we'll talk about selling the concept to your team back home and gradually work it into your process.\r\n","SessionType":"Pre-Compiler","Tags":["JavaScript","Ruby/Rails","Testing"],"Speakers":[{"Id":"e6e46060-6998-40df-bfff-e4be13b90b5f","FirstName":"Ryan","LastName":"Cromwell","GravatarUrl":"//www.gravatar.com/avatar/32de0bd2ba869609d26fd052a4622778"},{"Id":"d57f6eb9-ed8d-461e-b0bb-2867c6319424","FirstName":"Rob","LastName":"Tarr","GravatarUrl":"//www.gravatar.com/avatar/1ac0c8579c9d099b98b8eee3e9b9449a"}]},{"Id":2800,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Building Code Aware Frameworks using the .NET Compiler Platform (“Roslyn”)","Abstract":"Now that you’ve seen how to take advantage of what’s new in C# as a consumer, come learn how to leverage the .NET Compiler Platform to transform your library into Code Aware Framework.  This session will demonstrate how to help users of your library avoid common misuses of your API by implementing a user diagnostic which runs as part of the compilation process for anyone who references your NuGet package and is reported live in Visual Studio.  Next we’ll extend the VS “14” experience with an automated fix to get your users back on track.  If you develop library code for .NET, either public or for your own company, come see how to take them to the next level by turning them into Code Aware Frameworks.","SessionType":"Regular Session","Tags":[".NET"],"Speakers":[{"Id":"667546ff-bd95-4b19-95ea-0955c07cf878","FirstName":"Kevin","LastName":"Pilch-Bisson","GravatarUrl":"//www.gravatar.com/avatar/9dff567da4fa98b3c190fded0b869739"}]},{"Id":187,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Building Custom node.js Modules","Abstract":"The growth of node.js can solely be placed on it's community, and their ability to develop modules when a need arises. Developers constantly see ways they can abstract their code bases out into individual modules, which node.js has fantastic support for. In this presentation, Kevin Griffin will guide attendees through the process of creating a node module and distributing it in the Node Package Manager central repository.\r\n\r\nLearning Objectives\r\n\r\nAttendees will learn what the Node Package Manager and public vs private repositories.\r\nAttendees will learn how to develop their own node modules and how use them in their applications.\r\nAttendees will learn how to upload their modules to the central NPM database for public consumption.","SessionType":"Regular Session","Tags":["JavaScript"],"Speakers":[{"Id":"3031a702-0f2d-4847-bae0-5761df2f571c","FirstName":"Kevin","LastName":"Griffin","GravatarUrl":"//www.gravatar.com/avatar/11ce7889cfbdc9af46389f2c7e3ff015"}]},{"Id":29,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Building DSLs using JavaScript/CoffeeScript","Abstract":"Web developers are integration specialists; tying plugins, scripts and frameworks together into a web application that works. Thinking in terms of abstractions, by condensing many low-level ideas into fewer high-level ideas, allows us to simplify our code and reason about it with less cognitive overhead.\r\n\r\nIn this session we will examine a few techniques for building abstractions on top of popular JavaScript frameworks by building a Domain Specific Language and bringing some convention to our code.","SessionType":"Regular Session","Tags":["JavaScript"],"Speakers":[{"Id":"6961fce4-af8e-4552-b7da-3571ee1a256a","FirstName":"David","LastName":"Mosher","GravatarUrl":"//www.gravatar.com/avatar/ead076bf445f9b50e3c094300e4690e9"}]},{"Id":88,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Building Highly Scalable Apps on the Azure Platform:  Real World Guidance","Abstract":"While many talks provide a high level overview of a few components of the Azure platform, this session will provide real-world examples of how we utilize Azure on real-world, highly scalable applications.\r\n\r\nKey areas we will demonstrate and discuss include:\r\n\r\n•\tGeneral scalability and moving a heavy amount of workload off the web servers\r\n•\tUsing the Azure Service Bus to communicate between our front-end web servers and our back-end worker roles\r\n•\t Azure’s caching options and how we utilize them to serve a significant amount of data to clients out of memory and to support things such as ASP.NET Session State.\r\n•\tUsing Blob Storage as an effectively unlimited amount of file storage.\r\n•\tOur usage of newer features such as the scheduler, mobile notifications, and auto scaling.\r\n•\tOur development and deployment process surrounding Azure based applications\r\n\r\nThis session, while only an hour long, will walk through a lot of code and tooling to show how we have leaned on Azure to solve a number of architectural headaches.\r\n\r\nIf you are using (or considering using) Azure as the foundation for your own applications, this session would be a great place to get ideas on where you should start.\r\n","SessionType":"Regular Session","Tags":[".NET","Cloud/Big Data"],"Speakers":[{"Id":"55ebd8cc-c052-477d-9f27-9359f3ba4d28","FirstName":"Kevin","LastName":"Grossnicklaus","GravatarUrl":"//www.gravatar.com/avatar/61cd10a805f54376bf51e3d38610c420"}]},{"Id":1292,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Building the Internet of Things... with JavaScript?","Abstract":"The internet of things revolution is coming.  Are you ready for the onslaught of smart devices that is right around the corner?  As developers, the more important question is, are you ready to be a part of contributing to the internet of things?  The barrier to entry is now lower than ever - the Tessel board from Technical Machine (tessel.io) allows you to control hardware with JavaScript running in node.js on the embedded chip!  Yeah - JavaScript.  In this session, I'll give you an overview of the Tessel board and many of the modules available to build the next generation of smart devices.  You'll be surprised how easy it is.\r\n","SessionType":"Regular Session","Tags":["Hardware","JavaScript"],"Speakers":[{"Id":"7d6f5121-3399-4482-9840-e2011bd1e46f","FirstName":"Adam","LastName":"Barney","GravatarUrl":"//www.gravatar.com/avatar/4eeb4579d42156861b31c22643613dd9"}]},{"Id":2511,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Building with Web Accessibility in Mind","Abstract":"Building web applications so that they are accessible to people with disabilities is easy. Yet many web developers don't spend the extra time to do it right. It is estimated that as many as one in five people have some sort of disability or impairment. Regardless of the purpose of the application this is essential to consider.\r\n\r\nThis session will include an in-depth discussion of web accessibility guidelines and standards following the WCAG 2.0 specification.  It will also focus on a how-to for actually implementing these guidelines and building them into the UI of any web-based application. The web developer that is already skilled in HTML, CSS, and JavaScript, will learn practical coding techniques to make their applications accessible to all.","SessionType":"Regular Session","Tags":["Design (UI/UX/CSS)","JavaScript"],"Speakers":[{"Id":"a6bec37c-9939-41a9-93e4-6b3f8a9e55ce","FirstName":"Bobby","LastName":"Whitman","GravatarUrl":"//www.gravatar.com/avatar/1caa69e97547306f38c792b705afdb9a"}]},{"Id":158,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Building Your First Android Wear App","Abstract":"With the introduction of Google's Android Wear, you are no longer restricted to just phones and tablets when it comes to developing great Android apps. You want notifications on your wrist? You got it. You want to run an app on your wrist? You got it. In this session, let me take you through the awesome new features of Android Wear and the tools required to start building the apps you want for Wear. We'll extend a current app with rich notifications and even create a brand new app from scratch live on stage that runs right on your Android Wear device. All demonstrations will be coded in C#, but will be applicable to any Android developer in any language.\r\n","SessionType":"Regular Session","Tags":["Mobile",".NET"],"Speakers":[{"Id":"4a918c84-78ef-4097-be44-b2862be609d5","FirstName":"James","LastName":"Montemagno","GravatarUrl":"//www.gravatar.com/avatar/5df4d86308e585c879c19e5f909d8bfe"}]},{"Id":1374,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Bulletproof Android","Abstract":"This session takes a look at Android security from a developer rather than a hacker's perspective.  Taken from the soon to be published book Bulletproof Android, we look at how to protect your Android code, how to use secure authentication in your app, how to communicate securely with any backend server and how to safeguard that server against attack. Throughout the session we'll use real world examples from the many audits we've done over the years to show how other developers have tried and sometimes failed to secure their code.","SessionType":"Regular Session","Tags":["Mobile","Security","Java"],"Speakers":[{"Id":"f2dd4f97-cb75-4945-86f0-acab09e79151","FirstName":"Godfrey","LastName":"Nolan","GravatarUrl":"//www.gravatar.com/avatar/e5276749bea799a329ba8c97c87addb1"}]},{"Id":2758,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Business Scale Rails with Docker","Abstract":"In recent years, most Rails developers have usually used go-to services for going from git push to code being on production. As developers and operations staff we sometimes find ourselves with infrastructure and code bases growing under our feet and in our sleep and sometimes managed services stop meeting the needs of a business or project. \r\n\r\nOnce your business grows to the point where you have dedicated Sales, QA, and Growth departments, how do you manage to keep all the environments for everyone in check? When your bundling and asset compilation takes 30 minutes, how do you get hot fixes out in any reasonable amount of time? When your dev staff is distributed, how can you ensure everyone has access to the proper environment, and more importantly, that they don't have potentially destructive powers in places they shouldn't?\r\n\r\nWe've struggled with each of these questions, and after a lot of trial and error, ended up on a Docker based build and deploy system that accelerated our build times, time through CI, QA deploys, and general time to production with little to no downtime. We've also been able to deploy the same applications for demo use offline, quickly scale applications in the case of emergency, provide developer safe security, and a whole lot more\r\n\r\nIn this talk we'll talk about Rails-specific practices for building your app into a Docker image and what benefits you get immediately from that alone. Then we'll talk about how you can use that image through the rest of your dev process cycle to get the ease of use of a managed service with the freedom to use your container as you please. ","SessionType":"Regular Session","Tags":["Ruby/Rails"],"Speakers":[{"Id":"e8288715-7e72-4d34-a957-74aa0d90ee5f","FirstName":"Michael","LastName":"Danko","GravatarUrl":"//www.gravatar.com/avatar/6489f517b0bd2c63487d0b1a65665d5f"}]},{"Id":2674,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"BYOD : build your own drone... multi-rotor copter that is !","Abstract":"In this world of ever increasing opportunities to purchase 'toys' classified as 'drones'... have you ever wanted to fly a drone?  Have you ever asked yourself the question... should I buy a drone or build?\r\n\r\nThis presentation will discuss why the term 'drone' should be most generally referred to as... 'multi-rotor copter' and not UAV (unmanned autonomous vehicle) or drone.  \r\n\r\nThis presentation will discuss the basics of how a multi-rotor works... the steps to build a multi-rotor... including details on flight controllers, frame selection, motors and props (including determining what type of multi-rotor will suite your purpose), speed controllers and batteries.  There are a lot of variables... all of these details will be broken down, making the process of building your first copter a 'flight in the park'.\r\n\r\nAt the end... a flying multi-rotor copter will be air-worthy and demonstrated.","SessionType":"Regular Session","Tags":["Hardware"],"Speakers":[{"Id":"fe140c90-c0ae-4990-aa8b-5144f80ae97f","FirstName":"DJ","LastName":"Daugherty","GravatarUrl":"//www.gravatar.com/avatar/5b94381f39bad8b12cf18e07ef43bea2"}]},{"Id":2501,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Callback-free concurrency: Elixir vs. Node","Abstract":"Tired of callback hell and fighting with the event loop? Node.js is a popular choice for building real-time applications, but it comes with some serious drawbacks. Elixir, a new functional language targeting the Erlang VM,  promises to combine the stability and scalability of Erlang with the expressiveness of Ruby. In this session, two implementations of the same real-time application will be compared: one written in Node.js and one written in Elixir. You will learn how Node and Elixir solve the same problems in very different ways, and see how Elixir enables massive concurrency and fault tolerance with code that is callback-free, concise, testable, and easy to reason about.","SessionType":"Regular Session","Tags":["JavaScript","Ruby/Rails","Functional Programming"],"Speakers":[{"Id":"f93842b8-3b84-4ccc-ab41-04c794f57743","FirstName":"Chris","LastName":"Geihsler","GravatarUrl":"//www.gravatar.com/avatar/13b4e3d56b4baefd517719fcb0d7fb9b"}]},{"Id":2421,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Changing the Testing Culture","Abstract":"Testing is often seen as an uninteresting, boring and mundane activity done by unskilled people; why is this? Why have I found it difficult to explain to a lay person what my job is? Being able to explain testing in an interesting way and how it’s rewarding and challenging is a difficult task. The main issue, as I see it, is that testing is not a recognised career choice; most people drop in to testing and either stay or move on. \r\n\r\nHow do we get people to see that testing is a rewarding and challenging career choice? From my experience of over seventeen years, I've encountered a varied collection of opinions about testing and testers; a significant number have been negative. \r\n\r\nTo change these negative opinions of what testing and testers are we need to change the culture within our workspace. By reframing testing as a science and constantly challenging status quo ideas that others may have of testing is a powerful way to start the evolution from testing as a role to testing as an activity that everyone is involved with. Thereby changing from testing at the end of a broken chain to one whereby testing is done throughout the development process.\r\n \r\nConsidering testing as a science and explaining how you approach testing using the scientific method, in my experience, helps significantly with this paradigm shift. Testing is a science, and just like science, testers often don't have all the information and have to use their curiosity, imagination, intuition and experience of the world to find problems so that users don’t.\r\n\r\nChanging the language, from one with words like pass, coverage, test cases and move towards talking about what you know to be true now, based on evidence and experiments. Don't assume, never say never or other definitive words. Correct others appropriately when they say things like always, I'm sure it will, definitely, must, should, yeah of course it'll do that.\r\n\r\nIn my experience, these two simple changes have worked to improve people’s opinions of testers and testing. I will be using specific examples that I have experienced to show how I have used these and other approaches to change the cultural opinion of testing.","SessionType":"Regular Session","Tags":["Testing"],"Speakers":[{"Id":"fcc8aca2-899e-445d-8124-2611c364be30","FirstName":"Stephen","LastName":"Blower","GravatarUrl":"//www.gravatar.com/avatar/8bfbb865562726ae4a05caf1d0b4727b"}]},{"Id":2651,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Chat Robots Next Level Tooling","Abstract":"**Developers are lazy!** So we are great in creating tooling for our daily work. But it has its weaknesses, we are creating a tons of scripts on our local machine, sometimes we share them via git or other vcs systems. But all over all this tooling sucks when it comes to collaboration. We developers also love hanging out in chat rooms like campfire or jabber.\r\n\r\nWhy not combine this via chat robots. Our tooling would be available to everyone without installing wired shell scripts plus we can get rid if questions like: `“Do you have the deploy lock?”` or `“Did you already migrate the database?”` - it’s all documented in the transcripts.\r\n\r\nI’d like to talk about how to improve your daily work with [hubot](http://hubot.github.com/), a chat robot build by the fine folks at github.","SessionType":"Regular Session","Tags":["JavaScript","Other"],"Speakers":[{"Id":"d2d57573-e595-4a3f-8c3c-21b13402edc4","FirstName":"Ole","LastName":"Michaelis","GravatarUrl":"//www.gravatar.com/avatar/4c50caee0c6a446a0b60f827a2a1e5e5"}]},{"Id":60,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Clean Code: Writing Code for Humans","Abstract":"Anyone can write code a computer can understand, but professional developers write code *humans* can understand. This session discusses best practices for writing code in a style that’s easy to create, maintain and understand. We have a lofty goal: programming style as documentation. We’ll discuss concrete methods to get you there and give you a vocabulary for pragmatically evaluating code quality.\r\nVarious refactoring techniques, code smells, best practices are discussed including fail fast, return early, arrow code, being “stringly typed”, the outline rule, and table-driven methods. Part of this session involves refactoring a confusing and ugly chunk of code into something beautiful, easy to read and maintain. While examples are in C#, coders in any language should be able to follow along and apply the principles discussed.","SessionType":"Regular Session","Tags":[".NET"],"Speakers":[{"Id":"1530aa67-88e9-460e-8e9c-c79de577508c","FirstName":"Cory","LastName":"House","GravatarUrl":"//www.gravatar.com/avatar/09e16ce7b4bc21025c9940f5a167cfa9"}]},{"Id":1248,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Coming up to speed on Swift","Abstract":"Discover Swift, the new programming language from Apple. By examining and modifying a real iOS app, learn how it compares and contrasts with more established languages like JavaScript, C#, Python, and Objective-C.  Begin the journey towards mastering Swift; seize on its possibilities and avoid its pitfalls.","SessionType":"Regular Session","Tags":["Mobile"],"Speakers":[{"Id":"d02d6328-9107-44a6-92fe-0c7f9c45bcc0","FirstName":"Ravi","LastName":"Desai","GravatarUrl":"//www.gravatar.com/avatar/d4fede378d3c469dfb90bca4009e14a3"}]},{"Id":195,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Composing a Compiler","Abstract":"Composition is powerful. Consider any artistic endeavor; any style of music, art, photography, etc. Creativity thrives on composition. The bringing together of various elements into a complementary whole. Carefully selected, simple pieces assembled with skill and insight can yield breathtaking complexity and beauty.\r\n\r\nYet composition s not widely used as a paradigm in creating software today. While it sounds nice in theory to write small, simple, and correct pieces of code and then plug them together, there is little in the way of practical examples to show how it's done. With practice, designing for composition can become second nature.\r\n\r\nThis talk will use the problem of writing a Clojure-to-C compiler as an example. A full explanation of the process, with code, will demonstrate how to accomplish this in Clojure while the concepts will be applicable to any functional programming language.","SessionType":"Regular Session","Tags":["Functional Programming"],"Speakers":[{"Id":"f4ee9fc6-7ed1-4adc-8eab-d8cc8b455709","FirstName":"Jim","LastName":"Duey","GravatarUrl":"//www.gravatar.com/avatar/e0731cde23f6de1006979c12551d1860"}]},{"Id":2384,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Concurrency for !Dummies (Who Don't Get It (...Yet))","Abstract":"You can't go to a Ruby conference lately without someone banging on about concurrency and thread safety. You're a smart Rubyist, but... you don't get it. You understand the basic idea, you nod along, but once they get into the jargon, what does it all mean? How does it apply to you, and what is it, exactly? This talk will answer those questions, by engaging in a basic primer on concurrency in Ruby, a discussion of actual examples of how it works, and provide you with answers that will leave you nodding in agreement, rather than nodding off.","SessionType":"Regular Session","Tags":["Ruby/Rails"],"Speakers":[{"Id":"e839ede0-769a-49a7-9119-c724d202ca0f","FirstName":"Kerri","LastName":"Miller","GravatarUrl":"//www.gravatar.com/avatar/f4d5752d6f4f839083cf810ad2c3a911"}]},{"Id":1356,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Connecting C# to Arduino and the world outside your computer","Abstract":"C# is a great language, but our C# code is confined inside of our computers. What do we do if we want to control a motor or display information on an analog gage? We can use the C#, ScriptCs and the ScriptCS-Arduino library to interface with the world outside of the computer. In this session you will learn how to get started.","SessionType":"Regular Session","Tags":["Hardware",".NET"],"Speakers":[{"Id":"c36104f1-e8d2-43b7-a5e2-5d721727a516","FirstName":"Eric","LastName":"Potter","GravatarUrl":"//www.gravatar.com/avatar/eca8c218581c34e426f56afa570de637"}]},{"Id":31,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Consuming Data with F#'s Type Providers","Abstract":"Have you ever needed to access a data source in your application? Trick question! Are there developers who would answer no to that question? Of course not! Join me and I'll walk you through just how quick and easy data access can be with F#'s new Type Providers. I'll cover connecting to several different data sources using the relevant type providers, as well as when and how to write your own. Before we part, you'll be on your way to type provider mastery! ","SessionType":"Regular Session","Tags":[".NET","Functional Programming"],"Speakers":[{"Id":"777f620d-0b1a-4ace-90d6-b8d2996aaf32","FirstName":"Rachel","LastName":"Reese","GravatarUrl":"//www.gravatar.com/avatar/d760ba4eb702da0bbe285df91b75bcad"}]},{"Id":2609,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Control your computer with your Brain!","Abstract":"In this session we'll explore the OpenBCI (Open Brain Computer Interface), Arduino compatible, board. This board allows sampling of brain activity (EEG). Using these samples, we can make use of them for control of other devices.","SessionType":"Regular Session","Tags":["Hardware"],"Speakers":[{"Id":"37d41bd9-9ce3-4851-a0a4-929b52bc3450","FirstName":"Dan","LastName":"Kacenjar","GravatarUrl":"//www.gravatar.com/avatar/e19f1a72b8b5df1ae8a00272a6676f9c"}]},{"Id":2722,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Covering Your PAAS :  Securing Azure Platform As A Service Offerings","Abstract":"Just because you get your Platform As A Service, doesn't mean you get a free pass on security.  Sure, lots has been done to make sure you fall into the pit of success. We will start with securing Azure Websites, and move to Blob Storage, Service Bus, and Databases.\r\n\r\nAll of the Demo's and descriptions in this talk should be highly accessible to all, even if you've never given cloud security a thought. You will walk away with some very quick and easy to implement steps to secure your Azure PAAS apps.","SessionType":"Regular Session","Tags":["Security"],"Speakers":[{"Id":"79d6628d-1728-41ef-9cf9-1b90aa3d6689","FirstName":"Mark","LastName":"Greenway","GravatarUrl":"//www.gravatar.com/avatar/b831cca22966e6877c54033cdcc23901"}]},{"Id":142,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Creating J.A.R.V.I.S. - An Awesome Guide To Automating Your Home","Abstract":"A few years ago I gave one of my robots the job of turning on and off the lights based on sunrise/sunset. Later that years I added a little more functionality by asking it what I should wear everyday (shorts/jeans) based on the weather forecast. In 2014 I now have a dedicated server monitoring 9 network cameras for motion detection and performing face recognition, controlling TVs, thermostats, stereos, the coffee machine and many more things. I can even call my house on Skype to get statuses or tell it what to do.\r\n\r\nIn this talk I'll give an overview of all the modern systems used to control household appliances and lights. I'll give an overview of products with useful REST APIs and how to roll-your-own with a Raspberry PI and a a few inexpensive sensors. I'll also show you how I've built my own J.A.R.V.I.S. and give you an overview of the code and equipment for you to do the same.\r\n\r\nAs a bonus bring a new robot to the talk and show you how J.A.R.V.I.S. communicates with this robot and tells it what to do. Yes computers commanding robots without human input.","SessionType":"Regular Session","Tags":["Hardware","JavaScript"],"Speakers":[{"Id":"e59b3b46-0f47-43e9-9075-a97ec4e539a3","FirstName":"Scott","LastName":"Preston","GravatarUrl":"//www.gravatar.com/avatar/e600cdacc5f6ba2f21ef96bedee7f5c1"}]},{"Id":2474,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Cross-Platform Mobile Development with C#","Abstract":"This is an introductory session to Cross-Platform Mobile Development using C# with Xamarin's tools.  We will cover the basics of cross-platform mobile development with Xamarin, including a discussion of what you CAN and CAN'T do, the business case for using Xamarin instead of native development, and the different approaches to code-sharing that Xamarin provides.\r\n\r\nIf you're a .NET developer interested in breaking into Mobile, or have heard of Xamarin but want to know if it's really as good as it sounds, this is the session for you.","SessionType":"Regular Session","Tags":["Mobile",".NET"],"Speakers":[{"Id":"fc75be0a-81e9-427d-8e46-f1c8a22d7d89","FirstName":"Jason","LastName":"Awbrey","GravatarUrl":"//www.gravatar.com/avatar/8170deb73d6e2169e227aa588a0b32b8"}]},{"Id":152,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Cucumber Ain't Bad, You Are Just Doing It Wrong","Abstract":"The cry from developers is unanimous: \"I don't like Cucumber, my acceptance tests are brittle and hard to maintain!\" And in fact, they can be.\r\nI'll show you in this talk what tools and techniques you should use to write independent, stateless step definitions that can be weaved together to form a testing DSL.","SessionType":"Regular Session","Tags":["Ruby/Rails","Testing"],"Speakers":[{"Id":"35d6c7e4-0d78-4184-867c-ff0fdcd9dc55","FirstName":"Attila","LastName":"Domokos","GravatarUrl":"//www.gravatar.com/avatar/522138482af09965f92a0ef9175d1aee"}]},{"Id":2468,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Data Science for Fun and Profit","Abstract":"Make no mistake, data science can be hard, but it can also be fun. In this session I'll introduce you to Classic and Bayesian Statistics and Machine Learning, all through the medium of predicting horse racing results. We'll explore a number of techniques for making such predictions and finish by combining them into a powerful \"mixed model\" prediction engine that's sure to pick the next big winner. This session won't only improve your knowledge, it'll improve your bank balance too! Note: probably won't do the latter though. :-)","SessionType":"Regular Session","Tags":[".NET","Cloud/Big Data"],"Speakers":[{"Id":"278a8267-dbc1-4f1c-8cf3-f5039c709ef8","FirstName":"Gary","LastName":"Short","GravatarUrl":"//www.gravatar.com/avatar/7df42736bb80d30839269d533000e075"}]},{"Id":2429,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Debugging with Xcode","Abstract":"This intermediate level session will help you get more out of debugging with Xcode. It will start with the basics, like logging, breakpoints and variables, and move to more advanced topics like conditional breakpoints, watching memory and location debugging.\r\n","SessionType":"Regular Session","Tags":["Mobile"],"Speakers":[{"Id":"3b388d25-2173-42ed-b8d1-ba12f326d54a","FirstName":"Dave","LastName":"Koziol","GravatarUrl":"//www.gravatar.com/avatar/913be7efda8ead793ee7b270098a21ea"}]},{"Id":2643,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Deconstructing Single Page Applications","Abstract":"The modern web has introduced new demands for performance that cannot be met solely on the server side, and Single Page Applications (SPAs) have rushed in to meet those demands. The SPA universe is full of choices (Backbone, Angular, Ember and more).  What sets them apart, and how do you choose one?  They all address the same problem set: rendering, routing, data-binding, event handling, composability and others.  By dissecting how different frameworks approach these problems, we can investigate the quirks that set frameworks apart and gain a more intimate understanding of the SPA architecture itself.  For beginners, ninjas and anyone in between, this talk can guide you further in the search for SPA enlightenment.","SessionType":"Regular Session","Tags":["JavaScript"],"Speakers":[{"Id":"fd42b311-27a0-4e96-b2f2-9c3f589c70fc","FirstName":"Jeanette","LastName":"Head","GravatarUrl":"//www.gravatar.com/avatar/1949e3c40f8eb31baacc9a2f6e9e5d2a"}]},{"Id":71,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Decoupling the Frontend through Modular CSS","Abstract":"CSS is hard. It’s a simple language, but getting it right and avoiding specificity hell can be a challenge if you don’t have the right framework to back you up.  Especially in large scaling projects, you might start adding ID selectors here and !important properties there and the next thing you know you’ve backed yourself into a corner where even the smallest of UI changes will take hours to work out. Ew.\r\n\r\nOr how about this? Ever jump into a project and find that even the slightest markup change results in broken JavaScript AND sometimes even broken backend feature tests?! WTF. Ew.\r\n\r\nThis talk will look at how taking a modular, object-oriented approach to CSS can turn frontend woes into frontend wins. We’ll examine modern CSS approaches like OOCSS, SMACSS, and BEM and demonstrate how they will help to not only decouple your CSS styles and reduce specificity conflicts, but how they will also help to decouple your CSS and HTML from your JavaScript and feature specs.","SessionType":"Regular Session","Tags":["Design (UI/UX/CSS)"],"Speakers":[{"Id":"1702ac5d-8845-435f-b2dc-6bbb70c7778a","FirstName":"Julie","LastName":"Cameron","GravatarUrl":"//www.gravatar.com/avatar/f49c5780805d9e50bdc348069a7db59d"}]},{"Id":2590,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Defense in Depth with AOP","Abstract":"Web application security has never been harder.  Our adversary is cunning and clever, and with software becoming more and more complex its harder than ever to ensure security.  This presentation is about using Aspect Oriented Programming to help organize our code in a way that makes implementing security practices easier, centrally maintained and helps to bring security to the forefront of the software development process.  Our aim is to slow or stop our attackers on multiple levels using AOP as our mechanism for achieving this.   \r\n\r\nCode for this talk will be in C# with PostSharp however the concepts can be applied to virtually any programming language or AOP tool.","SessionType":"Regular Session","Tags":[".NET","Security"],"Speakers":[{"Id":"13ad1778-7239-4aac-b1fa-3dfdf174068d","FirstName":"Nerdy","LastName":"Beardo","GravatarUrl":"//www.gravatar.com/avatar/98bf55144f7e2f3ab18cf6a3e5fdb019"}]},{"Id":2721,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Defensible application architecture","Abstract":"Every application we build is subject to attack. Every data item we store is subject to theft. And with most everything delivered by mobile and the Web, traditional network security devices cannot protect our code. This session will cover the patterns and practices for developing defensible applications; including code hardening, security logging, user stories for security operations, and embedding security throughout the development life cycle. Our code will be attacked. Let’s be ready.","SessionType":"Regular Session","Tags":["Security"],"Speakers":[{"Id":"90e6a7cd-be43-4c33-96d4-bc1d8ce5e1d6","FirstName":"Wolfgang","LastName":"Goerlich","GravatarUrl":"//www.gravatar.com/avatar/1dd62ea40cf632222494db28895504ec"}]},{"Id":1251,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Deploying all day without breaking the Internet","Abstract":"At Bitly we serve over 6 billion clicks/per month, record each one, and do all sorts of analysis on that data to provide useful information back to our users.\r\n\r\nAs a company we face two major challenges:\r\n  1.  Not breaking the Internet - if Bitly links stop working, a non-trivial part of the Internet just became much less useful.\r\n  2.  Moving fast - we need to continually adapt to change and build new tools to provide more value to our users.\r\n\r\nThis presents the eternal challenge of accomplishing both stability and speed.   This talk will cover the processes, approaches, and tools used to do over 20-30 deploys each day to over 400 servers without causing any major disruptions to service.\r\n\r\nSome of the topics to be covered include:\r\n  * Benefits of Service Oriented Architecture\r\n  * Designing with ops in mind from day one\r\n  * The power of NSQ (realtime distributed messaging)\r\n  * Asynchronous > Synchronous (except when it isn't)\r\n  * Designing for predictability\r\n  * Route around failure (via hostpool)\r\n  * Automate + Monitor ALL THE THINGS\r\n  * Peer review for code + process","SessionType":"Regular Session","Tags":["Cloud/Big Data","Other"],"Speakers":[{"Id":"532edf7b-767b-413a-85d1-fc7c76a09359","FirstName":"Sean","LastName":"O'Connor","GravatarUrl":"//www.gravatar.com/avatar/7c4892dabc0e774cd66405b7137f72dc"}]},{"Id":1381,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Develop a Cross-Platform 2D Game: Hands-on Workshop","Abstract":"You know you want to create a game like Angry Birds that allows you to fling your manager's head into boiling lava!  With only a laptop running Windows and an HTML-5 capable browser, you can create wicked-cool games for iOS, Android, and Windows.  Start from scratch or build on templates to create shooters, platformers, side-runners, physics puzzles, driving games, and more without having to code your own physics engine.  In this workshop, beginning and experienced developers alike will learn Construct 2 (from Scirra) with plenty of hands-on time to build a compelling, addictive game!  \r\n\r\nUnder the covers, this tool uses HTML5 and JavaScript.  This makes it easy and fun for beginners to create games, and more advanced developers can rapidly prototype games and dive into the underlying HTML5 and JavaScript.  \r\n\r\nPlease bring a laptop running Windows with an HTML5-capable browser.  ","SessionType":"Pre-Compiler","Tags":["Mobile","JavaScript"],"Speakers":[{"Id":"f4084f68-86e4-410c-90b3-3712e9b71d91","FirstName":"Jennifer","LastName":"Marsman","GravatarUrl":"//www.gravatar.com/avatar/36fa3107bdff153bf46f9e80aefc9fbd"}]},{"Id":2847,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Developer Flow: Harness the Power of Flow for Happier Developers","Abstract":"Developers are ‘makers’. We like to get things done. The more productive we are, the happier we are. This connection between productivity and happiness has been researched in the field of positive psychology as flow: the theory that people are happiest when they are in a state of absorption with an activity, or in the zone (credit: M. Csiksgentmihalyi). Using LEGOs and other interactive exercises, this session will present how to effectively harness the power of flow to improve happiness while also producing high-quality deliverables. Participants will explore specific practices such as personal Kanban, the Pomodoro technique, and Test Driven Development.","SessionType":"Regular Session","Tags":["Soft Skills / Business"],"Speakers":[{"Id":"1953deb4-8cd6-4e20-be15-7dab4ad902b8","FirstName":"Rob","LastName":"Keefer","GravatarUrl":"//www.gravatar.com/avatar/c2b1d84a1385e58a6591b06c1aa5f63e"}]},{"Id":1382,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"DevOps: What it is, What it Isn't, and Why Coders Should Care","Abstract":"\tDevOps is a lot of things.  It’s also not a lot of things, and the differences can lead to confusion and incorrect assumptions.  DevOps is related to Agile, but it’s not the same thing as Agile.  It needs tools, but the tools are just a part of the story.  DevOps is a cultural shift, a methodology, an operational philosophy, and a metaphor for software delivery.  It’s only about five years old, so it’s still toddling around development teams, management meetings, and executive boardrooms, attracting attention with every conversation.  The DevOps meme is about to go hype-rsonic, as Agile did about ten years ago.  When that happens, you’ll want to have a good idea what it is, what is isn’t, and why you and your company should care.\r\n\tThis presentation will cut through the hype and boil DevOps down to its bare essentials.  I’ll talk about what DevOps is and the value it offers.  I’ll dispel a few common myths, and demonstrate resources for supporting DevOps Transformation in your organization.  DevOps means different things to different people, so we’ll talk about how to communicate DevOps concepts to various enterprise stakeholders.  When we’re done, you’ll be empowered to go out into the world and talk about DevOps, and maybe even help make it happen at your company.\r\n","SessionType":"Regular Session","Tags":["Other"],"Speakers":[{"Id":"28292ce0-cac4-471e-9464-fdb4db745421","FirstName":"Dave","LastName":"Swersky","GravatarUrl":"//www.gravatar.com/avatar/0e9420fd2a6d39a3779e1d9119834bff"}]},{"Id":38,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Discover your Inner Polyglot on the Google Cloud Platform","Abstract":"The name Google is almost synonymous with large scale web applications. The Google software stack runs many of their popular applications such as Maps and GMail. Most small businesses and development shops can’t dream about being able to have access to anything like it … until now!  The Google Cloud Platform has everything a large scale web app could need.  Google App Engine gives developers a platform to deploy applications based on managed services using multiple languages.  For those who need more control, Google Compute Engine offers bare virtual machines.  Google Cloud Datastore, Cloud Storage and Cloud SQL provide an array of storage options.  If you’re looking for a better way to write web applications and services, learn more about the Google Cloud Platform.","SessionType":"Regular Session","Tags":["Cloud/Big Data"],"Speakers":[{"Id":"24d529f4-0301-423e-85c0-bd8b2d6a25e7","FirstName":"Douglas","LastName":"Starnes","GravatarUrl":"//www.gravatar.com/avatar/6a78aaa9333a1ea6a115da6ecdf37bd9"}]},{"Id":2694,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Docker – Introduction to Lightweight Virtualization","Abstract":"Google is on board with Docker. As is IBM, Red Hat, and Amazon. Even Microsoft has joined the crew! What is Docker, why is it making a big splash in the developer community and how can it make your life easier? Come to this session and find out!","SessionType":"Regular Session","Tags":["Cloud/Big Data","Other"],"Speakers":[{"Id":"31b954d8-b7f4-4d59-9b74-ce7377f77624","FirstName":"Don","LastName":"Taylor","GravatarUrl":"//www.gravatar.com/avatar/6becc18433480b5f7ddf8d08a0c9fa99"}]},{"Id":2808,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"ECMAScript 6 Now","Abstract":"ECMAScript most famous dialect is JavaScript, and the coming version is ECMAScript 6 (ES6). Browsers already started supporting some of its features. JS programmers need to start learning about the coming changes. The presentation will show some of ES6 most useful features like classes, block scope, collections, proxies, arrow functions, iterators, generators, comprehensions, and modules. We will concentrate on the practical aspects of the changes. The session will be interactive, includes many code examples, and will encourage audience participation. By the end of the presentation, participants will know when and how to use ES6 in their own projects.","SessionType":"Regular Session","Tags":["JavaScript"],"Speakers":[{"Id":"38b9c6ae-5a37-4822-ae77-db0d6d968a91","FirstName":"Abdul","LastName":"Habra","GravatarUrl":"//www.gravatar.com/avatar/f4476549f95e5ef9e746ee66a55832b3"}]},{"Id":2498,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Effective Data Visualization","Abstract":"We spend much of our time collecting and analyzing data. That data is only useful if it can be displayed in a meaningful, understandable way.\r\nYale professor Edward Tufte presented many ideas on how to effectively present data to an audience or end user. \r\nIn this session, I will explain some of Tufte's most important guidelines about data visualization and how you can apply those guidelines to your own data. You will learn what to include, what to remove, and what to avoid in your charts, graphs, maps and other images that represent data.\r\n","SessionType":"Regular Session","Tags":["Design (UI/UX/CSS)"],"Speakers":[{"Id":"f9233332-788b-4bf6-8191-4d8b973a9830","FirstName":"David","LastName":"Giard","GravatarUrl":"//www.gravatar.com/avatar/93560aa726daf996fea2aa4a83ccd8d8"}]},{"Id":1212,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"ElasticSearch - Distributed search and analytics on BigData made easy","Abstract":"Elasticsearch is a cloud-ready, super scalable search engine which is gaining a lot of popularity lately. It is mostly known for being extremely easy to setup and integrate with any technology stack.In this talk we will introduce Elasticdearch, and start by looking at some of its basic capabilities. We will demonstrate how it can be used for document search and even log analytics for DevOps and distributed debugging, and peek into more advanced usages like the real-time aggregations and percolation. Obviously, we will make sure to demonstrate how Elasticsearch can be scaled out easily to work on a distributed architecture and handle pretty much any load.","SessionType":"Regular Session","Tags":[".NET","Cloud/Big Data","Java"],"Speakers":[{"Id":"e68e48f1-426a-4812-aa72-f76408b37559","FirstName":"Itamar","LastName":"Syn-Hershko","GravatarUrl":"//www.gravatar.com/avatar/1bd776c3d70cec1b14dbfd6ac97c7810"}]},{"Id":2487,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Elixir = Ruby, A Pattern Matching","Abstract":"Object-oriented programmers can have a dogmatic approach to language patterns. Whether it is analyzing, debating or criticizing various implementations, the passion for patterns emerges from the need to both communicate intent and categorize code. The patterns do more than define code, they describe it. So, what happens when we lose objects? When state fades away? When paradigms shift far more than a change in languages?\r\n\r\nIn steps Elixir. With syntax similar to Ruby but firmly grounded in the functional paradigm, it represents an easy transition for Rubyist into functional programming. But what about the beloved patterns? It turns out that understanding how functional languages implement some of the common object-oriented patterns can demystify this new paradigm. Plus learning new functional patterns can provide new solutions to old problems.","SessionType":"Regular Session","Tags":["Ruby/Rails","Functional Programming"],"Speakers":[{"Id":"9e4f8bb7-d199-4dbb-888b-1a807b5097f3","FirstName":"Johnny","LastName":"Winn","GravatarUrl":"//www.gravatar.com/avatar/5f89c4b03d2d165c64fe16bda895c9a4"}]},{"Id":2710,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Elixir For The Impatient","Abstract":"Elixir is a functional programming language on top of the Erlang VM. It has the power of Erlang but in a modern, elegant, and beautiful form. Elixir makes it easy to write highly distributed systems in a reliable and scalable manner. This presentation will introduce the language and the tools to let you immediately write Elixir programs. Concepts introduced include modules, control and data structures, pattern matching, recursions, pipes (really cool), functional operations, and distributed messaging. We will avoid the classic functional jargon and concentrate on the productive side of the language. While showing these concepts, we will use the repl, the build tool, and unit testing. The session will include many pre-written code examples and will encourage audience participation. By the end of the presentation, it is hoped that you will be as excited about the language as the the presenter is.","SessionType":"Regular Session","Tags":["Functional Programming"],"Speakers":[{"Id":"38b9c6ae-5a37-4822-ae77-db0d6d968a91","FirstName":"Abdul","LastName":"Habra","GravatarUrl":"//www.gravatar.com/avatar/f4476549f95e5ef9e746ee66a55832b3"}]},{"Id":2627,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Elixir is for Rubyists","Abstract":"You keep hearing about this Elixir thing. \"It's functional, meta-programmable, concurrent, and AWESOME!\" they exclaim. I don't know who *they* are, but they're totally right.\r\n\r\nAs a long-time Rubyist, I've come to believe that Elixir has been artisianally crafted to suit the Rubyist's discriminating taste. We'll examine how Elixir's features and philosophy make it uniquely suited to complement the Rubyist's toolbelt, and how it might just change the way you think about solving problems.","SessionType":"Regular Session","Tags":["Ruby/Rails","Functional Programming"],"Speakers":[{"Id":"5a6a9e1f-5109-4811-90c5-4c103b72ebc8","FirstName":"Ernie","LastName":"Miller","GravatarUrl":"//www.gravatar.com/avatar/2274a7476f6d2ac7aedcdec0651d0542"}]},{"Id":137,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Engineering Innovation","Abstract":"Where do good ideas come from and how do we track them? Can we prioritize them and who gets to work on which idea?\r\n\r\nEngineering teams obsess over how we manage the work of today and provide valuable feedback on the development process: Why are we building this feature? When will that feature be completed? What portions of the code changed in order to support this feature? These same teams rarely focus on the big ideas of tomorrow, even though in this information age most of what a company will do tomorrow is led by engineering.\r\n\r\nInnovation happens best with small teams and structure, so like automated testing and builds, let's apply the same systemization to improvements and ideas so that the very best potential innovations are always at the forefront, and the best people are able to work on them at any point in time.\r\n","SessionType":"Regular Session","Tags":["Soft Skills / Business"],"Speakers":[{"Id":"0a4d75f0-7b0c-4c9a-ac8c-f760aaf6e1ea","FirstName":"Dustin","LastName":"Updyke","GravatarUrl":"//www.gravatar.com/avatar/ffcf1dd3d18f90d7a1c4ba2fe0ab497b"}]},{"Id":2583,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Ethics and Effective A/B Testing","Abstract":"Facebook and OK Cupid have recently been under public scrutiny for the experiments they run on their users. The truth is every web site of a considerable enough scale experiments on their users. Whether it's searching for just the right shade of blue for the \"Buy!\" button or trying out a new algorithm to perfect the news feed, these are psychological experiments and the user is the subject.\r\n\r\nIn this talk, you'll be introduced to the basics of solid, overlapping, multivariate testing as well as a simple tool for enabling those experiments. This will enable you to perform more, better, safer experimentation. This talk will also include a healthy discussion on the ethics of experimentation to help steer you away from any possible controversy.","SessionType":"Regular Session","Tags":["Testing","Soft Skills / Business"],"Speakers":[{"Id":"665c02b7-e021-46ea-8635-e6fa6d9c3818","FirstName":"Dusty","LastName":"Burwell","GravatarUrl":"//www.gravatar.com/avatar/6343ef938226f72218388cb8f0eec754"}]},{"Id":2397,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Everything I Know About Design I Learned from Comics","Abstract":"Pow! Splatt! Boom! When most people think of comics they think of larger than life heroes or over the top cartoon characters. But what makes these big ideas work? It’s the spaces in between--the details that tie all the elements together, make the big moments gigantic, and the special moments memorable.\r\n\r\nIt’s the same with design. Whether you’re wireframing an app or building a corporate website, the design is the story you tell. \r\n\r\nYou’ve already learned everything you need to know to about user centered design from comics. Brad will guide you through the basics and explain how design can tell the big stories, the little stories, and everything in between.","SessionType":"Regular Session","Tags":["Design (UI/UX/CSS)"],"Speakers":[{"Id":"b6e9e556-70bc-41ff-bf71-6594418fecbe","FirstName":"Brad","LastName":"Colbow","GravatarUrl":"//www.gravatar.com/avatar/75121e03fdd2e3ca5c5c505077814bae"}]},{"Id":2629,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Exploratory Testing for Everybody!","Abstract":"Bring your laptop to this hands-on session of doing exploratory testing - a customer-value-centric style of testing that does not require boring paperwork (yet can still stand up to scrutinty.) Instead of planning the work and working the plan, Exploratory testing combines  test design, execution, reporting and learning in a simultaneous process. Done well it  can be a powerful tool in any team member's arsenal. Done poorly, ET can create confusion without adding much value. Learning by doing, we'l pair with a buddy, hear a little theory, and then get to testing. We'll have some more theory, then test a second application, then a third - then conduct a retrospective to talk about how these techniques can combine to improve coverage of the application, reducing time-to-done, and allow teams to compress testing into iterations, sprints, and other timeboxes.","SessionType":"Regular Session","Tags":["Testing"],"Speakers":[{"Id":"ccd1bddf-2c93-4559-82f7-07092b297986","FirstName":"Matthew","LastName":"Heusser","GravatarUrl":"//www.gravatar.com/avatar/029780fa46bfc1d919adc994c3d0abb3"}]},{"Id":2675,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"F# and Machine Learning: a Winning Combination","Abstract":"While Machine Learning practitioners routinely use a wide range of tools and languages, C# is conspicuously absent from that arsenal. Is .NET inadequate for Machine Learning? In this talk, I'll argue that it can be a great fit, as long as you use the right language for the job, namely F#.\r\nF# is a functional-first language, with a concise and expressive syntax that will feel familiar to data scientists used to Python or Matlab. It combines the performance and maintainability benefits of statically typed languages, with the flexibility of Type Providers, a unique mechanism that enables seamless consumption of virtually any data source. And as a first-class .NET citizen, it interops smoothly with C#. So if you are interested in a language that can handle both flexible data exploration and the pressure of a real production system, come check out what F# has to offer.","SessionType":"Regular Session","Tags":[".NET","Functional Programming"],"Speakers":[{"Id":"9725474f-2638-4ee9-8ea8-b3847933769c","FirstName":"Mathias","LastName":"Brandewinder","GravatarUrl":"//www.gravatar.com/avatar/656d522b5a93ff6b337d66c0a247e7cb"}]},{"Id":2679,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"F# for the C# Developer","Abstract":"You have been writing C# for years, and are happy with it - so why bother with F#? \r\nThis talk will compare and contrast F# and C# with live coding examples, illustrating why F# is an awesome language, where it shines, and how it fits. So if you are open to the idea that C# might not be the one and only solution to all your coding problems, or if you are simply tired of null reference exceptions, come check out what F# has to offer, and how it beautifully complements C#!","SessionType":"Regular Session","Tags":[".NET","Functional Programming"],"Speakers":[{"Id":"9725474f-2638-4ee9-8ea8-b3847933769c","FirstName":"Mathias","LastName":"Brandewinder","GravatarUrl":"//www.gravatar.com/avatar/656d522b5a93ff6b337d66c0a247e7cb"}]},{"Id":79,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"F# in social gaming","Abstract":"F# is an incredibly versatile and expressive language and enables you to solve a wide array of problems succinctly and efficiently. This talk illustrates, with real-world examples, how the Gamesys social team uses F# to build the backend services that support around 1 million Daily Active Users (DAU) and 250 million daily requests across its social games on both mobile and web platforms.\r\n\r\nTalk objectives:\r\n\r\n- Demonstrate the use of F# to write clean, concise game logic as well as infrastructure code, the same techniques and concepts can be easily applied to other domains;\r\n\r\n- Demonstrate how F# can help tackle recurring business problems of:\r\n\r\nEfficiency\r\nCorrectness\r\nComplexity\r\nTime to Market","SessionType":"Regular Session","Tags":[".NET","Functional Programming"],"Speakers":[{"Id":"1ed75aea-1301-40c3-8d0d-af03a2763414","FirstName":"Yan","LastName":"Cui","GravatarUrl":"//www.gravatar.com/avatar/0bbaed5a18c131ba152cf566e1becaf8"}]},{"Id":2777,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Fantastic JVM Languages and Where to Find Them","Abstract":"When Java came on to the scene, it changed everything…. Now almost 20 years later, while the language starts to show its age, the platform continues to be as fertile as ever. The JVM is the core of this ecosystem and everyday more languages are emerging from it. Scala, Clojure, Groovy, Jython, Jruby, Ceylon, XTrend… the list goes on and on. With all these languages to choose from, how do programmers decide which languages are right for the job? In this session, you’ll learn about some of these popular JVM languages, and explore how to choose the right language to fit your needs.","SessionType":"Regular Session","Tags":["Java"],"Speakers":[{"Id":"4b841b94-b4a6-435b-8957-33bf4c4eabeb","FirstName":"Branden","LastName":"Bellanca","GravatarUrl":"//www.gravatar.com/avatar/06f6516772eca8763479753e2746e328"}]},{"Id":2391,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Fostering Collaboration with Pattern Libraries and Rapid Prototyping","Abstract":"Recognize the benefits of using a living pattern library and rapid prototyping to increase communication and collaboration between designers and developers. In this session we will review a case study from an enterprise-level development group traditionally staffed with 60+ developers and no designers and how they were able to implement a pattern library and rapid prototyping framework into their design and development process. In this session we will discuss:\r\n\r\n• recognizing patterns\r\n• modular pattern creation\r\n• how patterns can be combined to be used during rapid prototyping\r\n• developing a consistent language that can be used between designers and developers\r\n","SessionType":"Regular Session","Tags":["Design (UI/UX/CSS)","JavaScript"],"Speakers":[{"Id":"ec702929-7713-447c-8ac3-459d1db5a8a2","FirstName":"Bermon","LastName":"Painter","GravatarUrl":"//www.gravatar.com/avatar/7559f6cff1f5efc2d210965febd4d71c"}]},{"Id":2434,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"From Backbone to Ember and Back(bone) Again","Abstract":"As a software consultant, I get to see a lot of interesting code. In this particular instance a client was in the process of transforming their web application to a rich, interactive interface with the help of another company.\r\n\r\nThe project kicked off using Backbone and things were great. Until they were not great. Pages starting getting more and more involved and blame started being thrown at the technology choice.\r\n\r\nA move to Ember.js ensued and the app was rewritten. But architecturally bad decisions don't hide long, and soon the rewrite was preforming even worse.\r\n\r\nThat's when I stepped in, with the help of another consultant, to solve the performance issues once and for all. Our solution used Backbone.js and it was fast. This is that journey.","SessionType":"Regular Session","Tags":["JavaScript"],"Speakers":[{"Id":"d075ecc2-806c-42d1-948a-1ad3bfa39ad4","FirstName":"Jonathan","LastName":"Knapp","GravatarUrl":"//www.gravatar.com/avatar/c6caef08c5eb2951bee325de5df53def"}]},{"Id":2635,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"From Scale up to Scale Out - Migrating our App from Big Iron to the Cloud ","Abstract":"Performance in the cloud comes from the ability to scale out.  Unfortunately, your options to scale up instead of out in the cloud can often be limited and in some cases even the biggest cloud instance you can provision is far less powerful than the on premise server you are migrating from.  \r\n\r\nThis presentation will share techniques and lessons learned from real world experience when deploying large existing ASP.Net/SQL Server applications to Windows Azure.   While some abstract concepts will be discussed, the primary focus of this presentation will be to give attendees practical technical solutions that can be applied to dramatically improve performance in the cloud without major code/architecture changes and in many cases the techniques covered in this presentation are also highly effective in non-cloud environments.","SessionType":"Regular Session","Tags":[".NET","Cloud/Big Data"],"Speakers":[{"Id":"77303af7-6d12-4bea-ac48-51f769853b6c","FirstName":"Chris","LastName":"Farrell","GravatarUrl":"//www.gravatar.com/avatar/af5f13b80c75430f7e2f4ef1efc2f4e8"}]},{"Id":2504,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"From Visual Studio to Android Studio","Abstract":"This session provides an introduction to building native Android apps using Android Studio. Topics are covered from the perspective of someone with .NET experience but are appropriate for anyone looking to get into the mobile space. We will begin by learning what Android has to offer and then build our first small, but functional application.","SessionType":"Regular Session","Tags":["Mobile"],"Speakers":[{"Id":"72a342b3-9c58-460a-98f5-780e79e71560","FirstName":"Michael","LastName":"Crump","GravatarUrl":"//www.gravatar.com/avatar/bc4ba4e314fc7f2585957898fcc78a76"}]},{"Id":1200,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"From Zero to Full Deployment Automation in 60 Minutes","Abstract":"Wouldn’t it be nice if the simple action of checking in your latest changes into source control triggered an official build? Wouldn’t it be even better if, upon a successful build, the latest executables were automatically deployed to your test bed without you lifting a finger? If you’re not lucky enough to be deploying to a cloud platform that provides such functionality out of the box, automating your process might seem daunting. In this session, Danielle will demonstrate how you can leverage tools such as TeamCity and Octopus Deploy to automate your builds and deployments. You’ll be introduced to a variety of options you can use to customize the process in order to meet your particular requirements. Along the way, you’ll learn about some neat productivity features you may wish to leverage as well as some pitfalls you would do well to avoid.\r\n\r\nYou’ll leave this session with the knowledge of how to automate your own builds and deployments and how to extend that automation chain so you can reach the next level.  Test automation, anyone?\r\n","SessionType":"Regular Session","Tags":["Other"],"Speakers":[{"Id":"21fbddff-2331-4717-90d1-6d662f4b64bb","FirstName":"Danielle","LastName":"Boldt","GravatarUrl":"//www.gravatar.com/avatar/2b11b70b0ba0f3b33ddd9041454c3cc7"}]},{"Id":135,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Front-End Style Guides from 0 to 60!","Abstract":"Over the course of the workshop learn techniques related to building, maintaining, and scaling front-end style guides. Attendees will learn the history of style guides, see examples of great style guides done by small and large companies alike, and start building their own style guide.","SessionType":"Pre-Compiler","Tags":["Design (UI/UX/CSS)"],"Speakers":[{"Id":"a87018b9-f97c-4811-a4ee-7f6f14290366","FirstName":"Cameron","LastName":"Wardzala","GravatarUrl":"//www.gravatar.com/avatar/2030baec3517ca4b3d8fb21523509672"}]},{"Id":2838,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Galileo Magnifico! IoT with Windows on Devices","Abstract":"We are in the era of the Maker. Never before has DIY-type hardware been so accessible and affordable. The plethora of devices and sensors at our fingertips is staggering, giving us the power to bring our ideas to fruition. Microsoft recently unveiled their Windows on Devices developer program that brings a small Windows OS to a small device, in this case the Intel Galileo. The first preview enables developers to use Visual Studio to program and execute Arduino sketches on the Galileo. This session will provide an overview of the developer program, how to get started with Windows on the Galileo as well as a demonstration of a couple of projects.","SessionType":"Regular Session","Tags":["Hardware"],"Speakers":[{"Id":"3e52a423-7eb3-4530-95d8-6815864272ef","FirstName":"Carey","LastName":"Payette","GravatarUrl":"//www.gravatar.com/avatar/719139fbb276f84e26fa2dca1412c70b"}]},{"Id":2507,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Generating Circumstances","Abstract":"Most samples, fixtures, stubs tend to fall short of completing their intended storyline: representing the range of possible values that will interact with a single specification or a test on something more elaborate and integrated. Why not just set some constraints and/or bounds and generate a more exhaustive set of circumstances that your program or system is contracted and believed to satisfy?\r\n\r\nIn this talk, I'll cover using test.check to easily compose and apply generators and how we're generating a comprehensive set of values from Prismatic schemas, which we use as our integral validation layer. We apply these generations toward all kinds of problem spaces, including forming testable database environments, collection filtering, and our property-based tests for capturing what's true/valid and what better be false.","SessionType":"Regular Session","Tags":["Testing","Functional Programming"],"Speakers":[{"Id":"eb15a235-5ab2-4267-a6b6-356f96a9d6ce","FirstName":"Zeeshan","LastName":"Lakhani","GravatarUrl":"//www.gravatar.com/avatar/5cf448e5edc7dc73659e3f42baff490a"}]},{"Id":1385,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Generics in .NET","Abstract":"All .NET developers have used generics, but too few utilize their full power.  Most developers who use generics think of them only for collections, when they are valuable in any situation where code is the same except for type.  This session is a deep dive into generic classes, interfaces, methods, and delegates.  You will learn how to increase the power of generics by applying constraints, and will see examples drawn from real applications.  You will leave with ideas about how to apply generics in your development and understanding the .NET features necessary to realize those ideas.\r\n","SessionType":"Regular Session","Tags":[".NET"],"Speakers":[{"Id":"9f3c9092-8924-4a5d-83da-c3ad58dc0eba","FirstName":"Joe","LastName":"Wirtley","GravatarUrl":"//www.gravatar.com/avatar/cf6b28cfe39c5f39a6d3dc7b52f53a2d"}]},{"Id":2692,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Get Shipping with Docker","Abstract":"Docker is a platform for building, shipping and running distributed applications. It solves the problem of managing an application's dependencies in a simple and automated way. Google, IBM, Red Hat, Amazon, and even Microsoft are all on board with it. This hands-on session will cover what Docker is, how to use it, and what it can do for you and your organization. \r\n\r\nYou will:\r\n\r\n* Understand the purpose of Docker and the concepts of images, containers and repositories\r\n\r\n* Install Docker on your laptop and run standard Docker images \r\n\r\n* Learn strategies for building layered Docker images \r\n\r\n* Create, run and debug your own Docker image \r\n\r\n* Receive an overview of advanced Docker container concepts like volume mounting and IP port forwarding \r\n\r\n* Be introduced to Fig (fast, isolated development environments) to easily manage a cluster of Docker containers\r\n  \r\nSo come and get shipping with Docker!","SessionType":"Pre-Compiler","Tags":["Cloud/Big Data","Other"],"Speakers":[{"Id":"31b954d8-b7f4-4d59-9b74-ce7377f77624","FirstName":"Don","LastName":"Taylor","GravatarUrl":"//www.gravatar.com/avatar/6becc18433480b5f7ddf8d08a0c9fa99"}]},{"Id":2691,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Get the most out of your text-based data","Abstract":"It's your information, why don't you use it? Too many times, businesses and developers collect different forms of text-based data that then go unused, collecting dust in some data warehouse. This session will introduce developers to several ways businesses are leveraging text analytics and natural language processing to improve business practices or inform decision-making processes. Types of data used in the examples may include company websites, invoices, record narratives and social media. The majority of examples and tools demonstrated will be python based. The means to extract usable, structured information from unstructured text and add it to your data arsenal is within your grasp!","SessionType":"Regular Session","Tags":["Other"],"Speakers":[{"Id":"f1a2042a-f8b7-4f86-af56-ecdd54409b94","FirstName":"Amber","LastName":"McKenzie","GravatarUrl":"//www.gravatar.com/avatar/718a25b4ce19ee3bfcd3aca8d0354319"}]},{"Id":2868,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Get your game on with Unity and Oculus Rift!","Abstract":"Coming Soon","SessionType":"Pre-Compiler","Tags":["Other"],"Speakers":[{"Id":"b35801ad-2c55-4ee3-8f86-be410893d51f","FirstName":"Mike","LastName":"Geig","GravatarUrl":"//www.gravatar.com/avatar/4fa5d13a28770d89dd12bc9497b49609"},{"Id":"30175927-4dbd-452b-b2f5-ad2c090b3069","FirstName":"Nathalie","LastName":"Goh-Livorness","GravatarUrl":"//www.gravatar.com/avatar/0f68238dc4fbb497f73db5285a4f34d0"}]},{"Id":2762,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Getting Good at Gradle","Abstract":"Now that you have made the choice to use gradle, what’s next? In this session, you will learn how turn the build from something everyone tries to avoid intro something you can actually love. Find out about strategies for making build scripts that are actually maintainable as well as some of the cooler advanced features you should be aware of and could be making use of starting today. What’s new in Gradle 2? What are some of the leaders in the industry doing with gradle? Finally learn how gradle fits nicely in your continuous delivery pipeline. ","SessionType":"Regular Session","Tags":["Mobile","Testing","Java"],"Speakers":[{"Id":"963e6e5b-f294-4335-ab14-896150e5fd0a","FirstName":"Bryan","LastName":"Davis","GravatarUrl":"//www.gravatar.com/avatar/dbb3e1267cd9b68fbb62a516ebf461f8"}]},{"Id":70,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Getting Sassy With CSS","Abstract":"I don’t know about you, but vanilla CSS always leaves me wanting more. It’s a fairly simple language, can do some pretty powerful things, but after a while... well, it can become rather tedious to work with. \r\n\r\nEnter Sass: Syntactically Awesome Stylesheets. Sass is a CSS meta-language and precompiler that makes the prettification of your website a breeze by adding invaluable features of more traditional programming languages. \r\n\r\nIn this workshop, we’ll jump right in to the Sass workflow and cover all the key game changers - nesting, variables, mixins, inheritance, and directives. We’ll also cover some of the gotchyas, tools and extensions, and tips on organization and coding standards.","SessionType":"Regular Session","Tags":["Design (UI/UX/CSS)"],"Speakers":[{"Id":"1702ac5d-8845-435f-b2dc-6bbb70c7778a","FirstName":"Julie","LastName":"Cameron","GravatarUrl":"//www.gravatar.com/avatar/f49c5780805d9e50bdc348069a7db59d"}]},{"Id":69,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Getting Sassy With CSS : Sass Shop","Abstract":"I don’t know about you, but vanilla CSS always leaves me wanting more. It’s a fairly simple language, can do some pretty powerful things, but after a while... well, it can become rather tedious to work with. \r\n\r\nEnter Sass: Syntactically Awesome Stylesheets. Sass is a CSS meta-language and precompiler that makes the prettification of your website a breeze by adding invaluable features of more traditional programming languages. \r\n\r\nIn this workshop, we’ll jump right in to the Sass workflow and cover all the key game changers - nesting, variables, mixins, inheritance, and directives. We’ll also cover some of the gotchyas, tools and extensions, and tips on organization and coding standards.","SessionType":"Pre-Compiler","Tags":["Design (UI/UX/CSS)"],"Speakers":[{"Id":"1702ac5d-8845-435f-b2dc-6bbb70c7778a","FirstName":"Julie","LastName":"Cameron","GravatarUrl":"//www.gravatar.com/avatar/f49c5780805d9e50bdc348069a7db59d"}]},{"Id":2560,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Getting Started with Chrome Extensions: Tips and Tricks","Abstract":"You’ve seen Chrome extensions in the wild, maybe even installed a few into your browser — but what about writing your own? In this talk, you’ll learn the basics of Chrome extension development (from git init to publishing in the Web Store), how to avoid having your extension automatically disabled when performing upgrades, and some unexpected parts of Chrome you can hook into to take your extension to the next level.","SessionType":"Regular Session","Tags":["JavaScript","Other"],"Speakers":[{"Id":"624c91f0-d63c-43fd-92bb-de84a2169c62","FirstName":"Andrew","LastName":"Dunkman","GravatarUrl":"//www.gravatar.com/avatar/2e055eb589fb86174fd268748b0fcd30"}]},{"Id":1371,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Getting Started with Machine Learning on Azure","Abstract":"Machine Learning can often be a daunting subject to tackle much less utilize in a meaningful manner. In this session, attendees will learn how to take their existing data, shape it, and create models that automatically can make principled business decisions directly in their applications. The discussion will include explanations of the data acquisition and shaping process. Additionally, attendees will learn the basics of machine learning on the Azure platform- primarily the supervised learning problem.","SessionType":"Regular Session","Tags":[".NET","Cloud/Big Data"],"Speakers":[{"Id":"5f356f6a-6477-4bf1-8a87-079c19427699","FirstName":"Seth","LastName":"Juarez","GravatarUrl":"//www.gravatar.com/avatar/cc351a7c1ea116d1400349644ad8d66e"}]},{"Id":2857,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"git gone wild: how to recover from common git mistakes. ","Abstract":"\r\n\"Oh no! I just typed something into git and now my work is gone! Ahh!\"\r\n\r\nDon't panic. Contrary to popular belief, git is one of the most non-destructive version control systems available. When used right, git\r\nnever loses any data, and even when misused, chances are very high you can still recover.\r\n\r\nThis talk will present turn-by-turn directions on how to recover from a wide array of common git mistakes, and also provide some workflows\r\nto minimize them.\r\n","SessionType":"Regular Session","Tags":["Other"],"Speakers":[{"Id":"3d87bbd3-b2b6-4ba7-9ce0-445cde6ebd9e","FirstName":"Magnus","LastName":"Stahre","GravatarUrl":"//www.gravatar.com/avatar/c984a37ed01f1a6304380f37512b3890"}]},{"Id":1219,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Gitting More Out of Git","Abstract":"Having trouble groking git? Not sure what the difference between merging and rebasing is? Wondering what you would ever use a \"cherry-pick\" for? We'll cover these topics and more in this talk, helping you get past git novice and on your way to git master.\r\n\r\nWe'll do a short review of git, then dive deeper into: branches, commit amending, git logs, merging and rebasing,  cherry-picking, stashing, and more.\r\n\r\nOkay, maybe you won't be a guru after one conference session, but you will have a better understanding of how to play nicely with others in the same git repository.","SessionType":"Regular Session","Tags":["Other"],"Speakers":[{"Id":"f76c74ea-5a60-4c0a-b5d0-f008ce85edec","FirstName":"Jordan","LastName":"Kasper","GravatarUrl":"//www.gravatar.com/avatar/f441bc8d508101ba0a1eac95d6cd52c6"}]},{"Id":11,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Going Indie 101: Lessons Learned from a Over a Decade of Independence","Abstract":"Breaking free from the confines of the cubicle farm and going out on your own can be one of the most satisfying things you do for your career. It can also be one of the most terrifying. Being on your own can seem like it's nothing but ponies, unicorns and rainbows, but it's a lot of work, and success is not guaranteed.\r\n\r\n Mike, an independent developer since 2001, will discuss the lesson's he's learned over the years along with the ups and downs he's experienced. In this updated and expanded session, he will be joined by friend and attorney Jeffrey Strauss to help answer the most common questions he's been asked over the years. \"How do I get started?\", \"Where do I find clients?\", \"How much do I charge?\", \"Do I need a contract?\" and many others. Bring your questions and find out if the grass really is greener on the other side.","SessionType":"Pre-Compiler","Tags":["Other"],"Speakers":[{"Id":"3c57b6bb-9753-438f-9610-6fe49d0d645b","FirstName":"Michael","LastName":"Eaton","GravatarUrl":"//www.gravatar.com/avatar/d5281e80a4ad86734e1d1c1bd45ab0b8"}]},{"Id":147,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Grails and AngularJS, bridging the gap","Abstract":"This will be a presentation on my experience integrating existing  Grails services and Assets with AngularJS. Most Grails developers are very reliant on GSPs to display structured data. With the introduction of a more powerful and standardized mobile platform some of this can be offloaded to the browser. This class will explore issues such as Angular directives and services, Grails service calls, web sockets and more. We will ensure functionality and code quality throughout the stack using Jasmine, Spock and CucumberJs tests.  Finally, if there is still time we will look into using the Grails Bootstrap Plugin to allow for clean and easy theming. These are both very powerful technologies, and for those businesses not ready for NodeJS this is a great alternative.","SessionType":"Regular Session","Tags":["JavaScript","Cloud/Big Data","Testing","Java"],"Speakers":[{"Id":"8faf464a-758f-4db0-9443-4ba39b4e2fee","FirstName":"Jackie","LastName":"Gleason","GravatarUrl":"//www.gravatar.com/avatar/cc4c37d7b7bdfa395b2fcdad7aa86125"}]},{"Id":2782,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Growth: Moving Beyond “Independent Developer”","Abstract":"You’ve made the decision to go out on your own. Do you want to stay an Army of One or do you strive for something more? Spend an hour discussing the obstacles you will encounter if you go it alone and the obstacles you will encounter if you don’t. Learn philosophies that will help you on your way to an Army of Two, from before, to during, and for after your transition to Employer. Move beyond Independent Developer, and switch from “Me” to “Us”.","SessionType":"Regular Session","Tags":["Soft Skills / Business"],"Speakers":[{"Id":"e603adc3-e5a3-478f-895b-8229fafebfd3","FirstName":"Jay","LastName":"Harris","GravatarUrl":"//www.gravatar.com/avatar/1318668b99b2d5a3900f3f7758763a69"}]},{"Id":2689,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Hadoop and Beyond: Advances in Big Data Processing","Abstract":"As we deploy apps generating more data, at a faster pace, we need to bring a new set of tools to help us handle it.  In this pre-compiler, we'll look at 4 key big data workloads, Query at Scale, NoSQL, Streaming, and Machine Learning, and how to incorporate them into your applications.  Specifically, we'll discuss Hive, Spark, Shark, HBase, Storm, Scalding, Tez, MLlib and a few others.  \r\n\r\nMost of the demonstrations will be based on the JVM stack, but we will show some Python and .NET as well.  Familiarity with Hadoop is beneficial, but not required. ","SessionType":"Pre-Compiler","Tags":[".NET","Cloud/Big Data","Java"],"Speakers":[{"Id":"d7470df4-38ba-403d-adad-2e73fc01a74f","FirstName":"matt","LastName":"winkler","GravatarUrl":"//www.gravatar.com/avatar/708816a65ba4164fe2b227d60a08dfe1"}]},{"Id":2880,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Head to Head Oculus Rift VR Smashdown!1!!1","Abstract":"Come play with the Oculus Rift and see what Facebook paid $2 Billion for. Get to play a game head to head (literally) with your best friend, random stranger, or even your nemesis! Kids welcome.","SessionType":"After Dark","Tags":["Hardware","Other"],"Speakers":[{"Id":"30175927-4dbd-452b-b2f5-ad2c090b3069","FirstName":"Nathalie","LastName":"Goh-Livorness","GravatarUrl":"//www.gravatar.com/avatar/0f68238dc4fbb497f73db5285a4f34d0"}]},{"Id":2544,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Holiday Light Fight with Raspberry Pi","Abstract":"Have you ever seen a holiday light show and thought, \"Wow, I wish I could do that.\" In this half-day pre-compiler, you will build your very own relay controlled power supply, then work in a team synchronize a collection of holiday lights for you own holiday light show.","SessionType":"Pre-Compiler","Tags":["Hardware"],"Speakers":[{"Id":"bff5544d-f2ba-43c5-82db-3c2c8b48881c","FirstName":"Brian","LastName":"Sherwin","GravatarUrl":"//www.gravatar.com/avatar/c24ba58effd5b7bb3dcdbd3f3897cfcf"}]},{"Id":2455,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"How *Not* to Write Concurrent Code","Abstract":"Invariants, locking, mutexes, critical sections, monitors, barriers, race conditions, non-deterministic, memory coherence, consistency models, etc. \"Multithreading is hard\", hard to do correctly and easy to do incorrectly. \"Correctly\" is almost always application-specific and usually caveated with \"it depends\". It's hard to define specific rules or practices that work in all circumstances. This session takes a different point of view on things and shows you specific ways to do things \"wrong\" with regard to multi-thread. This session will detail some of the common primitives and techniques use in multi-threading, but used in the wrong ways. Why they are wrong and alternatives will be covered. Topics like Sleep, DoEvents, volatile, lock, interlocked, thread priority, non-shared data, etc. will be covered.","SessionType":"Regular Session","Tags":[".NET"],"Speakers":[{"Id":"8239f2da-71b2-4fda-b077-3ceb9b4ba918","FirstName":"Peter","LastName":"Ritchie","GravatarUrl":"//www.gravatar.com/avatar/9f2f98606c6c7002862ef3be62cfc97c"}]},{"Id":2788,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"How I built an automated meat smoker on Arduino and then Raspberry Pi","Abstract":"This talk will go into detail about creating an automated meat smoker using two different hardware platforms. It will describe the implementation details about the hardware and software components to build the smoker. We will start with exploring the implementation on the Arduino microcontroller. Then we will go through the challenges and benefits of porting the automated smoker to the Raspberry Pi platform.","SessionType":"Regular Session","Tags":["Hardware"],"Speakers":[{"Id":"a02a0671-98a9-4365-a7b5-b963c6b4b046","FirstName":"Joseph","LastName":"Andaverde","GravatarUrl":"//www.gravatar.com/avatar/20bcd9c84412ff9a04188982293ca539"}]},{"Id":1299,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"How to be a Six Figure Developer","Abstract":"Ever wonder how software development rock stars got so successful? Get the most out of your hard work and experience  by learning some proven ways to measure your accomplishments, establish a personal brand, and increase your value to employers.","SessionType":"Regular Session","Tags":["Soft Skills / Business"],"Speakers":[{"Id":"7eb23011-c7aa-4ba4-92f3-4f4649711b87","FirstName":"Gaines","LastName":"Kergosien","GravatarUrl":"//www.gravatar.com/avatar/f5dded2661a1ef93520c635ab884d006"}]},{"Id":1208,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"How to get a job in the Software Business?","Abstract":"In this session, 25 years of experience in hiring top talent in the Silicon Valley, all over the USA, Europe, Dubai and Australia will be shared to better understand what to concentrate on for success in an industry that changes so often. Are you a student or new to the industry? come to this session.  Are you an experienced Developer that is locked in one area of technology and want to be involved with other technologies but don't know which one? come to this session.\r\nWant to know how to handle a technical interview? come to this session\r\nFinally, want to know the secret of success in the consulting business, this session will be your most valuable session at Codemash.","SessionType":"Regular Session","Tags":["Soft Skills / Business"],"Speakers":[{"Id":"f3e62400-5fd8-4099-8470-f5c0d900d5e5","FirstName":"Lino","LastName":"Tadros","GravatarUrl":"//www.gravatar.com/avatar/77503ad16c388ce70fcdd6ca19df5a49"}]},{"Id":2383,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"How To Interview (and Why)","Abstract":"An interview too often feels like a first date - awkward, strange, and not entirely predictive of what’s to follow. There are countless books and websites to help you when you’re a job seeker, but what about when you’re the one doing the hiring? Will you just ask the same puzzle questions or sort algorithm problems? What are your metrics for evaluating or contextualizing the answers? In this talk, I’ll discuss successful practices and techniques to help you find someone who will innovate your business, bring new energy to your team, get the work done, AND be someone you’ll want to work with.","SessionType":"Regular Session","Tags":["Soft Skills / Business"],"Speakers":[{"Id":"e839ede0-769a-49a7-9119-c724d202ca0f","FirstName":"Kerri","LastName":"Miller","GravatarUrl":"//www.gravatar.com/avatar/f4d5752d6f4f839083cf810ad2c3a911"}]},{"Id":2865,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"How to Save the World Without Wearing Your Underpants on the Outside","Abstract":"In May 2014, the Chicago Council on Global Affairs met in Washington, D.C. and predicted a perfect storm. On the one hand there is a demand for food from an ever growing population, whilst on the other, changes to the climate system are bringing storms, floods and heat waves which are diminishing crop yields.\r\n \r\nIn this session we'll take a code heavy (C#) look at what data science can do to help maximize crop yields, at every level, from sowing to harvest; including the interesting question of, \"can we monitor crop health from space?\" (hint: yes we can and it's very cool [grin]).\r\nSo come along to this session and find out how data scientists are helping to save the world from the comfort of their offices.","SessionType":"Regular Session","Tags":["Cloud/Big Data"],"Speakers":[{"Id":"278a8267-dbc1-4f1c-8cf3-f5039c709ef8","FirstName":"Gary","LastName":"Short","GravatarUrl":"//www.gravatar.com/avatar/7df42736bb80d30839269d533000e075"}]},{"Id":2870,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"How to Write and Self-Publish a Financially Successful Tech book","Abstract":"Coming Soon","SessionType":"Pre-Compiler","Tags":["Other"],"Speakers":[{"Id":"658c587b-e064-4087-a54c-d59f72bd76e4","FirstName":"Jason","LastName":"Gilmore","GravatarUrl":"//www.gravatar.com/avatar/0453f338d4cb39a6943df84a4a228a52"}]},{"Id":162,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"HTTPS in 2015","Abstract":"Securing your websites and services using HTTPS has never been more important, or more complicated. In this talk, a former browser Security Program Manager covers the best practices for using HTTPS today.\r\n\r\nTopics covered in this session include ciphers and hash algorithms, forward secrecy, handshakes and protocols, and new browser features like HSTS and PKP. Explore how attackers circumvent HTTPS, and what you can do to help protect your visitors and customers safe from snoops and bad guys.\r\n\r\nSecure all the things!","SessionType":"Regular Session","Tags":["Security"],"Speakers":[{"Id":"4d14071e-02ae-4d75-a05b-ece7839a57c6","FirstName":"Eric","LastName":"Lawrence","GravatarUrl":"//www.gravatar.com/avatar/89c27d27b73dd3690b3dad59f3a539d1"}]},{"Id":1243,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Humanitarian Toolbox Codeathon","Abstract":"Humanitarian Toolbox initiative is a sustainable, ongoing effort aimed at leveraging the expertise and generosity of the global technical community to build, maintain and package solutions needed by response organizations in time of crisis and recovery. \r\n\r\nDevelopers can join us for this two day event to work on projects that have been requested by lead disaster relief organizations. Bring your skills. Write some Code. Save the world.","SessionType":"Pre-Compiler","Tags":["Mobile","JavaScript",".NET"],"Speakers":[{"Id":"103bf551-e89a-4b59-aa30-4164dbc79b16","FirstName":"Bill","LastName":"Wagner","GravatarUrl":"//www.gravatar.com/avatar/810cc26c65707ffd2c6275b2a32345c2"},{"Id":"e27bf0df-5f3f-4a81-a5d2-1c6b60de936b","FirstName":"Tony","LastName":"Surma","GravatarUrl":"//www.gravatar.com/avatar/181a7c08a94174282a8e4af50270df22"}]},{"Id":40,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"I Can’t Believe It’s Not JavaScript!","Abstract":"So maybe you’ve tried CoffeeScript or a framework that is supposed to make JavaScript development more like that of object oriented or functional languages.  Maybe you’ve been frustrated by the lack of good development tools for JavaScript.  Maybe you’re tired of using several languages to develop a web application.  Dart is a new ‘batteries included’ platform for web development that answers all of these problems.  Taking cues from the trends in modern languages, it seeks to create a familiar yet flexible environment without sacrificing performance.   But Dart is more than a language, it’s a platform with tools, libraries and runtimes for writing end-to-end web applications.  It can also be compiled to JavaScript so you can start using it today in modern browsers across devices from desktop to mobile.  ","SessionType":"Regular Session","Tags":["JavaScript"],"Speakers":[{"Id":"24d529f4-0301-423e-85c0-bd8b2d6a25e7","FirstName":"Douglas","LastName":"Starnes","GravatarUrl":"//www.gravatar.com/avatar/6a78aaa9333a1ea6a115da6ecdf37bd9"}]},{"Id":145,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Ignition: Geek Parenting's Lessons Learned…so far","Abstract":"\"A 12yo presenting App Dev at TED? An 11yo presenting Spark to a tech conference? That's crazy; my kids just want to play games!\"\r\n\r\nDo you remember what sparked your interest in technology? Everyone has a different story of how that spark ignited into a fire to #LearnAllTheThings. In this talk, Cori Drew will share the experiences that--as a geek and a parent--left her surprised and enlightened, and will cover tactical ideas of how to ignite that fire in your own kids. \r\n\r\nShare in the retrospective that led her daughter from a video-gaming 7yo to an 11yo speaker, and walk away with concepts of how to carry our passion for programming to our youth.\r\n","SessionType":"Regular Session","Tags":["Soft Skills / Business","Other"],"Speakers":[{"Id":"fbd9b2d4-79d8-4ab8-8bcd-ad84c285d644","FirstName":"Cori","LastName":"Drew","GravatarUrl":"//www.gravatar.com/avatar/aa44c5ab28f9a658629b19ee7eeec627"}]},{"Id":175,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"I'm not lazy, I'm a visionary: the history of computing","Abstract":"\tEveryone in the pantheon of computing pioneers was lazy. Why else do you think people like Charles Babbage, Konrad Zuse, and Howard Aiken created the first computers? In this session, we'll explore the history of the first computers and the people who worked on them. We are in debt to our predecessors, and there is a wealth of information that we can draw from their lives and the computers they created. We'll learn about their approaches to problem solving, their breakthroughs and inspiration, and how you can apply these lessons to your life today.","SessionType":"Regular Session","Tags":["Other"],"Speakers":[{"Id":"8704e418-9971-4226-ab8b-529f4b60f40a","FirstName":"Matthew","LastName":"Groves","GravatarUrl":"//www.gravatar.com/avatar/4b0eb78ea5852ee0f54bfd6a2252c99e"}]},{"Id":9,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Implementing Push Notification Support in your Android App","Abstract":"Google Cloud Messaging (GCM) is a free service that allows you to send data from your server to your Android application.  This can be lightweight messages telling your app there is new data to be fetched from your server or it could be a message containing up to 4kb of payload data. This demo intensive session will walk you through the steps necessary to implement push notification support using GCM inside your Android app. The GitHub repository for this session will be made available beforehand so feel free to bring along your laptop to walkthrough the demos during the session. The following topics will be discussed and demonstrated.\r\n\r\nPrerequisites\r\nSet Up Google Play Services SDK\r\nCreate Google API Project\r\nAdd Google Play Services Library to Your App's Project\r\nCheck for Google Play Services Availability\r\nRegister Your App with GCM\r\nTest Server API Key and App Registration ID\r\nImplement App's Broadcast Receiver and Intent Service\r\nProcess Notification Data in App's Activity\r\nUpdate the App's Manifest\r\nTesting Without a Server\r\n","SessionType":"Regular Session","Tags":["Mobile"],"Speakers":[{"Id":"fce6393b-0186-431f-be91-85ebd2ee453f","FirstName":"Keith","LastName":"Wedinger","GravatarUrl":"//www.gravatar.com/avatar/0f9b63d2b346fe2f928861511057dd35"}]},{"Id":1362,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Improving Software Craftsmanship for Beginners","Abstract":"In this interactive session, you'll learn some of the basic principles and practices of writing better quality code: testing and pairing. You'll work with a variety of partners on coding katas designed to instill best practices that you'll then be ready to apply when next you work on production code. This session is led by the organizers of the Hudson Software Craftsmanship group and provides a great introduction to the afternoon's Improving Software Craftsmanship, Intermediate Edition session (though this is not a prerequisite for that session).","SessionType":"Pre-Compiler","Tags":["JavaScript","Ruby/Rails",".NET","Testing","Java"],"Speakers":[{"Id":"bbd188a8-3b4f-4398-8251-e13cff654fbf","FirstName":"Brendan","LastName":"Enrick","GravatarUrl":"//www.gravatar.com/avatar/228e0f758b8cf2fdc389bad36e466025"}]},{"Id":1363,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Improving Software Craftsmanship, Intermediate Edition","Abstract":"Join your peers and fellow craftsmen in a variety of coding kata and exercises designed to improve your skills as software developers. Led by the organizers of the Hudson Software Craftsmanship group, this interactive session will help you sharpen your tools and learn from others. Experienced developers from all backgrounds are welcome, as are beginners (who might consider attending the morning's Improving Software Craftsmanship for Beginners session, though it's not required). Attendees should already be comfortable with a programming language of their choice and if possible should bring along a laptop computer with their development tools installed, including a unit test tool. This session will focus on group/pair design, refactoring, and application of design patterns to improve the design of existing software.","SessionType":"Pre-Compiler","Tags":["JavaScript","Ruby/Rails",".NET","Testing","Java"],"Speakers":[{"Id":"bbd188a8-3b4f-4398-8251-e13cff654fbf","FirstName":"Brendan","LastName":"Enrick","GravatarUrl":"//www.gravatar.com/avatar/228e0f758b8cf2fdc389bad36e466025"}]},{"Id":2615,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"In-Memory Database Pros and Cons","Abstract":"In the beginning, computers were monolithic. They ran everything in one small memory space. Over time, as data needs grew, the \"data base\" evolved and that changed the nature of our business dramatically. Some argue that the gulf between applications and databases, sometimes called an impedence mismatch, amounts to a quagmire that pollutes, slows and makes error-prone everything that we do. But memory has gotten insanely cheap, making it possible to put entire databases back into the memory where your applications run. This changes everything in both positive and negative ways. In this highly-interactive session, we'll examine several in-memory database options for the .NET platform. We'll examine the pros and cons of various implementations and talk about the kinds of problems and promises one can expect from the shift back to this kind of computing model.","SessionType":"Regular Session","Tags":[".NET"],"Speakers":[{"Id":"f9d2a18c-9b3b-4a4c-a74c-325e7ad2e91b","FirstName":"Kevin","LastName":"Hazzard","GravatarUrl":"//www.gravatar.com/avatar/1bfa9dd2f31b30c11c0dc0de8d623a74"}]},{"Id":2390,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Integrating User Experience and Agile","Abstract":"Many companies mistakenly view Agile as nothing more than a process or methodology that will solve their development woes and permit them to launch better software faster. In this presentation Bermon will focus on sharing Agile as a way to think about how to software could be created and ways user experience can be integrated. UX practitioners, designers, and developers are all welcome.\r\n\r\nAttendees will discover:\r\n\r\n• a better definition of User Experience and the disciplines involved\r\n• a brief explanation of Agile\r\n• difficulties that exist when integrating user experience and Agile\r\n• ways to improve integrating user experience in an Agile setting","SessionType":"Regular Session","Tags":["Design (UI/UX/CSS)"],"Speakers":[{"Id":"ec702929-7713-447c-8ac3-459d1db5a8a2","FirstName":"Bermon","LastName":"Painter","GravatarUrl":"//www.gravatar.com/avatar/7559f6cff1f5efc2d210965febd4d71c"}]},{"Id":2874,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Intro to Node.JS","Abstract":"Coming Soon","SessionType":"Pre-Compiler","Tags":["JavaScript"],"Speakers":[{"Id":"6136f4c0-6991-4a55-a6e3-3e39d825da97","FirstName":"Todd","LastName":"Kaufman","GravatarUrl":"//www.gravatar.com/avatar/6d956728ae5a3c71832708c5741cd11d"},{"Id":"5736f80b-9729-40f5-91e3-c45356c7e420","FirstName":"Amber","LastName":"Conville","GravatarUrl":"//www.gravatar.com/avatar/7c2a83b93fe0e5f2ed4c95c59367259c"}]},{"Id":191,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Introduction to Hadoop","Abstract":"As an industry we are collecting more and more data. At some point we have to be able to make sense of the data. Unfortunately many of the tools we have historically used can not scale up to the terabytes and petabytes we have captured. Hadoop is one of those relatively new technologies that is taking the industry by storm since it has proven to scale by taking advantage of the MapReduce pattern and distributed computing.\r\n\r\nDuring this hands-on tutorial you will provision a Hadoop cluster, write MapReduce jobs and learn how to store and access data via Hadoop Distributed File System (HDFS). You will also learn how cloud providers such as Amazon Web Services’ Elastic MapReduce (EMR) and Microsoft’s Azure HDInsight provide Hadoop as a service.","SessionType":"Pre-Compiler","Tags":["Cloud/Big Data","Java"],"Speakers":[{"Id":"1c0cadcb-c364-49d4-be90-606a931bac15","FirstName":"Christopher","LastName":"Judd","GravatarUrl":"//www.gravatar.com/avatar/46237da22a99f4aab52e802ea2c0728e"}]},{"Id":2861,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Introduction to Spring Framework","Abstract":"As a developer you wanted to get your feet wet with Spring Framework but never had the time?  As a Java developer you will get a chance to build a client / server application using the Spring Framework from end to end.  This will focus on the latest version of Spring and some nice features like web and rest services, persistence, and transactional processing.  The attendee should have a laptop ready to code some Java and Spring applications. ","SessionType":"Pre-Compiler","Tags":["Java"],"Speakers":[{"Id":"640c4948-0a02-4dd2-b05a-2bd4c408872e","FirstName":"David","LastName":"Lucas","GravatarUrl":"//www.gravatar.com/avatar/0ce4bb9448103f7554520903f53c16bd"}]},{"Id":2407,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"It’s OK to Talk to Strangers","Abstract":"Tired of job boards and recruiter spam? There’s a better way to manage your career growth. Networking is something that doesn’t come naturally to most people, but it’s a tool that everyone should have in their tool belt. In this talk, you’ll learn tips for growing your professional network online and offline. You’ll also learn strategies for intentionally fostering relationships. A good network means fewer strangers, more free lunches, and a better path to finding your next opportunity.","SessionType":"Regular Session","Tags":["Soft Skills / Business"],"Speakers":[{"Id":"3454f46e-f69b-415e-9630-f63869274d16","FirstName":"Cassandra","LastName":"Faris","GravatarUrl":"//www.gravatar.com/avatar/b1701edf89eb84687a4c41f0d3161f07"}]},{"Id":189,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"It's Cheaper than Therapy: Building an \"ELIZA\" Psychotherapist App ","Abstract":"​In introductory artificial intelligence classes, every good nerd learns about ELIZA, a program which simulates a Rogerian psychotherapist using pattern-matching techniques.  For example, a comment like \"I hate my job\" might get an answer like \"Why do you hate your job?\"  ELIZA was famous for being one of the first programs to pass the Turing test, meaning that the dialogue was realistic enough that users assumed that it was a human and not a machine speaking back to them.  This talk will introduce these basic concepts and history, and show an implementation of ELIZA as a Windows Store app for Windows 8.  We will talk to her in a mock therapy session, so you will learn something about early artificial intelligence and perhaps something about yourself.  :)  ","SessionType":"Regular Session","Tags":["Mobile",".NET"],"Speakers":[{"Id":"f4084f68-86e4-410c-90b3-3712e9b71d91","FirstName":"Jennifer","LastName":"Marsman","GravatarUrl":"//www.gravatar.com/avatar/36fa3107bdff153bf46f9e80aefc9fbd"}]},{"Id":120,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Java EE 7 with JavaScript/HTML5 Rich Clients","Abstract":"The sea change in HTML5 is poised to shift the pendulum away from today's thin-client based server-side web frameworks like Struts 2 and JSF to JavaScript powered rich clients. With strong support for REST, WebSocket and JSON, Java EE is well positioned to adapt to this landscape. \r\n\r\nIn this heavily code driven session, we will show you how you can utilize today's most popular JavaScript rich client technologies like AngularJS, Backbone, Knockout and Ember to utilize the core strengths of Java EE using JAX-RS, JSR 356/WebSocket, JSON-P, CDI and Bean Validation.","SessionType":"Regular Session","Tags":["JavaScript","Java"],"Speakers":[{"Id":"2cfa958b-3295-4389-8ccd-3a7e245c19d6","FirstName":"Reza","LastName":"Rahman","GravatarUrl":"//www.gravatar.com/avatar/dbb54fd15f057dd9967e80e0afb660cc"}]},{"Id":125,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Java EE 8: A Community Update","Abstract":"Java EE 7 is here and the horizons for Java EE 8 are emerging. In order to solidly kick start Java EE 8, the GlassFish team conducted a series of community surveys. This session shares the content, results and analysis of these surveys. We will also share the detailed progress of Java EE 8 technologies already underway. The goal is to foster interest, discussion and participation around Java EE 8.\r\n\r\nSome of the items covered include HTTP 2, Server-Sent Events (SSE), JSON binding, JCache, CDI/EJB alignment, cloud, PaaS, multitenancy/SaaS, JMS 2.1, JAX-RS 2.1, CDI 2, security simplification, REST management/monitoring, an action-oriented Web framework and much, much more.\r\n\r\nYou are encouraged to bring your questions, comments and ideas. The time to get involved in shaping the future of Java EE is now!","SessionType":"Regular Session","Tags":["Java"],"Speakers":[{"Id":"2cfa958b-3295-4389-8ccd-3a7e245c19d6","FirstName":"Reza","LastName":"Rahman","GravatarUrl":"//www.gravatar.com/avatar/dbb54fd15f057dd9967e80e0afb660cc"}]},{"Id":2772,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"JavaScript Everywhere - Learn to Build a Cross-platform JavaScript Application that Works EVERYWHERE","Abstract":"JavaScript has quickly become the language to write code in that you want to be able to share between services on the web, in Windows, and on mobile devices. Join Jeff as he walks you through constructing a JavaScript application and development techniques allow you to migrate from ASP.NET and the web to Windows 8, Windows Phone, iOS, and Android. You'll see how to quickly JavaScript can be used cross-platform, and you'll learn how to take your SOLID development practices to another level by targeting every platform with your next application.","SessionType":"Pre-Compiler","Tags":["Mobile","JavaScript"],"Speakers":[{"Id":"d0eb7797-6edf-46ce-8836-5d2dc35c9a2b","FirstName":"Jeff","LastName":"Fritz","GravatarUrl":"//www.gravatar.com/avatar/2e28be7d89784a88cfc2a0d8c8425c43"}]},{"Id":2600,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Keeping Secrets: Using Encryption Effectively","Abstract":"We all want to protect data that is entrusted to us. Whether we are required to protect sensitive information because of regulations or just to keep the trust of our users a good understanding of encryption is essential. In this session we will work through common data encryption scenarios and use encryption techniques to ensure that your data stays protected. We will also review common mistakes when using encryption and learn how to avoid them. Additionally, we will discuss techniques to guard against tampering and how to maintain the security of our data over the long term.\r\n","SessionType":"Regular Session","Tags":["Security"],"Speakers":[{"Id":"cadd8800-73bc-4f57-900c-3e25f0d58a83","FirstName":"Joe","LastName":"Kuemerle","GravatarUrl":"//www.gravatar.com/avatar/fec6a312fc2dff26897c287bd941cdd8"}]},{"Id":2875,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Keeping the bad guys out: an introduction to application security","Abstract":"Coming Soon","SessionType":"Pre-Compiler","Tags":["Security"],"Speakers":[{"Id":"31dcfbce-f346-47c8-8f3a-0e240deb9c0c","FirstName":"Jim","LastName":"Manico","GravatarUrl":"//www.gravatar.com/avatar/04b8fca2c8dde2ed82373ade37e9789d"}]},{"Id":2394,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Killing Zombies With Your GPU","Abstract":"Father and son makers Steve and Zack Sneed have been making cool, interactive Halloween games in their laboratory for the  trick-or-treaters that visit their house.  Each year, the game is a complete grounds-up build and gives the team the chance to hack together various cool technologies such as Wii remotes, pneumatics, servos, and computer vision.  In this session, the Sneeds will cover the game design principles they follow and will show off some of the tech they've hacked together, including using OpenCV to build a game that uses $2 rubber balls as input devices to a zombie game in .Net.  This session will be fun and the audience will be expected to play some of the games discussed.   During the session, the team will create a new game for a large-scale audience, just for CodeMash!","SessionType":"Regular Session","Tags":["Design (UI/UX/CSS)","Hardware",".NET"],"Speakers":[{"Id":"c2d0ae15-a48a-4e72-bc7b-ddc209d07915","FirstName":"Steve","LastName":"Sneed","GravatarUrl":"//www.gravatar.com/avatar/a765aa94c4f265c17101f85a3bb74d80"}]},{"Id":1377,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Konnect with Kinect","Abstract":"Kinect for Windows is more than just another fancy webcam and XBox One peripheral.  Kinect is a 3D scanner, a directional microphone, infrared camera, and a whole lot more.  This session will demonstrate the capabilities of the Kinect and show how easy it is to write your own custom applications.    We will also explore practical business uses of Kinect and learn how this is more than just a gimmick gaming device.","SessionType":"Regular Session","Tags":["Hardware",".NET"],"Speakers":[{"Id":"55b87da0-a7e7-401b-826c-26c1b45f83f2","FirstName":"William","LastName":"Fink","GravatarUrl":"//www.gravatar.com/avatar/649871d23b5b14b92682180172e3fd8f"}]},{"Id":1263,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Landing on SOLID ground : Surviving on Mars through better coding practices","Abstract":"You are assigned to a small team to maintain and support an increasingly complex mars rover system. For mission critical systems, code quality is paramount. How will you issue commands, avoid obstacles, and fight off the newly discovered Martians without ending up with a fragile code base?  Through a series of kata exercises you will have the opportunity to apply each of the SOLID principles of object-oriented design to handle all the new challenges that await as you explore a new world.\r\n\r\nParticipants should come prepared with their laptop and a development environment setup to work in either C# or Java. Code bases for these platforms will be provided.\r\n","SessionType":"Pre-Compiler","Tags":[".NET","Java"],"Speakers":[{"Id":"d5a30e68-62b6-4ac8-a056-65cdc90f7688","FirstName":"Philip","LastName":"Jordan","GravatarUrl":"//www.gravatar.com/avatar/0766e6c7ef5a9ab36172d5f6ddbfcbed"},{"Id":"a4597a37-a931-4210-b019-b77dfe13c76d","FirstName":"Nicolas","LastName":"Martin","GravatarUrl":"//www.gravatar.com/avatar/ad59d57cd22aa72322cd3131e36629bc"}]},{"Id":2442,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Lessons Learned from a Long Lived Codebase","Abstract":"StructureMap is the oldest, continuously used IoC container for .Net.  In the course of 10+ years developing and evolving StructureMap, I've learned a lot of painful lessons about the design decisions that can make modification and extension harder, hamper usability, and how to shoot yourself in the foot over performance.  I’ve had a front row seat to how our ideas about framework and tooling usability have changed from out of control Xml configuration to way too many attributes to fluent interface “experimentation” to using conventional approaches and simpler API's.  Unfortunately, I’ve created usability problems and hidden framework behavior that I’ve had to fix over the years and I’ve had to learn how to cater to user’s problems rather than the internal details of the framework.  I’ve had to continuously work over the diagnostic capabilities of StructureMap to try to unravel nasty “why won’t this work!” episodes.  In short, come to this talk and I might be able to help you dodge some of the problems I’ve faced over the past decade.","SessionType":"Regular Session","Tags":[".NET"],"Speakers":[{"Id":"5c43507c-a53e-452c-b0d0-0432fdfc35cd","FirstName":"Jeremy","LastName":"Miller","GravatarUrl":"//www.gravatar.com/avatar/83a17261fd4c9f537e63165df6ba57bb"}]},{"Id":2463,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Level Up Your JavaScript","Abstract":"You've been using jQuery for years. You've got a well-worn handful of plugins and libraries you pull off the shelf to solve common problems. (Or you know how to Google for a new one when you need it.) Maybe you're even into MVC (Angular, Backbone, Knockout, etc.) or use RequireJS.\r\n\r\nBut do you really know JavaScript? Have you ever read through some of that third-party code? Do you understand \"this\"? What's an IIFE? What does \"use strict\" do? How do you use Promises?\r\n\r\nCome to a deeper understanding of these topics - and more - and you too can level up your JavaScript!","SessionType":"Regular Session","Tags":["JavaScript"],"Speakers":[{"Id":"a9577010-0c95-44c6-9cce-654bdad3c0da","FirstName":"Anthony","LastName":"Bennett","GravatarUrl":"//www.gravatar.com/avatar/9c267751e01a65adfcf6942c565656fe"}]},{"Id":66,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Life after Objects: Functional Programming in Ruby","Abstract":"Ruby is well-known for its powerful object-oriented features. Less well-known is that it also includes all the features you need to code in a purely functional style. This talk will start with a description of functional techniques including higher-order functions, partial function application, recursion, and use of immutable data structures. You'll see how Ruby 2's lazy enumerators can speed up your code, often dramatically. Finally, you'll see how to combine these techniques into an idiomatic functional style through demonstration of a clever algorithmic video game solver.","SessionType":"Regular Session","Tags":["Ruby/Rails","Functional Programming"],"Speakers":[{"Id":"44fb9750-c690-417d-839e-3587f3fd9f50","FirstName":"Brad","LastName":"Urani","GravatarUrl":"//www.gravatar.com/avatar/8282ac14fc49ed24575362a2271debbe"}]},{"Id":2698,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Locking Out the Abominable Snowman in iOS","Abstract":"This session will educate the user on how to use the Parse.com user service in their own iOS application.  The first step in using Parse will be to create a login screen that will allow the user to register.  Once registered and logged in, Parse will track some analytics on the frequency of the screens being used.  A GitHub repository will be available for future reference of both Objective-C and Swift code bases.","SessionType":"Regular Session","Tags":["Mobile"],"Speakers":[{"Id":"64ae5793-e96a-4b39-b1ee-73e27b037d49","FirstName":"Don","LastName":"Miller","GravatarUrl":"//www.gravatar.com/avatar/149b85ac6ec0a542d368fb821bfaddf2"}]},{"Id":2435,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Looking for Logs in all the Wrong Places: How ELK makes logging powerful","Abstract":"ElasticSearch, Logstash, and Kibana (ELK) combine to make arbitrary and disparate logs accessible in one convenient and indexed location.  When logs from different servers and applications are combined, the real power of logging becomes apparent.  Using these 3 open-source technologies can super-charge real-time tracing, as well as enable mid and long-term trending analysis.  ELK can even make logs interesting to Business and Product Analysts.  \r\n\r\nThis session will highlight the simplicity and flexibility of ELK.  The session will also show how OCLC used minor changes to the application logging to enhance event correlation, as well as the benefits the organization realized by moving logs through ELK.\r\n","SessionType":"Regular Session","Tags":["Cloud/Big Data","Other"],"Speakers":[{"Id":"8b72c588-1d4c-4ae3-ae74-52cfdc21f873","FirstName":"Jonathan","LastName":"Baker","GravatarUrl":"//www.gravatar.com/avatar/fc19a1ff4cf29d634bef2e36d3ef986b"}]},{"Id":161,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Lucking In: Growing Fiddler from a side-project to my full-time job","Abstract":"In 2003, a new hire at Microsoft was happily toiling away in obscurity working on an online service. On nights and weekends, he built a little tool to help the team test the site. And then things got interesting.\r\n\r\nIn this talk, Fiddler-builder Eric Lawrence explains how Fiddler grew from a rough side-project to a powerful and popular tool used by millions worldwide. After a brief overview of its technical evolution, the session covers never-before-revealed details about how Fiddler \"escaped\" from Microsoft and the long and stressful acquisition process. He shares lessons learned, what he'd do differently today, and inspiration for others hoping to convert their passion into their full-time job. \r\n\r\nIf you've ever wanted to peek \"behind the scenes,\" you'll enjoy this session.","SessionType":"Regular Session","Tags":["Soft Skills / Business"],"Speakers":[{"Id":"4d14071e-02ae-4d75-a05b-ece7839a57c6","FirstName":"Eric","LastName":"Lawrence","GravatarUrl":"//www.gravatar.com/avatar/89c27d27b73dd3690b3dad59f3a539d1"}]},{"Id":2878,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Making Awesome with Oculus Rift","Abstract":"Placeholder abstract. Title may change, but this session will be about developing with the Oculus Rift VR headset.","SessionType":"Regular Session","Tags":["Hardware","Other"],"Speakers":[{"Id":"30175927-4dbd-452b-b2f5-ad2c090b3069","FirstName":"Nathalie","LastName":"Goh-Livorness","GravatarUrl":"//www.gravatar.com/avatar/0f68238dc4fbb497f73db5285a4f34d0"}]},{"Id":2872,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Making our world a smarter place with IoT","Abstract":"Coming Soon","SessionType":"Pre-Compiler","Tags":["Hardware",".NET","Other"],"Speakers":[{"Id":"dfbd02fc-356e-4827-893c-68b80db32f0c","FirstName":"Josh","LastName":"Holmes","GravatarUrl":"//www.gravatar.com/avatar/753ffc832ca4bc9f15e9e5ca90c93404"},{"Id":"96009c83-75bc-4e7f-a4d2-b34cbf093d8c","FirstName":"Ivan","LastName":"Judson","GravatarUrl":"//www.gravatar.com/avatar/e18b7b1b1267bca5ff9395b0d21447e5"}]},{"Id":1264,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Metaprogramming on the .NET Platform","Abstract":"Metaprogramming is the arching principle for techniques where code does more than the strict interpretation of the computer language. It encompasses strategies as diverse as code generation, Aspect Oriented Programming (AOP), Domain Specific Languages (DSL), and runtime code creation. The new .NET Compiler as a Service (Roslyn) opens up opportunities in metaprogramming by making it practical to explore and create syntactic and semantic trees. This day starts with metaprogramming principles and an overview of techniques. The afternoon dives deep into a single easily accomplished approach to metaprogramming – code generation. You’ll learn how to think about your code as a set of patterns, unique input to those patterns and handcrafted customizations. You’ll learn more about working with the complexities of the Roslyn trees and creating custom built interfaces to simplify access to the information, for a specific purpose. You’ll leave able to create strongly typed code-first style input to your own templates and provide rich customization points that maintain application integrity. Use these techniques to remove the boring, stupid parts of application development. ","SessionType":"Pre-Compiler","Tags":[".NET"],"Speakers":[{"Id":"0858d0e5-564d-494d-aed6-8d5f744ebe37","FirstName":"Kathleen","LastName":"Dollard","GravatarUrl":"//www.gravatar.com/avatar/85ffa8bf46389d3c399196f3497bd626"}]},{"Id":1314,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Migrating to Android TV","Abstract":"A talk discussing what needs to occur in order to take your existing Android application and have it work well on Google's new Android TV platform.   Topics discussed will focus on optimizing your apps for Remote Control, Game Pad, and Voice inputs.   As well as experiences from taking an existing application developed for Google TV and Tablets and migrating it to work on Google's reference development device for Android TV.\r\n\r\nWe'll review the various design patterns, the android leanback library, and discuss when it may be beneficial to think outside of the guidelines, but not too far.","SessionType":"Regular Session","Tags":["Mobile"],"Speakers":[{"Id":"919bfa57-d844-4cff-bf89-e88957489b60","FirstName":"David","LastName":"Carver","GravatarUrl":"//www.gravatar.com/avatar/fdec28d17fb2417999492a96fb338eae"}]},{"Id":202,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Mobile Authentication in the Web World","Abstract":"Now that mobile apps are invading the enterprise, and security breaches are a reality, an authenticated login is vital. When building web sites, login security gets taken for granted, because the browser utilizes lots of security mechanisms with built-in functionality created by armies of developers over many years. Mobile apps don't quite get this for free. Mobile authentication should leverage mechanisms and technologies already in place in web apps instead of inventing something new, despite every developer's innate inclination to do just that. Native mobile developers have to code something specific to make web-based authentication work, that's the point of this presentation. Learn about authenticating mobile apps against web servers using OAUTH, HTTPS, NTLM, derived credentials, and anything else with a snazzy acronym. Demonstrations will use your platform as long as it's iOS or Android.","SessionType":"Regular Session","Tags":["Mobile","Security"],"Speakers":[{"Id":"5bd32894-f84d-45fc-9d79-a9cff2afa852","FirstName":"David","LastName":"Truxall","GravatarUrl":"//www.gravatar.com/avatar/555338823dc02d51083a3fdba2852960"}]},{"Id":2773,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Mobile Craftsmanship: Technologies to elevate cross-platform native mobile development","Abstract":"When it comes to mobile development, it can feel like \"best practices\" in  software development have been left behind. Devs may be able to quickly launch flashy prototypes, but this approach won’t solve larger challenges often found in many organizations. \r\n\r\n\"Best practices” in the web-application development world have taken years to reach where they are today. Now it’s time to progress these techniques into the mobile space, as well. This isn’t amateur hour anymore.\r\n\r\nThis session will address some of those “gaps” by taking a look at technologies that expediently bridge the divide. Highlights include: \r\n\r\n- Sharing application code between native mobile apps for Android, iOS, and Windows Phone using Xamarin Forms.  \r\n- Writing unit tests for cross platform mobile applications.\r\n- Ensuring you’re building the right software by writing automated, cross platform acceptance tests using Calabash.","SessionType":"Regular Session","Tags":["Mobile",".NET","Testing"],"Speakers":[{"Id":"19b2188e-0c00-4a5f-8870-59f5a80bd331","FirstName":"Derek","LastName":"Hubbard","GravatarUrl":"//www.gravatar.com/avatar/7d53dab9481077cad8b32937ff12cd49"}]},{"Id":2696,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Modeling Your Applications Based on Airport Operations.  Yes, even the TSA Part.","Abstract":"If you’ve only spent a small amount of time in an airport, then you may have missed the tight orchestration it takes to get you - and your bags - from Point A to Point B.  You seem to go from one line to the next - waiting for your turn to be processed.  Getting your boarding pass in one line, x-rayed in another, snacks in another.  Each line you stand in is completely unrelated to all the other lines, yet, they each play an important role in the overall process of getting you to your destination.  Building scaleable distributed applications has many of those same characteristics.  Seemingly disjointed, independent processes that work together to perform a larger function.  This talk will focus on the design characteristics of this approach and include some real world examples using Golang, Docker & RabbitMQ - though this technique is tool agnostic.  The airport metaphor will be stretched to the limit and there are sure to be some groan-worthy examples.","SessionType":"Regular Session","Tags":["Cloud/Big Data","Other"],"Speakers":[{"Id":"cad83e09-d051-4a08-97ee-4532d7e03df4","FirstName":"William","LastName":"Klos","GravatarUrl":"//www.gravatar.com/avatar/bfb804e585be282f398765068688a7ed"}]},{"Id":78,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Modelling complex game economy with Neo4j","Abstract":"The challenge of modelling and balancing the economy of a large scale game is one of the biggest problems game developers face and one that many have tried to solve by simply throwing man-hours at it... But there's a better way! \r\n\r\nLearn how Gamesys does it by leveraging graph database Neo4j to model the in-game economy of their MMORPG \"Here Be Monsters\" and automate the balancing process. In this session Yan Cui will discuss lessons learned, successes and challenges, and how a graph database enables a small team of game designers to stay agile and focused on delivering new content to players.","SessionType":"Regular Session","Tags":["Cloud/Big Data"],"Speakers":[{"Id":"1ed75aea-1301-40c3-8d0d-af03a2763414","FirstName":"Yan","LastName":"Cui","GravatarUrl":"//www.gravatar.com/avatar/0bbaed5a18c131ba152cf566e1becaf8"}]},{"Id":75,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Multitasking Support on the iOS Platform","Abstract":"Ever wondered how some of the apps on your iPhone/iPad always seem to launch with up-to-date information from the server? Or how the download of large file completes even after you switched out of the app to a different one while the download is still in progress? Find out how these and other such capabilities are enabled in this talk on multitasking support on the iOS platform. \r\nMultitasking is the ability to run multiple apps on the device at the same time.  Previously available in restricted form to a certain category of apps, now with iOS7, Apple introduced some powerful advancements to this feature. The platform now uses an intelligent algorithm that guarantees optimal battery usage while ensuring that all apps get a fair chance to run in the background. Making this even more powerful is the ability for data transfers to occur even when the app is not running! \r\nThis talk will discuss and demonstrate the multitasking capabilities  on the iOS platform and the APIs that you can leverage to support these capabilities within your own apps.\r\n This talk is recommended for anyone developing or interested in developing apps for the iPhone/iPad.\r\n","SessionType":"Regular Session","Tags":["Mobile"],"Speakers":[{"Id":"5d0de5e1-109e-4a9f-83e6-8edf5fdf00f6","FirstName":"Priya","LastName":"Rajagopal","GravatarUrl":"//www.gravatar.com/avatar/01c9d267e78a30758e8ce4a8735833e5"}]},{"Id":80,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"My adventure with Elm","Abstract":"Reactive Extensions (Rx) has brought reactive programming to the mainstream in recent years with successful adoption in languages such as C#, Java and JavaScript. But have you ever wondered what Rx will look like as a language?\r\n\r\nElm is a new programming language based on the idea of Functional Reactive Programming (FRP). Elm lets you create highly interactive web applications without all the messy callbacks tangling around shared states.\r\n\r\nIn this talk Yan Cui will give a gentle introduction to Elm and share his experience learning the language and how he used Elm to recreate Missile Command in less than 250 LOC. You will leave this session with a handle on the Functional Reactive paradigm and a basic understanding of Elm.","SessionType":"Regular Session","Tags":["Functional Programming"],"Speakers":[{"Id":"1ed75aea-1301-40c3-8d0d-af03a2763414","FirstName":"Yan","LastName":"Cui","GravatarUrl":"//www.gravatar.com/avatar/0bbaed5a18c131ba152cf566e1becaf8"}]},{"Id":2744,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"New to Native? - Getting Started with iOS Development","Abstract":"Reviewing examples of some of the more popular applications available today on the App Store, this presentation will prepare developers by introducing some basic building blocks for creating rich applications that pop. Focusing on getting the ground work in place by addressing some common View Controller options, this presentation will build upon the fundamentals by exploring some hurdles like working with the keyboard in a TextView, creating a custom AlertView, getting a Buttons color just right, and controlling various 'outlets' and properties programmatically for different user interactions. We will also look at some basic Core Animation examples that can be utilized to make even the most drone of applications come to life and enhance the overall user experience.","SessionType":"Regular Session","Tags":["Mobile"],"Speakers":[{"Id":"3cb8e713-ebfa-4b96-b4cd-2d22d96346e4","FirstName":"Geoffrey","LastName":"Goetz","GravatarUrl":"//www.gravatar.com/avatar/940906757c2b8631cab8b60f4adb61a3"}]},{"Id":133,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Next Generation XSS Defense with Java","Abstract":"Cross Site Scripting Defense is difficult. The Java Programming language does not provide native key defenses necessary to thoroughly prevent XSS. As technologies such as Content Security Policy emerge, we still need pragmatic advice to stop XSS in legacy applications as well as new applications using traditional Java frameworks. First generation encoding libraries had both performance and completeness problems that prevent developers from through, production-safe XSS defense. This talk will deeply review the OWASP Java Encoder Project and the OWASP HTML Sanitizer Project and give detailed code samples highlighting their use. Additional advice on next-generation JavaScript and JSON workflows using the OWASP JSON Sanitizer will also be reviewed.","SessionType":"Regular Session","Tags":["Security","Java"],"Speakers":[{"Id":"31dcfbce-f346-47c8-8f3a-0e240deb9c0c","FirstName":"Jim","LastName":"Manico","GravatarUrl":"//www.gravatar.com/avatar/04b8fca2c8dde2ed82373ade37e9789d"}]},{"Id":2687,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"No More Static Comps: Design Process in the Modern World","Abstract":"The design landscape is much wider now than ever before: apps for devices of various sizes, smart tvs, game consoles, and an ever increasing number of platforms and resolutions have led the industry to broadly adopt responsive design as a tool. However, the design process has not kept up. Too often static comps are used as the only touchpoint between designers and decision makers, presenting the designs in an out of context and limiting format. What needs to be done is to adapt each step of the design process to convey scaling, device context, motion and interactivity to give a more realistic idea of how the designs work. Case studies and tools for prototyping and creating interactive mockups will be examined, and a discussion of how to revamp current processes for an ever changing design world.","SessionType":"Regular Session","Tags":["Design (UI/UX/CSS)"],"Speakers":[{"Id":"0cb77264-4c9d-473a-95d4-7735106631ad","FirstName":"Eric","LastName":"Browning","GravatarUrl":"//www.gravatar.com/avatar/e7553f804fdd69cf5a39bba0c8834686"}]},{"Id":1338,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Nobody Will Train You but You","Abstract":"Why do we all know a developer who has been pounding out unmaintainable code for a decade or more? Why do people \"believe in TDD but I don't have time to write tests during crunch?\" How is it that we have an entire industry based around rescuing teams from acutely awful Rails apps? \r\n\r\nIt's because on the job experience is a poor teacher; plateauing as soon as the developer is able to ship code that meets requirements. Schools teach Computer Science which is only tangentially related to being a developer and most kata's are approached incorrectly, giving no value at best, and reinforcing poor practices at worst. On top of all this, our pairs (for the lucky ones who pair program) probably have not shown us anything new in months.\r\n\r\nThis presentation will give specific, concrete steps on how to slowly and steadily improve our game through practice and hard work. I'll identify what skill Rails developers should be focusing on and walk the audience through how to target and eliminate these weaknesses so that nothing but white hot joy streams out of our fingers and into our apps. There's no magic here, no secrets, and no hacks; just you and me working our butts off until we suck a little less.","SessionType":"Regular Session","Tags":["Ruby/Rails"],"Speakers":[{"Id":"55051bcd-69d3-487e-822d-9025cf3b0c86","FirstName":"Zach","LastName":"Briggs","GravatarUrl":"//www.gravatar.com/avatar/dfe1da2a83fe42aa8a07df1f0071becb"}]},{"Id":2869,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Node Bots","Abstract":"A lab filled with $5,000 of robot parts, electronics, and sharks with lasers. Come build a robot, from scratch, program it, and battle it out. No evil scientist knowledge is required. More details soon.\r\n\r\nSeats will be limited. Instructions will follow in December on how to reserve a seat.","SessionType":"Pre-Compiler","Tags":["Hardware","JavaScript"],"Speakers":[{"Id":"ab8fb375-33a8-43b0-b401-5cbbda699c12","FirstName":"Brian","LastName":"Genisio","GravatarUrl":"//www.gravatar.com/avatar/170325813beddd7418a3b55ffbf378f9"}]},{"Id":1220,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Object-Oriented JavaScript (yes, it really exists)","Abstract":"What's that you say? You don't like working in JavaScript because you can't code like you want to with capital \"O\" Objects all over the place? Sure you can. More and more people are starting to realize how powerful this little language can be - start your re-education with this session and learn all about OOP in JS. First, we have to accept that while JavaScript may exhibit some characteristics of a functional language, it is really a multi-paradigm language with strong support for Object-Oriented Programming concepts.\r\n\r\nThis talk will give attendees a crash course in Object-Oriented JavaScript covering:\r\n* core OOP principles\r\n* the prototype object and constructors\r\n* member access types (public, private, & privileged)\r\n* prototypical inheritance\r\n* interfaces (mixins)\r\n\r\nDevelopers will come out of this session ready to implement core OOP concepts in JavaScript, with knowledge of how inheritance in JavaScript differs from many of the other languages they know.","SessionType":"Regular Session","Tags":["JavaScript"],"Speakers":[{"Id":"f76c74ea-5a60-4c0a-b5d0-f008ce85edec","FirstName":"Jordan","LastName":"Kasper","GravatarUrl":"//www.gravatar.com/avatar/f441bc8d508101ba0a1eac95d6cd52c6"}]},{"Id":207,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Open Source Software : From Zero to Sixty","Abstract":"Glimpse, an open source web application diagnostics tool, went from a rough back-of-a-napkin idea to a project with tens of thousands of users and developer media attention within a period of eight weeks. Join Glimpse’s co-founder, Nik Molnar, for an honestly raw tale of the pains and lessons learned that arose managing an open source project. Along the way, Nik will cover the tools and techniques that have proven successful over the past two years developing Glimpse, focusing on technical challenges and best practices for community management, communications and open source/life balance. \r\n\r\nThis session is suitable for founders, maintainers, contributors and all users of open source software and aims to spark conversation around the best way to foster open source and open source etiquette.","SessionType":"Regular Session","Tags":["Soft Skills / Business"],"Speakers":[{"Id":"aa1db9b6-4149-4d00-9e41-668496b6e8f9","FirstName":"Nik","LastName":"Molnar","GravatarUrl":"//www.gravatar.com/avatar/e07a27ec61977c7c686feaa799b1cf6e"}]},{"Id":132,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"OWASP Top Ten Proactive Approaches to Software Security","Abstract":"The OWASP Top Ten Proactive Controls is a list of security techniques that should be included in every software development project. They are ordered by order of importance, with control number 1 being the most important. This document was written by developers for developers to assist those new to secure development.\r\n\r\n1: Parameterize Queries\r\n2: Encode Data\r\n3: Validate All Inputs\r\n4: Implement Appropriate Access Controls\r\n5: Establish Identity and Authentication Controls\r\n6: Protect Data and Privacy\r\n7: Implement Logging, Error Handling and Intrusion Detection\r\n8: Leverage Security Features of Frameworks and Security Libraries\r\n9: Include Security-Specific Requirements\r\n10: Design and Architect Security In","SessionType":"Regular Session","Tags":["Security"],"Speakers":[{"Id":"31dcfbce-f346-47c8-8f3a-0e240deb9c0c","FirstName":"Jim","LastName":"Manico","GravatarUrl":"//www.gravatar.com/avatar/04b8fca2c8dde2ed82373ade37e9789d"}]},{"Id":1380,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Parenting is Experience Design: The Ultimate Omnichannel Case Study ","Abstract":"Success is coming to those who deliver connected customer experiences. But brands are struggling to reach consumers across channels while battling lagging infrastructures, social immaturity, and talent shortages. When influencers are everywhere and everything is important, how do you find your way through? \r\n\r\nThere is a familiar model to guide us; it's called parenthood.\r\n \r\nParents juggle countless decisions to create consistent experiences that deliver a foundation of well-being and growth. From the worlds toughest job — raising well-rounded, generally nice human beings — we learn how to consider long and short term outcomes, handling risk, and investing in what really matters.\r\n\r\nSuccessful omnichannel models are rare in the current climate of disconnected technologies. I’ll explore how we manage the responsibility to consider every context and touchpoint.","SessionType":"Regular Session","Tags":["Design (UI/UX/CSS)","Soft Skills / Business"],"Speakers":[{"Id":"2955186b-c44a-4954-b910-83ad38341b7f","FirstName":"Gail","LastName":"Swanson","GravatarUrl":"//www.gravatar.com/avatar/b8894bd7c9a53e2ed28a79e796fca819"}]},{"Id":1287,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Polyglot Architecture at Scale","Abstract":"Is your codebase growing out of control and becoming difficult to maintain? Do you have too many teams working in that codebase causing scary merge conflicts? Maybe you want to write that new feature with Node.js but don't want to convert everything to javascript.\r\n\r\nIn this talk, you'll be introduced to some infrastructural techniques used at Groupon to increase the scalability and maintainability of applications. You'll learn how those techniques can be used to replace entire monolithic applications one piece at a time with a small application ecosystem. By the end of the talk you'll walk away with an understanding of how to support an effective polyglot engineering team.","SessionType":"Regular Session","Tags":["JavaScript","Ruby/Rails","Cloud/Big Data"],"Speakers":[{"Id":"665c02b7-e021-46ea-8635-e6fa6d9c3818","FirstName":"Dusty","LastName":"Burwell","GravatarUrl":"//www.gravatar.com/avatar/6343ef938226f72218388cb8f0eec754"}]},{"Id":26,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Practical AngularJS","Abstract":"Whether you are building a full blown client-side MV* application, or sprinkling pieces of interactivity throughout an existing traditional server-side MVC application, AngularJS has something for you. We will start with an introduction to Angular fundamentals, follow up with some more advanced topics and finish the day showcasing how to integrate Angular into your project with real world examples in Laravel (PHP), ASP.NET MVC (C#), and Rails (Ruby).","SessionType":"Pre-Compiler","Tags":["JavaScript","Ruby/Rails",".NET"],"Speakers":[{"Id":"6961fce4-af8e-4552-b7da-3571ee1a256a","FirstName":"David","LastName":"Mosher","GravatarUrl":"//www.gravatar.com/avatar/ead076bf445f9b50e3c094300e4690e9"}]},{"Id":199,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Practical iOS App Attack and Defense","Abstract":"Mobile apps are a fixture in today's digital world. With the release of Apple's new Swift language, the barrier to entry to create iOS apps has been lowered and may increase the number of offerings in the App Store. Learn how to find vulnerabilities in today's apps, attack and manipulate them, and finally fix the issue. Explore common mobile vulnerabilities hands-on (or just follow along) through the new open-source, intentionally vulnerable Swift iOS application, Swift.nV (https://github.com/nVisium/Swift.nV). ","SessionType":"Regular Session","Tags":["Mobile","Testing","Security"],"Speakers":[{"Id":"052a2864-680a-4c1a-8f61-3a90146c6fe0","FirstName":"Seth","LastName":"Law","GravatarUrl":"//www.gravatar.com/avatar/61e71f1890242e475617ecaf292978e1"}]},{"Id":2851,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Process Bindings: How to do Node.js on the JVM","Abstract":"Node.js is fast. It's asynchronous. It's Hacker News worthy, and it runs your Javascript on V8. Of course V8 is a great Javascript runtime brought to you by some very talented developers. But what about us poor souls who live our lives on the Java Virtual Machine? With 3 choices available today - Rhino, Nashorn and DynJS, it is possible to run Javascript on the JVM. But what about Node? Node.js is mostly Javascript, so surely it can't be too hard to run it on the JVM. In this talk you'll learn what it take to run your Node.js applications along side your Java bits.\r\n\r\nThe presentation will explore the Node.js process bindings which couple it with  V8. You will see how the Nodyn project (http://nodyn.io) uses these bindings, along with the DynJS Javascript runtime (http://dynjs.org) and Netty (http://netty.io) for asynchronous IO, to provide a viable Node.js environment on the JVM. There will be some code examples, and you'll get a glimpse into the nitty gritty details that make Nodyn and Node.js on the JVM possible. ","SessionType":"Regular Session","Tags":["JavaScript","Java"],"Speakers":[{"Id":"0384c3c8-0c6e-4abd-90d5-7638c9df4fd5","FirstName":"Lance","LastName":"Ball","GravatarUrl":"//www.gravatar.com/avatar/b0690265bd924922c38abcc377748957"}]},{"Id":1303,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Programming with JVM Bytecode","Abstract":"Every Java developer should have a good working knowledge of JVM bytecode. It’s fun, it can help you diagnose problems, improve performance, and even opens the door to building languages of your own. No matter what kind of Java application you work on, you’ll get something out of this talk. \r\n\r\nWe’ll start with bytecode fundamentals. You’ll learn how the most common operations work and see visual representations of how the JVM executes that code. The second part of the talk will introduce Jitescript, a Java library for generating bytecode. You’ll learn how to use Jitescript with some plain old Java code to create your own JVM languages.","SessionType":"Regular Session","Tags":["Java"],"Speakers":[{"Id":"8cbd8e4c-7fc7-4612-a360-12bd2709a5af","FirstName":"Joe","LastName":"Kutner","GravatarUrl":"//www.gravatar.com/avatar/fc9dc18f851317e79ac06ada2d74a99b"}]},{"Id":2482,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Pushing to All the Devices with Azure","Abstract":"An important part of any mobile application is being able to send it notifications and trigger updates that present timely information to users.  Azure Notification Hubs allows you to easily do that for Android, iOS, Windows Phone, and Windows Store applications at scale.  Along with the ability to deliver to millions of devices, you get powerful capabilities like push connection management, push templates, tag based registrations and delivery, and much more.  All of this with up to a million pushes for free and no need to store data in the cloud!","SessionType":"Regular Session","Tags":["Mobile","Cloud/Big Data"],"Speakers":[{"Id":"a406e01a-adf9-4c58-abdc-1284cd8e0923","FirstName":"Chris","LastName":"Risner","GravatarUrl":"//www.gravatar.com/avatar/79729a80454df949aef07edf079a74ef"}]},{"Id":24,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Putting the D&D in TDD","Abstract":"Are you tired of TDD workshops that make you do boring things like calculate bowling scores and prime factors or demonstrate how to win at the game of life? If so, this is the session for you! In this TDD workshop we will be building the domain model for EverCraft -- a new MMORPG from Blizzards of the Coast. We have lots of story cards prepared covering features from combat to magic, classes to spells, and races to items. Plus, we'll be defining some of these cards during the session in case you want that +9 knife of ogre slaying or enjoy casting magic missile at the darkness.\r\n\r\nThis workshop is language agnostic and for all levels of developers. The focus is on TDD and emergent design but pair programming will be covered as well. The only requirement is that you bring a laptop and that you be able to test-drive you code with your language of choice. When you are done you will emerge a better programmer for the experience but there is small chance you will have a craving for Cheetos and Mountain Dew.","SessionType":"Pre-Compiler","Tags":["Other"],"Speakers":[{"Id":"4124580e-cc53-4de0-b9ce-99fc7c3a2e5b","FirstName":"George","LastName":"Walters","GravatarUrl":"//www.gravatar.com/avatar/a9045200c84fc370f06b04bc49047494"}]},{"Id":2745,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Python Koans - An Introduction To Python","Abstract":"Python is a fun, dynamic, flexible language for solving all kinds of problems. It's used everywhere from modest scripts to large systems, powering things like websites, games, film production tools, scientific analysis, and even space programs. Best of all, it's a language that \"fits your brain\".\r\n\r\nThis session is a mostly self guided introduction to Python through koans. What’s a koan you ask? It’s a small puzzle or exercise expressed as a test, designed to build your knowledge of the Python syntax and idioms incrementally.\r\n\r\nStudents will be completing the exercises either with a partner or alone. This allows them to think through the exercise, giving a better foundation on which to build. We'll be there to explain what is happening and why your solution works as well as strategically intervening with relevant discussion about the koans.\r\n\r\nStudents are expected to bring a laptop pre installed with Git and Python (version 2.7 or 3.4).","SessionType":"Pre-Compiler","Tags":["Other"],"Speakers":[{"Id":"850e57a0-798c-4ceb-aaaf-76c0a1144669","FirstName":"David","LastName":"Stanek","GravatarUrl":"//www.gravatar.com/avatar/00574728e2f964ce98a8f3adc826f8c8"}]},{"Id":2711,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Reactive Hypermedia: the API Design of Tomorrow","Abstract":"In the near future, everything will be connected: cities, enterprises, human beings, and more.  This reality is just over the horizon, and it brings one of the largest challenges in building distributed systems.  Today, developers often look to RESTful Web APIs to solve these problems.  Are current trends in API design really prepared to handle the demands of the future?  What’s missing from the equation?\r\n\r\nIn this session, you’ll learn new patterns for modeling Web APIs using state machines, hypermedia, and reactive streams to meet tomorrow’s challenges and make a solid attempt at standing the test of time.\r\n\r\nLearn what you can do to make your API servers more scalable and resilient while allowing API clients to be event-driven and responsive.  A real-world example will be given of how these concepts were used to build Zetta, an open source platform for the Internet of Things.","SessionType":"Regular Session","Tags":["Cloud/Big Data","Other"],"Speakers":[{"Id":"2daa0487-e7c9-4f7b-a869-6ad0618e6371","FirstName":"Kevin","LastName":"Swiber","GravatarUrl":"//www.gravatar.com/avatar/49e2f463432929535e81781f3490336d"}]},{"Id":126,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Reactive Java EE - Let Me Count the Ways!","Abstract":"As our industry matures there is an increasing demand for high-throughput, low-latency systems heavily utilizing event-driven programming and asynchronous processing. This trend is rapidly converging on the somewhat well established but so-far not well understood term \"Reactive\".\r\n\r\nThis session explores how Java EE as a whole aligns with this movement via features and APIs like JMS, MDB, EJB @Asynchronous, JAX-RS/Servlet async, CDI events, Java EE concurrency utilities and so on. We will also see how these robust facilities can be made digestible even in the most complex cases for mere mortal developers through Java SE 8 Lambdas and Completable Futures.","SessionType":"Regular Session","Tags":["Java"],"Speakers":[{"Id":"2cfa958b-3295-4389-8ccd-3a7e245c19d6","FirstName":"Reza","LastName":"Rahman","GravatarUrl":"//www.gravatar.com/avatar/dbb54fd15f057dd9967e80e0afb660cc"}]},{"Id":1357,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Reclaiming agile development: don't let the cat die...","Abstract":"\r\nRegardless of how you feel about felines, dead cats stink. \r\n\r\nWhat also stinks is what is happening to agile development practices.  What started as a movement to increase quality and usefulness of code written, has been professionalized into certificates and ceremonies that are only marginally helping the process.  Instead of blaming political and organizational forces, this humorous and irreverent talk focuses on what team members can do to overcome these corporate obstacles and to get to the spirit of agile through a focus on architectural innovation and personal improvement.  Attendees should expect to laugh, to learn from the experience of implementing dozens of real world enterprise agile teams, and to come out with proven new techniques to try to bring more satisfaction to how they do their work and to bring the focus of agile back to software development.  ","SessionType":"Regular Session","Tags":["Soft Skills / Business"],"Speakers":[{"Id":"b7ad6108-017a-4b46-9ec4-0c25b244f622","FirstName":"Paul","LastName":"Holway","GravatarUrl":"//www.gravatar.com/avatar/4959d2239464d669c0125462a9622dc4"}]},{"Id":1323,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Refactoring in Ruby: Finding the Right Job for the Tool","Abstract":"Your cyclomatic complexity is through the roof. Your application is in danger of flunking out of Code Climate. Rubocop has issued a warrant for your arrest, and there's even whispered talk of declaring bankruptcy on your technical debt. You know that a serious refactoring is needed, but you can't take time out to mount a concerted attack on complexity. How do you break a major refactoring down into manageeable pieces? Do you know where in your tangled codebase to start? This talk will explore a small number of simple, practical tools and techniques useful in identifying problem areas, targeting your refactoring, and most importantly, measuring the results of your efforts.","SessionType":"Regular Session","Tags":["Ruby/Rails"],"Speakers":[{"Id":"3d777f4a-fcea-4211-b2fc-c18637882016","FirstName":"Coraline Ada","LastName":"Ehmke","GravatarUrl":"//www.gravatar.com/avatar/4900754dfff6786e747438a703e0d791"}]},{"Id":2821,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Regular Expressions (now you have two problems)","Abstract":"Be afraid. Be very afraid. For you are about to enter the mysterious and foreboding land of regular expressions. A land of strange-looking hieroglyphics. A land of many flavors and implementations. A land whose inhabitants possess seemingly magical powers over text. But fear no more, for you needn't make the journey alone: a guide and a map await you.\r\n\r\nIn this session, we'll take a whirlwind tour of the features found in most regular expression implementations. We'll dive deep. And take a peek *inside* a regular expression engine. From character literals to character classes, from backreferences to look-around, you'll see every step a regular expression engine takes when it parses text. By the end of the session, you'll be able to think *like* a regular expression engine.","SessionType":"Regular Session","Tags":["Other"],"Speakers":[{"Id":"200a18ec-c7e3-47d2-bd51-24448323eac2","FirstName":"Brian","LastName":"Friesen","GravatarUrl":"//www.gravatar.com/avatar/a89dc515ab07c2b1d169e15b94562432"}]},{"Id":2541,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Ridiculously fast web app development with Angular and Meteor","Abstract":"You may have seen angular. You may have seen Meteor. But did you know you could use them *gasp* together?! In this session we'll see how Angular and Meteor compliment one another perfectly. We'll see how they let you build a real time web app with persistent data in astonishingly little code. We'll demonstrate how you can add authentication via github or twitter almost for free. Finally, we'll see you can deploy your new app to a live server in only a few minutes. Expect to come away being able to build an angular/meteor app and have a blast doing it.","SessionType":"Regular Session","Tags":["JavaScript"],"Speakers":[{"Id":"f729e969-6931-4d46-acfc-c7d0f5a0e0ab","FirstName":"Chris","LastName":"Nelson","GravatarUrl":"//www.gravatar.com/avatar/718dad0c347f01108bfd008bc0a5b4f5"}]},{"Id":2734,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Ruby -the language of DevOps","Abstract":"Ruby is known for Rails and the web. But, it's also the language behind Vagrant, Chef, and Puppet - three of the biggest drivers of the DevOps movement. Come see why this is a key skillset in the new operations. ","SessionType":"Regular Session","Tags":["Ruby/Rails","Other"],"Speakers":[{"Id":"dd474455-d0c2-44f7-9846-ae117f4b80aa","FirstName":"Rob","LastName":"Kinyon","GravatarUrl":"//www.gravatar.com/avatar/8ef20944f3a512224fdb8c14972ca0c2"}]},{"Id":2783,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Rust or: How I Learned to Stop Worrying and Love the Compiler","Abstract":"Dynamic languages promise infinite flexibility, but at what cost? Tired of bugs that are only discovered at runtime, after being shipped to production? Your users are.\r\n\r\nLearn how Rust balances speed and safety by learning from the mistakes of 50 years of computer science history. Safety and flexibility are not incompatible goals. High level APIs and JSON parsing are not limited to dynamic languages written 20 years ago.\r\n\r\nRust 1.0 is hot off the presses. Jump start your skills by learning everything you need to know in order to start producing production ready Rust binaries.\r\n\r\n*No previous exposure to Rust required.*","SessionType":"Pre-Compiler","Tags":["Other"],"Speakers":[{"Id":"3425edb2-7355-407e-805c-833c3c310883","FirstName":"Alex","LastName":"Burkhart","GravatarUrl":"//www.gravatar.com/avatar/e418839a7b75d39194c812c58b4f6913"}]},{"Id":2634,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Save Our Scrum (SOS)","Abstract":"Scrum may have one the brand-war as the most popular of Agile Methods - but is it working? Or, at least, could it work better?\r\n\r\nStandups become boring status meetings. Planning and commitments become command-and-control wishing followed by overtime. Testing stretches past the sprint boundary ... and that's just the beginning.\r\n\r\nMatt Heusser shares insights into why Scrum adoptions are so commonly challenged in organizations, along with tweaks for how to get back on track.","SessionType":"Regular Session","Tags":["Soft Skills / Business"],"Speakers":[{"Id":"ccd1bddf-2c93-4559-82f7-07092b297986","FirstName":"Matthew","LastName":"Heusser","GravatarUrl":"//www.gravatar.com/avatar/029780fa46bfc1d919adc994c3d0abb3"}]},{"Id":2871,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Scrum Training","Abstract":"Coming Soon","SessionType":"Pre-Compiler","Tags":["Other"],"Speakers":[{"Id":"68b23ea8-77d1-4744-a4ba-79bf8ee930b0","FirstName":"Alexei","LastName":"Govorine","GravatarUrl":"//www.gravatar.com/avatar/e8ad1e741d76cce0f67f141f1d2ec671"},{"Id":"bec20715-0769-418a-a2c3-35835e21e2b9","FirstName":"Ben","LastName":"Thorp","GravatarUrl":"//www.gravatar.com/avatar/25490321cf15e9d7cf3e82682b2133e7"}]},{"Id":2852,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"See How Easily You Can Create a Cross-Platform 3D Game Using Unity","Abstract":"Many developers decided to get into the software industry because of gaming. Many developers play games. Far fewer attempt making games. In this session, Chad Carter (who loves to play games and make games) will be showing how to get started using Unity. This 101 course will explain how the editor itself works and how Unity can be used out of the box with MonoDevelop or integrated to work with Visual Studio. Writing a game in Unity requires real coding and there will be plenty of coding examples. Fortunately, a lot of heavy lifting is done by the game engine. It has really never been easier to create a game. Using information from this session you will be able to jump right in and start creating your very own game that can be ran on all the major platforms. Unity 3D is free to create games for Windows, Windows 8, Windows Phone, Linux and Mac. There is a paid version for creating games on iOS and Android. Take some time to drop by and learn something fun.","SessionType":"Regular Session","Tags":["Mobile","JavaScript",".NET","Other"],"Speakers":[{"Id":"754c2bc9-86fe-46d4-a378-d773e0b392db","FirstName":"Chad","LastName":"Carter","GravatarUrl":"//www.gravatar.com/avatar/e52c7408c38a7e523da688dc2d251686"}]},{"Id":1312,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Stop Going Bald trying to Unit Test Android Applications.","Abstract":"Trying to do test driven development for Android applications can be a painful process and cause an already receding hairline to accelerate.  The Android Test framework is slow, and requires either an emulator or a physical device to test upon.  There are other solutions like Robotium or UIAutomator but these lend themselves to writing tests that drive the UI and lean toward Integration tests.  While these are necessary part of testing, they don't provide quick feed back to the developer.\r\n\r\nThis talk will discuss lessons learned from using Robolectric 2.3 and Mockito to bring some sanity to unit testing Android applications.  Allowing for a true test driven development with fast test execution and fast developer feedback of failures.   We will review some dos and don'ts when using Robolectric, and when Mockito may be a better fit.   Examples will be shown  from using these frameworks to provide unit test coverage for an Android TV application, but the same techniques can be used for any Android application.","SessionType":"Regular Session","Tags":["Mobile","Testing"],"Speakers":[{"Id":"919bfa57-d844-4cff-bf89-e88957489b60","FirstName":"David","LastName":"Carver","GravatarUrl":"//www.gravatar.com/avatar/fdec28d17fb2417999492a96fb338eae"}]},{"Id":2876,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Stopping the bad guys at the front door ","Abstract":"Coming Soon","SessionType":"Pre-Compiler","Tags":["Security"],"Speakers":[{"Id":"31dcfbce-f346-47c8-8f3a-0e240deb9c0c","FirstName":"Jim","LastName":"Manico","GravatarUrl":"//www.gravatar.com/avatar/04b8fca2c8dde2ed82373ade37e9789d"}]},{"Id":2621,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Story Mapping Made Real","Abstract":"The art of building software combines understanding the value it creates and capturing the vision of the user. The best tool developed, thus far, to capture these needs is a Story Map, a tool that is both easily learned and easily implemented. Join us to learn how to build a Story Map, break down that map into story cards, and advance through a process that will provide the details essential to successful development and execution of a project.","SessionType":"Pre-Compiler","Tags":["Design (UI/UX/CSS)","Soft Skills / Business"],"Speakers":[{"Id":"aa0fd178-9662-4b74-8d40-fa236ba9d88c","FirstName":"Daniel","LastName":"Davis","GravatarUrl":"//www.gravatar.com/avatar/1a0f2984a7532f18e9278f0c3e3e9d85"}]},{"Id":1302,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Swiftly Breaking Ground with iOS Development ","Abstract":"This is a beginners class to start developing iPhone or iPod applications using iOS.  Just bring your Mac laptop installed with Yosemite and Xcode 6 and you will create your first \"Hello World!\" application in the first hour of the day.\r\n\r\nThis session will give you the knowledge to start building iOS applications.  It will also give you the understanding of terminology to help follow along on other online training or presentations at the local CocoaHeads groups. Each topic includes some instruction time and some hands-on lab time. The material presented will also be available after the class has completed.\r\n\r\nThis introduction class was designed by Don Miller (GroundSpeed™) using his consulting background and teaching experience for his iOS development class at the University of Toledo.","SessionType":"Pre-Compiler","Tags":["Mobile"],"Speakers":[{"Id":"64ae5793-e96a-4b39-b1ee-73e27b037d49","FirstName":"Don","LastName":"Miller","GravatarUrl":"//www.gravatar.com/avatar/149b85ac6ec0a542d368fb821bfaddf2"}]},{"Id":2767,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Take control of your interface - Crafting API responses for your clients","Abstract":"Web frameworks help you build an API quickly but most have little support for dealing with an API that needs to evolve, forcing you to prematurely version your API.\r\n\r\nTake back control of the content you send over the wire.  API responses are the \"user interface\" of your API and should be crafted with same attention to detail that cause designers to fret over color choices, shadows and highlights.\r\n\r\n\r\nIn this talk I’ll show you what I have learned about API response design in the last 8 years of building Web APIs. I'll cover issues like structuring for evolution, sizing for optimum caching, the different ways to include metadata, media type selection and many other issues that surface when trying to design an API for the long haul.","SessionType":"Regular Session","Tags":["Cloud/Big Data","Other"],"Speakers":[{"Id":"0e7a43ab-f259-4d03-b28a-923bd5f7debb","FirstName":"Darrel","LastName":"Miller","GravatarUrl":"//www.gravatar.com/avatar/d88e410f1b6edb02394d0af408bbd68f"}]},{"Id":2741,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Take Your QA Team Out - Mobile Testing Strategies Everyone Should Know About","Abstract":"Rewriting your Master Testing Strategy is in order when you look to tackle your first mobile initiative. This includes getting your test environments ready for testing. Often test environments have been on closed internal networks that are not accessible from the internet. Delivering and testing a mobile application on a 3G or 4G network changes all that. Coming up with a supported platform strategy is also paramount to success. One needs to take network speed, device features, screen size and resolution as well as multi-tasking life-cycles into effect when testing. QA testers will need to become familiar on how to service the devices they test with as well. Additionally the team will need to incorporate field testing prior to delivery. This presentation will organize the challenges a modern QA team has to contend with, and make some strong suggestions on how to craft a respectable Mobile Test Strategy.","SessionType":"Regular Session","Tags":["Mobile","Testing"],"Speakers":[{"Id":"3cb8e713-ebfa-4b96-b4cd-2d22d96346e4","FirstName":"Geoffrey","LastName":"Goetz","GravatarUrl":"//www.gravatar.com/avatar/940906757c2b8631cab8b60f4adb61a3"}]},{"Id":2728,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Taking a Stroll with CoreMotion","Abstract":"This session will “walk\" through the CoreMotion framework. The Core Motion framework contains a lot of useful data that can be analyzed to understand what the user or the device itself is doing by reading the measurements of the iOS device. Along the way we will create a pedometer app and demonstrate several other facets of CoreMotion.","SessionType":"Regular Session","Tags":["Mobile"],"Speakers":[{"Id":"033e8cf2-0679-4ce1-9a55-336ceb05f520","FirstName":"BJ","LastName":"Miller","GravatarUrl":"//www.gravatar.com/avatar/35064367606e3ddd851bf73f605f844c"}]},{"Id":2843,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Tame your frontend stack with gulp.js","Abstract":"Modern frontend development requires an unparalleled number of auxiliary tools to get the job done. Frontend devs are forced to think about 3rd party package managers, CSS precompilers, Javascript code linters, design frameworks like Bootstrap, Javascript module systems, and of course Javascript frameworks and toolsets like Ember, Angular, or Backbone.\r\n\r\nIs the Javascript community crazy? Yes. Are all these disparate tools a bad thing? No. Not if you have a good build system.\r\n\r\nIn this talk, learn how to use gulp.js to combine the best of these Javascript and frontend tools and improve your development quality and speed. You will walk away with useable code for your build system as well as practical examples of how to create organized, modular Javascript code.\r\n\r\nThis talk is  for anyone who has to get their hands dirty with Javascript on the web.","SessionType":"Regular Session","Tags":["JavaScript"],"Speakers":[{"Id":"e39ffe86-abbb-4d41-af04-807fdebf3dba","FirstName":"Ben","LastName":"Gladwell","GravatarUrl":"//www.gravatar.com/avatar/69cf43fe99b65a6c6328e1b3aec60e57"}]},{"Id":16,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Ten Practical Tips for Automated Testing of Web Applications","Abstract":"60 minutes, ten takeaways for making solid functional User Interface tests of web applications. In this session we’ll quickly cover the fundamentals of how automated web functional tests work, then dive into practical solutions you’ll be able use on a daily basis. You’ll see how to create maintainable tests using the Page Object Pattern, handle complex asynchronous (timing!) situations, and deal with common controls like complex grids, trees, calendars, and a number of other “interesting” automation scenarios.\r\n\r\nYou’ll leave this session armed with knowledge you can immediately apply to make your automated functional tests faster, more maintainable, and easier to write!","SessionType":"Regular Session","Tags":["Testing"],"Speakers":[{"Id":"7d4be401-1141-4c31-b440-fed0a0c877ed","FirstName":"Jim","LastName":"Holmes","GravatarUrl":"//www.gravatar.com/avatar/fd80f9c58b06270d42356dd77a32defa"}]},{"Id":206,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Testing with Roslyn","Abstract":"Sometimes a language just can't express all the rules you want to enforce - or sometimes you want to break normal \"best practices\" in a very limited and controlled way.\r\n\r\nNow that Roslyn is open source, you *could* just change the language to fit your needs - but that's an option which is likely to make you unpopular with you colleagues. Instead, in many cases you can let the compiler act in a perfectly normal way - but rely on automated testing to enforce your custom rules.\r\n\r\nRoslyn gives much more scope for this than tools like StyleCop - it exposes the details of the compiler to you, so you can perform your own static analysis after the fact.\r\n\r\nThis session gives more insight into the motivation behind using a compiler as a test tool, and dives into the details of some specific real-world examples in an open source project.","SessionType":"Regular Session","Tags":[".NET","Testing"],"Speakers":[{"Id":"abec4332-6adf-41fe-9e60-0585e2e13bdb","FirstName":"Jon","LastName":"Skeet","GravatarUrl":"//www.gravatar.com/avatar/9e8277f815de909df256027d206ca72a"}]},{"Id":2457,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"The Analyst’s Cookbook: Practical Methods for Data Science using Redshift and R","Abstract":"In this presentation, we’ll provide a practical walkthrough of the methods and technologies needed to analyze large data sets and test results. The presentation will be divided into several parts.\r\n\r\nPart I -- Big Picture\r\nHere, we’ll focus on the big picture. What are the questions that we’re trying to answer? What data do we need to answer big questions?\r\n\r\nPart II -- Analysis Platform\r\nWe’ll focus on the creation of a data warehouse and the migration of transactional data into a format and platform appropriate for analysis. Here, we’ll talk about automation using Amazon’s S3 and Redshift products.\r\n\r\nPart III -- Analysis Database Architecture and Queries\r\nIn this step, we’ll discuss database architecture and query approach for analysis. We’ll introduce the idea of “dimensions” and “partitions,” which will be the central focus of our database structure.  \r\n\r\nPart IV -- Descriptive Analysis\r\nIn Part IV, we’ll talk about descriptive analysis. How to efficiently explore data and generate reports using D3 and PrinceXML. \r\n\r\nPart V -- Stats and Predictive Analysis\r\nIn Part V, we’ll talk statistics and prescriptive analysis, transitioning from SQL to R as a stats engine to create models and evaluate probabilities.","SessionType":"Regular Session","Tags":["Cloud/Big Data"],"Speakers":[{"Id":"546c5ea5-376a-4b2b-9541-49f72c90ecf6","FirstName":"Matt","LastName":"Dopkiss","GravatarUrl":"//www.gravatar.com/avatar/e47cf536ce790e5d88aad4ba62d23ddc"}]},{"Id":2712,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"The Bitly Stack: \"What did you use and when did you use it?\"","Abstract":"Bitly users create 1.3 million short links per hour and click on 8 billion links a month. How would you store all those link mappings? How would you analyze the metadata for each of those click events? How would you identify and filter out spam in real time? How would you efficiently track, sort, count, collate and deliver reports on all the permutations of data that you want tease out of that activity?\r\n\r\nBitly makes use of a wide variety of tools & technologies in its stack and each of those tools was chosen for a reason (sometimes, even a good reason). In this session we'll walk through the Bitly stack and explore the reasons each component was chosen for the given set of tasks it performs. We'll discuss Python, C, Go, Tornado, Memcache, NSQ, Hadoop, Riak, Redis, Elasticsearch, Jenkins, Fab, Excel, and more. Ok, maybe not Excel.","SessionType":"Regular Session","Tags":["Cloud/Big Data"],"Speakers":[{"Id":"adabd6d5-d513-449f-bb17-4bf59cabede8","FirstName":"Michael","LastName":"Richman","GravatarUrl":"//www.gravatar.com/avatar/fde0d4fe589b9d65999067467f858278"}]},{"Id":1224,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"The Business of You - 10 Steps for Running Your Career Like a Business","Abstract":"Smart businesses come up with a mission, vision, and values that define the way that they do business and help them focus for success. So why don't we apply the same ideas to our own lives and careers? I'll go over ten steps that you can take to run your career like a business, take control of your life, and help you work towards a successful life and career on your terms.","SessionType":"Regular Session","Tags":["Soft Skills / Business"],"Speakers":[{"Id":"c36fdf68-3b38-41c7-9445-4b694e1537f3","FirstName":"Jon","LastName":"Kruger","GravatarUrl":"//www.gravatar.com/avatar/1b5fa278d15bed48314e5dc064fbba18"}]},{"Id":2530,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"The Business Side of Starting Your Business","Abstract":"Starting a business is a dream for many professionals, and IT pros are no exception.  The draw of independence, self-reliance, growth and profit potential are all very appealing to the right kind of individual.  Indeed being a freelance consultant or part of a small company can prove to be extraordinarily rewarding.\r\n\r\nHowever, as folks say, \"with great power comes great responsibility.\"  Running a software business is about a lot more than writing code.  This session will consider the easily overlooked, but ever-important, legal and tax implications of your actions and decisions as a business owner.\r\n\r\nThe discussion will delve into the major issues facing new small businesses.  Topics include finding the right advisors; choosing an appropriate business entity (e.g., partnership, corporation, LLC); asset protection for your business and your family; taxes; and how to actually pay yourself.\r\n\r\nArmed with a bit of knowledge and the right questions, you will be able to approach your legal and tax advisors confidently, empowered to make the best possible decisions for your situation.","SessionType":"Regular Session","Tags":["Soft Skills / Business"],"Speakers":[{"Id":"75538a62-da47-413c-8c73-1fb87c6c3fa4","FirstName":"Jeff","LastName":"Strauss","GravatarUrl":"//www.gravatar.com/avatar/c546a0d187d12bb1c81f0918c956c55a"}]},{"Id":2747,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"The Cartography of Testing","Abstract":"Imagine diagramming your application like a map.  The methods might be like cities and the classes like states.  The more coupled two methods or classes are, the closer their cities or states may be to each other.  Let's spread this map out before us and ask, \"how do we best deploy our tests across this landscape\"?  There are many different kinds of test (unit, acceptance, etc.), each serving a different purpose.  What mix of these will best cover the terrain?  Well positioned tests can give us confidence in our code, document business rules, support refactoring, and make building new features easier.  But poorly positioned tests can just as easily undermine all these goals.  How do you find the right balance and test deployment strategy for your application's landscape?  In this talk, we will look at the tradeoffs in the different kinds of tests and survey recommendations for deploying them effectively.","SessionType":"Regular Session","Tags":["Testing"],"Speakers":[{"Id":"e846dcc8-bdc7-4acc-a694-02530b5d12e5","FirstName":"Kevin","LastName":"Berridge","GravatarUrl":"//www.gravatar.com/avatar/35e74c48a612d8a6786f8ab6424b49a1"}]},{"Id":36,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"The Dawn of the Reusable Web: Diving into Web Components","Abstract":"Modern web developers are drowning in a sea of div tags and JavaScript libraries. Our markup isn’t semantic. And there’s no standard for creating components that can be shared across projects. But there’s great news: Web components are coming to the rescue, and will dramatically redefine the way web apps are built. Learn how to create rich, powerful, and reusable components using tools you've already mastered: HTML5, JavaScript, and CSS. Explore the mysterious Shadow DOM and learn how it encapsulates components from manipulation by the outside world. And review the beauty and simplicity of injecting dependencies via HTML imports. These technologies are cutting-edge, but this session discusses how to begin leveraging their power to create reusable components that run in modern browsers, today!","SessionType":"Regular Session","Tags":["Mobile","JavaScript"],"Speakers":[{"Id":"1530aa67-88e9-460e-8e9c-c79de577508c","FirstName":"Cory","LastName":"House","GravatarUrl":"//www.gravatar.com/avatar/09e16ce7b4bc21025c9940f5a167cfa9"}]},{"Id":2543,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"The Empire Strikes Back; Azure DocumentDB","Abstract":"At long last, Microsoft speaks NoSQL. Redmond’s long awaited answer to the likes of MongoDB and RavenDB is the (still-in-preview) Azure DocumentDB database-as-a-service.  See how easy it is to create and configure a document database with the Azure Management Portal and immediately start to query its schema free data with familiar semantics that are common to relational database systems.  In this session we'll also take some time to look at some of DocumentDB's strengths/limitations, along with what scenarios make a good fit for using this product and how DocumentDB stacks up against its competitors.","SessionType":"Regular Session","Tags":[".NET","Cloud/Big Data"],"Speakers":[{"Id":"5789ca11-7bb2-48ed-b6b0-3ba792542bf2","FirstName":"David","LastName":"Green","GravatarUrl":"//www.gravatar.com/avatar/dc918ff640951ca60dc08ddae171fabb"}]},{"Id":1297,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"The Future of C# is Now!","Abstract":"It is an amazing time to be a C# developer! For the past several years, the C# team has been focused on rebuilding the compilers and editing experiences as part of Project Roslyn. That work has finally come to fruition and is paving the way for C# to continue evolving for many years to come. Come see what all of the buzz is about. Explore new C# 6 language features, tour the new C# editing experience, harness the power of the Roslyn APIs, and dig into the source of the C# compiler itself. This is a session that you won’t want to miss!","SessionType":"Regular Session","Tags":[".NET"],"Speakers":[{"Id":"511df42a-1095-49c5-8752-0c21f19fe486","FirstName":"Dustin","LastName":"Campbell","GravatarUrl":"//www.gravatar.com/avatar/b9f663242e51ae1e97aa5c2e396884fe"}]},{"Id":163,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"The History of Women in Tech","Abstract":"From general programming to documentation to compiler innovations, women have been instrumental in advancing the computing industry. Let’s take a trip through the history of computing and meet some of the women who helped get our industry to where it is today.\r\n\r\nSome of the inspiring women we’ll meet include Ada Byron (founder of Scientific Computing), Grace Murray Hopper (mother of COBOL), The ENIAC crew – Kay McNulty, Betty Jean Jennings, Betty Snyder, Marlyn Mescoff, Fran Bilas, and Ruth Lichterman, Adele Goldstine (ENIAC documenter), Frances Allen (First female to win the Turing award, known for her compiler optimizations), Mary Lou Jepsen (Founder and CTO of One Laptop Per Child), and Barbara Liskov (Liskov substitution principle).\r\n","SessionType":"Regular Session","Tags":["Other"],"Speakers":[{"Id":"43146ae1-27f2-4f09-9d80-33c4fcb2ea56","FirstName":"Sarah","LastName":"Dutkiewicz","GravatarUrl":"//www.gravatar.com/avatar/1f7524171730efe80e47b37f4afc53f2"}]},{"Id":1289,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"The Hitchhiker's Guide to Azure Mobile Services","Abstract":"Microsoft Azure Mobile Services provides a straightforward way to expose backend services to multiple applications on multiple devices. \r\nIn this presentation, I will show how to expose cloud data access and other processes via a REST interface and connect to that data from applications running on Windows Phone, Windows 8, iOs and Android. You will also learn how to secure these services; how to scale these services to meet volatile demand; how to push notifications to client apps; and how to manage Mobile Services from within Visual Studio.\r\n","SessionType":"Regular Session","Tags":["Mobile",".NET","Cloud/Big Data"],"Speakers":[{"Id":"f9233332-788b-4bf6-8191-4d8b973a9830","FirstName":"David","LastName":"Giard","GravatarUrl":"//www.gravatar.com/avatar/93560aa726daf996fea2aa4a83ccd8d8"}]},{"Id":2523,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"The Impact of Leveraging Open Source","Abstract":"Open source tools. We all use them. Whether it's an entire toolkit, a framework that meets some specific needs, or a simple custom control from NuGet, CodePlex, or CodeProject, it is hard to ignore the opportunity to improve the rate of development while learning new things from open source projects. But what does \"open source\" truly mean? Especially when working in a professional or corporate environment, what are our rights and limitations as open source consumers to use, modify, and redistribute these tools? Often that depends upon the authors' own decisions regarding project licensing. In this one-hour session, we will review a few of the core principals of open-source development and consumption, comparing and contrasting some of the more popular licenses in use today. We will then discuss both how to use the open source works of others and also how to properly license your own.","SessionType":"Regular Session","Tags":["Soft Skills / Business","Other"],"Speakers":[{"Id":"75538a62-da47-413c-8c73-1fb87c6c3fa4","FirstName":"Jeff","LastName":"Strauss","GravatarUrl":"//www.gravatar.com/avatar/c546a0d187d12bb1c81f0918c956c55a"}]},{"Id":118,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"The Jim Weirich Legacy","Abstract":"Just weeks after last year's Codemash, our community lost one of its giants with the death of Jim Weirich. Jim was a constant at Codemash and one of its most popular speakers. In this presentation, we'll reflect on the man and some of his best work:\r\n\r\n- highly influential projects such as Rake, Rspec/Given, and Builder\r\n- software design guidelines that lead to cleaner and more maintainable code\r\n- applying lessons and patterns from one language to another\r\n- mentoring others to help them learn\r\n- the importance of hacking and curiosity\r\n\r\nand more. Jim's work has made an impact on many and remains as relevant as ever. Come join us we look back on Jim's amazing legacy and how that output continues to prove valuable for us today.","SessionType":"Regular Session","Tags":["Ruby/Rails","Other"],"Speakers":[{"Id":"6e19a7c8-db38-480b-8258-9f9e72ae19b1","FirstName":"Mike","LastName":"Doel","GravatarUrl":"//www.gravatar.com/avatar/38716536d6ac1c63fc17ae4fa1cfca0c"}]},{"Id":2637,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"The Junior Developer Survival Guide","Abstract":"Are you new to the professional world of software development? Do you have new developers on your team? Are you wondering why college and the School of Hard Knocks did such a bad job preparing you to be a functional member of a high-performing team? Take some advice from a junior dev who has walked the path and learn to avoid rookie mistakes. Learn the skills employers value and how to get them. We will discuss quick return actions that can be undertaken immediately, as well as long term, slow-burn investments in your career. This session will focus on technical and interpersonal advice to help make your first job search, entry-level hire, and first year as a developer go smoothly. A great career won’t just fall into your lap. It takes dedication, skill, persistence, and more than a little luck. Happily, we make our own luck.","SessionType":"Regular Session","Tags":["Soft Skills / Business","Other"],"Speakers":[{"Id":"f3d07467-6721-4fb4-a27b-b4472519c80b","FirstName":"James","LastName":"York ","GravatarUrl":"//www.gravatar.com/avatar/6d10ee9ff627187e9d5b59e410fec248"}]},{"Id":2660,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"The Silver Lining: A Deep Dive into the Architecture of Distributed Databases","Abstract":"Traditional databases have relied on large servers, fast networks, and expansive storage to solve the problem of scale. In the last couple years, as “cloud” has become less of a buzzword, and more of a practical solution, traditional database architecture has presented a barrier to implementing medium to large scale applications.\r\nWhile the big players (Microsoft and Oracle) are beginning to find ways to adapt to the needs of a cloud architecture, they are being outpaced by a new crop of databases. These databases are designed from the ground up to solve the problem of cloud scale.\r\nThis session focuses on the theory behind database distribution, starting with a definition of the problem, and ending with the varying solutions that a number of the front-runners have implemented. While it has yet to be determined which approach will win, this session will prepare the audience to make intelligent decisions about which solution works best for their particular problem domain in the present and in the future.","SessionType":"Regular Session","Tags":["Cloud/Big Data","Other"],"Speakers":[{"Id":"5184fe1d-3b2c-4ae4-9748-4a11d41a0547","FirstName":"Michael","LastName":"Meadows","GravatarUrl":"//www.gravatar.com/avatar/954765ec98d01561285873097362e3ee"}]},{"Id":2834,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"The Social Developer","Abstract":"Do you have a hard time in social situations? Find it hard to talk in front of a crowd? This session is designed to give developers concrete techniques for overcoming these fears in order to succeed in social situations. Principles discussed will include how to appropriately meet new people, strike up conversations, and be comfortable in social situations. There will also be specific discussions for dealing with difficult situations in a graceful manner. The session will be highly collaborative, include demonstrations and audience participation.","SessionType":"Regular Session","Tags":["Soft Skills / Business"],"Speakers":[{"Id":"5f356f6a-6477-4bf1-8a87-079c19427699","FirstName":"Seth","LastName":"Juarez","GravatarUrl":"//www.gravatar.com/avatar/cc351a7c1ea116d1400349644ad8d66e"}]},{"Id":1245,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"The Top Reasons You Need to Learn about Data in Your Windows Phone App","Abstract":"You know you have to have a great experience when you develop your Windows Phone 8 applications right? The greatest experience you can give your users is around their data. There are ways to improve your Windows Phone 8 application and Chris Woodruff will teach you how to get data quickly, save it with validation, save it locally and many, many more tricks. Come see why you should know the tricks of the trade before developing that killer Windows Phone 8 app. You will be a Data Experience expert when you leave the room after this session.","SessionType":"Regular Session","Tags":["Mobile",".NET"],"Speakers":[{"Id":"11e2d7c8-4ef4-43e8-85f0-b1f10a744ee5","FirstName":"Chris \"Woody\"","LastName":"Woodruff","GravatarUrl":"//www.gravatar.com/avatar/1955b544932b88976cc86f0220ef15e3"}]},{"Id":1304,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"The Twelve Factor App: Best Practices for JVM Deployment","Abstract":"Twelve Factor apps are built for agility and rapid deployment. They enable continuous delivery and reduce the time and cost for new developers to join a project. At the same time, they are architected to exploit the principles of modern cloud platforms while permitting maximum portability between them. Finally, they can scale up without significant changes to tooling, architecture or development practices. \r\n\r\nIn this talk, you’ll learn the principles and best practices espoused by the Twelve Factor app. We’ll discuss how to structure your code, manage dependencies, store configuration, run admin tasks, capture log files, and more. You’ll learn how modern Java deployments can benefit from adopting these principles, and why they fit nicely within the cloud. ","SessionType":"Regular Session","Tags":["Java"],"Speakers":[{"Id":"8cbd8e4c-7fc7-4612-a360-12bd2709a5af","FirstName":"Joe","LastName":"Kutner","GravatarUrl":"//www.gravatar.com/avatar/fc9dc18f851317e79ac06ada2d74a99b"}]},{"Id":1305,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"The UX Toolbelt for Developers","Abstract":"When people hear the term user experience (UX), many automatically assume it’s a thing for only designers to understand.  That couldn’t be further from the truth. Throughout the development of a product – be it an application or a website, it is important to keep the end users in mind.  In the beginning, identify the target users and bond with them.  Empathy for the end user goes a long way in development, as this talk will show.  Interviewing, personas, usability testing, and refactoring are some of the tools that developers can wield while crafting solutions.  “The UX Toolbelt for Developers” will show developers how to take advantage of these UX  concepts to become better developers.","SessionType":"Regular Session","Tags":["Design (UI/UX/CSS)","Other"],"Speakers":[{"Id":"43146ae1-27f2-4f09-9d80-33c4fcb2ea56","FirstName":"Sarah","LastName":"Dutkiewicz","GravatarUrl":"//www.gravatar.com/avatar/1f7524171730efe80e47b37f4afc53f2"}]},{"Id":2550,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Things With Which to Measure the Universe","Abstract":"Hardware engineers have developed a large number of devices that can peer into the universe and turn its properties into numbers. How do these devices work? How do they communicate with computers? What sorts of problems show up when using them?\r\n\r\nThis talk demonstrates a collection of interesting sensors and how a computer uses them to measure properties of its environment such as temperature, pressure, and position.","SessionType":"Regular Session","Tags":["Hardware"],"Speakers":[{"Id":"d5b5c0b2-a9c8-480b-b7fd-13ccfe28d1a7","FirstName":"John","LastName":"Van Enk","GravatarUrl":"//www.gravatar.com/avatar/ed14e8cc54f4e05460109c60ea5a8478"}]},{"Id":100,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Thinking Fast and Slow","Abstract":"Ever wonder why it’s harder to recall events at certain times, like remembering how to recreate a bug?  Or why people are sure they have observed something they have not?  These issues affect all people, including developers and testers.  In his book Thinking Fast and Slow, Nobel winner Daniel Kahneman introduces two mental systems, one that is fast and the other slow. Together they shape our impressions of the world around us and help us make choices. System 1 is largely unconscious and makes snap judgments based upon memory of similar events and emotions. System 2 is painfully slow, and is the process by which facts are thought about consciously, carefully, and rationally. However, System 2 is easily distracted and System 1 is wrong quite often and is easily swayed by our emotions. These cognitive biases affect how people investigate, observe, and recall events.  This session will, through a few interactive games, learn how cognitive biases affect one’s abilities to investigate, observe, and recall events (all skills good testers need).  During those games, strategies are discussed to reduce the impacts of those cognitive biases.","SessionType":"Regular Session","Tags":["Testing","Soft Skills / Business"],"Speakers":[{"Id":"bf9b2e1f-b65b-4dc8-8ad2-edba88004656","FirstName":"Joseph","LastName":"Ours","GravatarUrl":"//www.gravatar.com/avatar/e8db3a295983267553712deca404aa72"}]},{"Id":73,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Traces of Errors: Getting A Better JavaScript Stack Trace","Abstract":"JavaScript fails in many ways. Perhaps an asset failed to load, maybe AJAX requests came back in a different order, or maybe the user installed some intrusive Ask Toolbar in their browser. Whatever the reason, too often the only clue is:\r\n\r\n\"TypeError: e is undefined, scripts.js, line 1\"\r\n\r\nLet's put an end to that. Let's find and fix the errors. This talk will show how the [object Error] works in old and modern browsers, how stack traces are created and formatted, and tricks to get better insight from errors. Let's explore how to get better context from errors and make the web a better place.","SessionType":"Regular Session","Tags":["JavaScript"],"Speakers":[{"Id":"6194005a-43b6-4511-9dde-97d6fa8c069a","FirstName":"Todd","LastName":"Gardner","GravatarUrl":"//www.gravatar.com/avatar/2c872fec31c4eb3fcf8229bef0cce42d"}]},{"Id":1259,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Tuning Java for Big Bacon ... er, Big Data!","Abstract":"Want your Hadoop environment to sizzle like bacon?  Perfect, because in the time it takes to fry 4 pounds of bacon, we'll identify causes of common performance issues in Big Data environments, discuss heap size, garbage collection, and JVM reuse tuning guidelines plus recommend tools to analyze your Big Data application performance.     ","SessionType":"Regular Session","Tags":["Cloud/Big Data","Java"],"Speakers":[{"Id":"c78df852-d7f7-4278-8f99-3488aa08ef11","FirstName":"Scott","LastName":"Seighman","GravatarUrl":"//www.gravatar.com/avatar/94fb6232f790a592bf3404e565c9c261"}]},{"Id":1198,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Unit testing asynchronous code","Abstract":"Asynchronous code is awesome, but it presents some unique difficulties for unit testing. Come to this session to learn practical techniques for unit testing code using async/await.\r\n\r\nYou'll first learn how to conceptually model async/await, which helps you avoid the most common async problems. Moving on, this talk covers the current state of async unit testing in various frameworks and libraries; and tips on how to properly mock/stub asynchronous code.\r\n\r\nBy the end of this session, you will have a full grasp of how to unit test asynchronous code, and you'll have an arsenal of techniques to address even the most complex scenarios.\r\n","SessionType":"Regular Session","Tags":[".NET","Testing"],"Speakers":[{"Id":"725a9289-2455-42f3-92b1-4b227319595b","FirstName":"Stephen","LastName":"Cleary","GravatarUrl":"//www.gravatar.com/avatar/3db7b6e14d9da42751e4bab03bc4d034"}]},{"Id":2695,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Using Docker & Fig to Develop and Unit Test JEE Components","Abstract":"Java Enterprise Edition (JEE) is a mainstay of many enterprises. However, even after 15 years of use in the industry, there still isn't an easy way to create a consistent development environment for all team members and unit test server-deployed components. JEE developers still experience the pain of big bang integration testing unless they're willing to put forth the time intensive work required to create unit-testable server-deployed components. Using Docker in conjunction with Fig (fast, isolated, development environments) makes it easy to unit test server-deployed components. This session demonstrates how using Docker in your continuous integration environment brings new levels of agility to JEE development.\r\n\r\nAlong with a discussion of the benefits of creating layered Docker images, you will also learn how to:\r\n\r\n* Create a layered JEE Application Server image\r\n\r\n* Layer a domain on top of the JEE Application Server image\r\n\r\n* Autodeploy a JEE application to the domain\r\n\r\n* Create a layered Derby image\r\n\r\n* Use Fig  to control multiple images\r\n\r\n* Use Hudson/Jenkins to drive Fig for unit testing JEE components","SessionType":"Regular Session","Tags":["Testing","Java"],"Speakers":[{"Id":"31b954d8-b7f4-4d59-9b74-ce7377f77624","FirstName":"Don","LastName":"Taylor","GravatarUrl":"//www.gravatar.com/avatar/6becc18433480b5f7ddf8d08a0c9fa99"}]},{"Id":2746,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Using Modern Browser APIs to Monitor and Improve the Performance of Your Web Applications","Abstract":"Performance matters.  How fast your site loads -- not just on your development machine, but from your actual customers, across the globe -- has a direct impact on your visitors' happiness and conversion rate.  Today's browsers provide several new cutting-edge performance APIs that can give you Real User Metrics (RUM) of your live site's performance.  Whether you run a small blog or a top-1K site, monitoring and understanding your performance is the key to giving your visitors a better experience.\r\n\r\nWe will be discussing the NavigationTiming, ResourceTiming and UserTiming performance APIs, which are available in the majority of modern browsers.  You'll walk away with a better understanding of what problem these APIs solve and how to start using them today.  We’ll also go through both D.I.Y. and commercial options that utilize these APIs to help you better monitor and improve the performance of your websites.","SessionType":"Regular Session","Tags":["Testing","Other"],"Speakers":[{"Id":"85c212b8-355b-43bc-b086-cd6879950cd1","FirstName":"Nic","LastName":"Jansma","GravatarUrl":"//www.gravatar.com/avatar/080d3622ca21aa320119f6015abaafe6"}]},{"Id":2622,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Web Development with Python and Django","Abstract":"Get up to speed on web development with Python, the language that \"fits your brain,\" and Django, the web framework \"for perfectionists with deadlines.\" We'll strengthen your Python muscles by guiding you through the construction of a full website using modern Django idioms that make things like user registration and CRUD apps a breeze.\r\n\r\nAttendees should bring a laptop with Python (2.7 or 3.4) and Git already installed. Some previous Python experience will be helpful but not required; newcomers to Python should plan to pair with a more experienced Pythonista.\r\n\r\nSetup instructions and slides will be available at https://github.com/mpirnat/django-tutorial.","SessionType":"Pre-Compiler","Tags":["Other"],"Speakers":[{"Id":"cecf54db-632a-408f-b1dc-0c9050e4743b","FirstName":"Mike","LastName":"Pirnat","GravatarUrl":"//www.gravatar.com/avatar/e4c5e3c69566ff80db62a4ab521b6e5a"}]},{"Id":18,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Web UI Testing from Acceptance Criteria to Zip Files","Abstract":"This session lays out the fundamentals of working with automated functional testing. We’ll start with discussing how important clear acceptance criteria are, then do practical implementations of functional tests dealing with common situations such as input validation, AJAX delays, and yes, downloading Zip files.\r\n\r\nAlong the way you’ll pick up critical concepts like dealing with a web page’s DOM, element locators, and tools to help you interact with these. You’ll also learn UI automation programming concepts like the Page Object Pattern, implicit and explicit waits, and modularizing your tests. \r\n\r\nYou’ll also learn why testing at the UI isn’t enough—and you’ll learn how to build helper APIs to handle true testing heuristics as part of your tests.\r\n\r\nAdditionally, you’ll see where you need to work together with developers to create a system that’s more easily testable. We’ll walk through simple changes you can make to your UI, and we’ll look at how turning off features like CAPTCHA can ease your testing woes and dramatically decrease your scotch consumption.\r\n\r\nThis session focuses primarily on automating web tests, but many of the same concepts can be applied to other UI environments too. Demos and labs will be in C# using WebDriver, but we’ll also discuss Watir, MS Web Test, and Telerik’s Test Studio. You’ll also learn how Jeff Morgan’s page_objects gem might be a great fit for your environment if you’re working with Ruby. We'll briefly cover acceptance tools like Fitness and Cucumber, and how they can bring great value to your process, too.\r\n\r\nYou’ll leave this session having learned how to deal with functional testing from A to Z. You’ll also learn critical factors for success in keeping your tests running quickly, and avoiding brittle tests that break frequently.","SessionType":"Pre-Compiler","Tags":["JavaScript","Ruby/Rails",".NET","Testing"],"Speakers":[{"Id":"7d4be401-1141-4c31-b440-fed0a0c877ed","FirstName":"Jim","LastName":"Holmes","GravatarUrl":"//www.gravatar.com/avatar/fd80f9c58b06270d42356dd77a32defa"}]},{"Id":2614,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"What to Learn After DRY, and Why","Abstract":"Ruby is very friendly and a great choice for developers kicking off their careers.  It is also a mirror.  It reflects what you know about yourself.  By exploring our own mental strengths and limitations, we can learn how to hone our skills to write amazingly better code.\r\n\r\nWhile all examples are focused on Ruby, the techniques are all about you, the developer.  The session will explain the psychological underpinnings of Don’t-Repeat-Yourself.  With the groundwork framed we explore Tell-Don’t-Ask, Functional Core, and module/class/method naming with insights to help make good decisions balancing human mental faculties versus the capabilities of the computer.\r\n","SessionType":"Regular Session","Tags":["Ruby/Rails","Soft Skills / Business"],"Speakers":[{"Id":"4274d92f-9dee-400a-a793-ff1677295ff4","FirstName":"R.J.","LastName":"Osborne","GravatarUrl":"//www.gravatar.com/avatar/370b8664950138c96cbb53e3f612797c"}]},{"Id":1242,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"What you don’t know about crypto can hurt you!","Abstract":"Think your data is safe? Don't be so sure. While crypto plays a role in nearly every system of any complexity, it’s often flawed due to common misunderstandings of how it should be implemented. This presentation discusses common mistakes seen in the wild, such as using the wrong block mode, misusing IVs, insecure password storage, poor key generation, and others. While this may sound like gibberish to the uninitiated, these issues, and how to tackle them will be clearly explained. Useful, practical advice for designing secure systems will be given along the way, making it easier to catch these mistakes before they make it to production - saving time, and protecting companies and users alike.","SessionType":"Regular Session","Tags":["Security"],"Speakers":[{"Id":"7bf0d181-ceba-4a4e-a829-b03fa77de40d","FirstName":"Adam","LastName":"Caudill","GravatarUrl":"//www.gravatar.com/avatar/49e14cf9f67c48aad082dec4f106f19a"}]},{"Id":1281,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"When They Ask About Security, What Do You Say?","Abstract":"In the old days, you were a small, scrappy startup, cranking out code just fast enough to make the deadline and get the next deal closed. Now, you're a Serious Business, and Important People wearing Important Suits are asking you Important Questions about how secure your software is. And they don't like the \"{hot new framework} is taking care of that for us\" answer. So what do you do?\r\n\r\nEasy: OWASP has you covered. The Top Ten are the most common vulnerabilities you'll encounter, but they're pretty easy to avoid if you know how. There's even example code for each one -- it's in Ruby on Rails, but that's not the point. The point is to answer Important Questions and get back to hacking.","SessionType":"Regular Session","Tags":["Ruby/Rails","Security"],"Speakers":[{"Id":"bfc75e0f-1187-41f2-b463-715d85962ae1","FirstName":"Jon ","LastName":"Canady","GravatarUrl":"//www.gravatar.com/avatar/9a45082056ded462905aa0382900a9e4"}]},{"Id":2503,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Working Lean","Abstract":"How fast can you learn whether your product is going to be a hit or a dud?\r\n\r\nEver since the Agile Manifesto was drafted in February of 2001, the principles of agile software development have come to dominate the way we go about building systems. Over the last few years, an evolution of that agile thinking has emerged under the banner of Lean. Much like agile, the emphasis is on getting rapid feedback and embracing change. But where agile is primarily focused on how you go about building software the right way, lean thinking broadens that to ensure you’re building the right thing in the first place.\r\n\r\nIn this workshop, we’ll give you some practical experience in how to work lean. We’ll start by forming small cross-functional teams and ensure each has a product idea (either one of their own or one that is assigned). Then, each team will put into practice the lean practices that are designed to help you eliminate wasted time and effort in finding product/market fit. You’ll identify core underlying assumptions about the product/business. Then you’ll design and conduct experiments which can help you assess the validity of those assumptions. Based on what you learn, you’ll adjust the core idea and iterate until you have a product idea that is better than what you started with.\r\n\r\nThis is a great session for the technical and non-technical alike.","SessionType":"Pre-Compiler","Tags":["Soft Skills / Business"],"Speakers":[{"Id":"6e19a7c8-db38-480b-8258-9f9e72ae19b1","FirstName":"Mike","LastName":"Doel","GravatarUrl":"//www.gravatar.com/avatar/38716536d6ac1c63fc17ae4fa1cfca0c"},{"Id":"7645c54a-325e-4fff-a18c-8cd87bd60020","FirstName":"Gina","LastName":"Winkler","GravatarUrl":"//www.gravatar.com/avatar/31232f8fd8c8f05be6bd243a6355b098"}]},{"Id":2580,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"You can't do that on television! Developing apps for the Chromecast","Abstract":"Google recently changed the landscape of home media with a $35 device the size of a pack of gum. Perhaps more compelling is that this device has made it easier than ever to develop applications for the television. This talk will translate your existing, well honed web development skills into the tools necessary to reach the largest screen in your living room. Green slime will not be included.","SessionType":"Regular Session","Tags":["Hardware","JavaScript"],"Speakers":[{"Id":"665c02b7-e021-46ea-8635-e6fa6d9c3818","FirstName":"Dusty","LastName":"Burwell","GravatarUrl":"//www.gravatar.com/avatar/6343ef938226f72218388cb8f0eec754"}]},{"Id":1298,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"You may be at the Kalahari, but IT ain’t nothing like the real thing: The state of Information Technology in Africa","Abstract":"“I do not see the countries and peoples of Africa as a world apart; I see Africa as a fundamental part of our interconnected world”, President Barak Obama at US – Africa Summit in August, 2014. What he said here applies to the IT world as well. Companies and IT workers can’t afford to ignore what is going on in Africa. There are over 50 countries that make up Africa and this is a growing segment in terms of IT workers and market. A recent report by CNN stated that six African countries make up some of the world's fastest developing economies. Many of these countries have begun to position themselves as being IT havens for education, innovation, and entrepreneurship. From m-pesa to mHealth and the Kigali kLab to the Nairobi iHub, come and learn about some of the emerging IT trends that are being developed in and for Africa and how you can help inspire a new generation of young African IT women and men to obtain new heights.","SessionType":"Regular Session","Tags":["Soft Skills / Business","Other"],"Speakers":[{"Id":"4ea36ee0-7e54-4a90-9487-cb34812b7f75","FirstName":"Russ","LastName":"McMahon","GravatarUrl":"//www.gravatar.com/avatar/120ef58fff48751a0b80ff6192b5fc89"}]},{"Id":130,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"You Need to Quit Your Job","Abstract":"Do you have a job that's exciting?  A job that you can't wait to get out of bed and contribute to?  A team that you respect and enjoy working with?  A management structure that makes great data-based decisions and a process that you feel really works?\r\n\r\nIf so, this talk is not for you.  \r\n\r\nIf you feel trapped in a job that doesn't make you happy, this session will highlight key organizational antipatterns that signal things aren't going to get better.  Be warned, however.  You may leave this session with the motivation to change your life for the better and truly embrace happiness in newfound employment!","SessionType":"Regular Session","Tags":["Soft Skills / Business"],"Speakers":[{"Id":"a34df934-9f99-4445-aecb-5ec0e18d7495","FirstName":"Kevin","LastName":"Davis","GravatarUrl":"//www.gravatar.com/avatar/d70dbe437302f0300c2dbeebe7a1b497"}]},{"Id":2790,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"You Won't Believe What Microsoft is Doing with Industrial Things on the Internet","Abstract":"Animal. Vegetable. Mineral. Machine.  All these are part of the Internet of Things (IoT), which is a buzzword often discussed as of late, but not a new thing. Many vendors are entering the race to provide a turnkey solution from the devices to the middleware to the analytics; one of which is Microsoft with their Azure Intelligent Systems Service (ISS).  In this session, you will gain an understanding of what ISS is, how it works, and if it might be a fit for you and your things. We’ll explore (and demo) device connectivity from multiple platforms, cloud services and data processing, and analytics and visualization.  You will also leave with tips and tricks from gained from working with ISS prior to its public availability","SessionType":"Regular Session","Tags":["Cloud/Big Data","Other"],"Speakers":[{"Id":"5cf75ddc-4d47-40cd-8199-7f1ad0acf781","FirstName":"Nino","LastName":"Benvenuti","GravatarUrl":"//www.gravatar.com/avatar/023eec99ae3f7c7079374be929d0f455"}]},{"Id":2658,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"You’re Going to Build an Android App at CodeMash!","Abstract":"Seriously! All the way to production! During this 8 hour session, we’ll walk you through the fundamentals of Android development. We’ll start at the very beginning, setting up a brand spankin' new project in Android Studio. At the end of the session you'll push your newly created app to the Google Play store.\r\n\r\nWe’ll be covering A LOT of material and we’ll be moving quickly! To make sure that folks don’t fall too far behind, we’ll be posting checkpoints and session material out on Github.\r\n\r\nCome prepared to have fun, learn a ton, and build something awesome!","SessionType":"Pre-Compiler","Tags":["Mobile"],"Speakers":[{"Id":"2574ca8c-a7a8-436a-96b4-d799ac475671","FirstName":"Dave","LastName":"Shah","GravatarUrl":"//www.gravatar.com/avatar/15e2b24e4476b47cb88952da7a11a36f"}]},{"Id":2412,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Your Flying Car is Ready: Amazing Programming Tools? of the Future, Today!","Abstract":"What if simply writing tests was enough to produce a program which makes them pass? What if your compiler could guarantee that your “Heartbleed-free” OpenSSL replacement follows the TLS specification to the letter, and even finds inconsistencies in the specification itself? What if you could write a test which showed that your code had no unintentional behavior, ever? Microsoft Research is well known for its contributions to Kinect, F#, the Entity Framework, and more, but it's also the home of a number of programming tools which do things which many programmers would consider surprising, if not impossible. But they work, and in this session you'll see them in action.\r\n\r\nThe Dafny language can check contracts at compile time. The Z3 theorem prover can solve problems from specifications alone, and is used to make Hyper-V and Windows Azure memory safe. The F7 specification language for F# was used by its authors used it to not only produce a TLS implementation which provably follows the spec, but also identified a dangerous hole in the TLS specification itself. You'll learn how Amazon uses the TLA+ specification language to prove that there are no edge cases in its internal protocols. Far from being research toys, these tools are in daily use in cases where stability, security, and reliability of code matters most. Can they help with your hardest problems? You might be surprised!","SessionType":"Regular Session","Tags":[".NET","Testing","Functional Programming","Security"],"Speakers":[{"Id":"1683cefd-7c34-428d-8a8d-fbf9505eec74","FirstName":"Craig","LastName":"Stuntz","GravatarUrl":"//www.gravatar.com/avatar/a45302e072f5c7cfd34d18328139ff66"}]},{"Id":2766,"SessionTime":"0001-01-01T00:00:00","SessionStartTime":"0001-01-01T00:00:00","SessionEndTime":"0001-01-01T00:00:00","Room":null,"Rooms":null,"Title":"Zero to Production in Twelve Weeks with F# on the Web","Abstract":"Most people think of F# as good at math or complex problem solving. It is actually fantastic for a very wide array of tasks, including web programming, which helped the start-up Tachyus go from 0 to production in 12 weeks. In this talk, we'll compare and contrast a web application written in familiar C# patterns with various features provided by F#, including function composition, computation expressions (async), type providers, and active patterns. We'll also cover differences in application design patterns.","SessionType":"Regular Session","Tags":[".NET","Functional Programming"],"Speakers":[{"Id":"5a82a165-0f5e-45e1-b355-cb172ca4c712","FirstName":"Ryan","LastName":"Riley","GravatarUrl":"//www.gravatar.com/avatar/383ac8889ab4215414c57e2b767ec7fa"}]},{"Id":2702,"SessionTime":"2015-01-08T08:00:00","SessionStartTime":"2015-01-08T08:00:00","SessionEndTime":"2015-01-08T09:00:00","Room":"Zambezi","Rooms":["Zambezi","Nile"],"Title":" Keeping yourself DRY with conventions","Abstract":"We’ve been taught that duplication is bad, and copy-paste programming is evil. The Don’t Repeat Yourself principle tells us to stop the cycle of evil, but merely building abstractions only gets us a little DRY.\r\n\r\nHow can we get completely DRY? This is where conventions come in. Conventions can make your app smarter, getting rid of the obvious stuff without having to resort to more rudimentary tools like code generation.\r\n\r\nYou'll see common tools that embrace conventions, where they work well and what pitfalls to avoid. You’ll also look at building your own conventions in the web, mobile and more. Finally you'll look at diagnostics and testing to remove the magic that scares too many developers away.","SessionType":"Regular Session","Tags":["JavaScript",".NET"],"Speakers":[{"Id":"fb46aa8e-e81e-498d-a7d5-638a1c643679","FirstName":"Jimmy","LastName":"Bogard","GravatarUrl":"//www.gravatar.com/avatar/cc359c5ccf90d7a24b5976316797b5ec"}]}]